{"_id":{"$oid":"5fa32dab11c6543f14928bbe"},"title":"Pointwise Used in Topology Optimization of Automotive Components","abstract":"Learn how Pointwise was used in combination with Helyx Adjoint to enable fully automated performance-driven design evolution and optimization of automotive components. Read the case study.","postDate":{"$date":"2020-05-15T00:00:00Z"},"imgUrl":"Main-Image-HVAC-3840x1200.png","imgAltText":"Optimized Automotive Heat Duct Design Minimizes Power Loss","author":"","clientName":"ENGYS","clientLogo":"Engys-Logo-400.png","clientSinceHead":"Client Since","clientSince":"2014","clientAboutHead":"About the Client","clientAbout":"ENGYS was founded by a group of highly experienced engineers and CFD developers with the objective of exploiting open-source technologies within the ambit of numerical simulation software and computer-aided engineering (CAE). ENGYS offers a comprehensive range of customer-driven CFD products and services for enterprise engineering. The ENGYS mission is to leverage open-source technologies to deliver highly innovative, cost-effective CFD software solutions for enterprise to a global client base without compromising on quality or scope of service.","challenge":"Fluid flow performance and behavior are becoming increasingly important for the design of automotive vehicle shape and key components with increasing pressure to improve design performance while reducing cost and time to market.","solution":"ENGYS Limited, a provider and user of open-source technologies for computational fluid design (CFD) and design optimization, combined Pointwise high-quality unstructured mesh generation for CFD with Helyx Adjoint to provide efficient and effective topology optimization of automotive components.","benefit":"Combining Pointwise’s powerful unstructured mesh generation with Helyx Adjoint sensitivity based shape optimization enables fully automated performance-driven design shape evolution and optimization to meet target performance objectives.","ymal1Title":"Researchers use CFD to Help Quantify the Benefits of Truck Platooning Technologies","ymal1Img":"ymal1.png","ymal1Alt":"truck mesh","ymal1Abstract":"Find out how CFD is helping the commercial trucking industry develop platooning technologies for safer roads and increased fuel efficiency.","ymal1Url":"https://info.pointwise.com/cfd-help-quantify-benefits-truck-platooning-technologies","ymal2Title":"Using CFD to Help Increase the Safety of Driverless Cars","ymal2Img":"ymal2.png","ymal2Alt":"Truck simulations","ymal2Abstract":"Autonomous vehicles are expected to become a viable form of transportation sometime in the first half of this century. One of the major hurdles will be to provide these cars with the artificial intelligence they need to position themselves in a location where there is less drag for optimal fuel efficiency, travel time, and stability. Ultimately, it should lead to fewer serious accidents and safer roads. Find out how Pointwise is helping researchers in the automotive industry do that.","ymal2Url":"../../case-studies/Using-CFD-Increase-Safety-Driverless-Cars/index.html","ymal3Title":"Pointwise delivers fast, accurate results for Garry Rogers Motorsport","ymal3Img":"ymal3.jpg","ymal3Alt":"Garry Rogers Motorsports V8 Supercar","ymal3Abstract":"Due to governing body rule changes, Garry Rogers Motorsport needed to design and build a completely new V8 Supercar without blowing their budget and schedule. By moving their CFD meshing to Pointwise, Garry Rogers Motorsport was able to significantly reduce their hours spent generating meshes while also having a great deal of confidence in the results.","ymal3Url":"https://info.pointwise.com/pointwise-delivers-fast-accurate-results-garry-rogers-motorsport","gated":true,"caseStudy":"<p> \t\t\t\t\tFluid flow performance and behavior are becoming increasingly important for the design of automotive vehicle shape and key components with increasing pressure to improve design performance while reducing cost and time to market. The goal is to generate optimal design shapes within the available space that provide the desired performance for specified design goals such as drag, lift, swirl and tumble, flow uniformity, noise reduction, material reduction, and reduced energy requirements. \t\t\t\t</p>  \t\t\t\t<blockquote class=\"blockquote pw-blue text-center\"> \t\t\t\t\t<p class=\"mb-0\">&ldquo;Adjoint optimization easily connects optimization to design goals.&rdquo;</p> \t\t\t\t\t<footer class=\"blockquote-footer\">Daniel P. Combest, ENGYS LLC</footer> \t\t\t\t</blockquote>  \t\t\t\t<p> \t\t\t\t\tENGYS leveraged open-source CFD and in-house developed adjoint optimization technologies coupled with Pointwise<sup>&reg;</sup> powerful meshing capabilities to deliver highly innovative and efficient flow performance-based topology optimization for automotive design applications. \t\t\t\t</p>  \t\t\t\t<h2>Combining Pointwise and HELYX Adjoint makes CFD performance-based optimization practical</h2>  \t\t\t\t<p> \t\t\t\t\tOne of the key challenges related to CFD performance-based optimization is the complexity of geometry upgrades and remeshing in the process.  This can easily become overly complex, difficult to manage, possibly unstable, and expensive in terms of both effort and time. To overcome this challenge, ENGYS combined high-quality unstructured mesh generation for CFD from Pointwise with HELYX Adjoint to provide efficient and effective topology optimization of automotive components. \t\t\t\t</p>  \t\t\t\t<p> \t\t\t\t\tPointwise provided the underlying automatic meshing of surfaces and volumes to provide high-quality consistent CFD meshes. The high-quality unstructured meshing in Pointwise was a fundamental key to enabling stability of the CFD solutions, which are an integral part of the fully automated performance-driven adjoint-based topology optimization. If the mesh generation is not consistent between design iterations, the optimizer can be led astray to a non-optimum design. \t\t\t\t</p>  \t\t\t\t<blockquote class=\"blockquote pw-blue text-center\"> \t\t\t\t\t<p class=\"mb-0\">&ldquo;Pointwise is a powerful unstructured meshing tool that generates high-quality meshes for CFD.&rdquo;</p> \t\t\t\t\t<footer class=\"blockquote-footer\">Daniel P. Combest, ENGYS LLC</footer> \t\t\t\t</blockquote>  \t\t\t\t<p> \t\t\t\t\tThe combination of HELYX Adjoint with Pointwise meshing resulted in efficient, stable, and effective design optimization of automotive components for fluid performance design goals. \t\t\t\t</p>  \t\t\t\t<h2>Continuous Adjoint Methodology in Helyx Adjoint</h2>  \t\t\t\t<p> \t\t\t\t\tThe adjoint method in HELYX Adjoint leverages the calculation of sensitivities that provide insight into shape changes to improve performance. These sensitivities are then used by Helyx Adjoint to drive surface shape optimization or topology optimization of a volume. \t\t\t\t</p>  \t\t\t\t<p> \t\t\t\t\tHELYX Adjoint leverages an open-source CFD solver with in-house developed adjoint-based topology optimization that evolves the volume boundary through an immersed level set approach. In simpler terms, the mesh is generated for the available design space and does not change. The shape boundaries of the design volume are then determined through an iterative level set approach based on the design performance goals, results, and sensitivities. \t\t\t\t</p>  \t\t\t\t<img data-src=\"images/Fig1-Immersed-Boundary-level.png\" alt=\"Immersed Boundary Level Set\" \t\t\t\t\tclass=\"img-fluid center-block\" /> \t\t\t\t<figcaption> \t\t\t\t\tFigure 1: Immersed Boundary Level Set \t\t\t\t</figcaption>  \t\t\t\t<p> \t\t\t\t\tThe immersed boundaries generated by HELYX Adjoint also use curvature to control the manufacturability of the final shape. \t\t\t\t</p>  \t\t\t\t<h2>Automotive HVAC Duct Design</h2>  \t\t\t\t<p> \t\t\t\t\tThe first application case for topology optimization explored by Daniel Combest of ENGYS was topology optimization of an automotive HVAC duct. The first step was to determine the available package design space with one inlet and one outlet. \t\t\t\t</p>  \t\t\t\t<p> \t\t\t\t\tThe next step was to determine the case setup for HELYX Adjoint. \t\t\t\t</p>  \t\t\t\t<ul> \t\t\t\t\t<li>HELYX Adjoint case setup \t\t\t\t\t\t<ul> \t\t\t\t\t\t\t<li>Flow characteristics \t\t\t\t\t\t\t\t<ul> \t\t\t\t\t\t\t\t\t<li>Air at a constant temperature </li> \t\t\t\t\t\t\t\t\t<li>Incompressible flow (7 [L/s])</li> \t\t\t\t\t\t\t\t\t<li>k-w SST turbulence model (primal)</li> \t\t\t\t\t\t\t\t</ul> \t\t\t\t\t\t\t</li> \t\t\t\t\t\t\t<li>Mesh Characteristics \t\t\t\t\t\t\t\t<ul> \t\t\t\t\t\t\t\t\t<li>Unstructured mesh with tetrahedra cells (330,000) converted to arbitrary polyhedral (63,000)</li> \t\t\t\t\t\t\t\t</ul> \t\t\t\t\t\t\t</li> \t\t\t\t\t\t\t<li>Optimization Objectives \t\t\t\t\t\t\t\t<ul> \t\t\t\t\t\t\t\t\t<li>Minimize power loss</li> \t\t\t\t\t\t\t\t\t<li>Minimize total volume</li> \t\t\t\t\t\t\t\t</ul> \t\t\t\t\t\t\t</li> \t\t\t\t\t\t</ul> \t\t\t\t\t</li> \t\t\t\t</ul>  \t\t\t\t<img data-src=\"images/Fig2-HVAC-Duct-800x460.png\" alt=\"Optimized Automotive HVAC Duct Flow Performance\" \t\t\t\t\t class=\"img-fluid center-block\" /> \t\t\t\t<figcaption> \t\t\t\t\tFigure 2: Optimized Automotive HVAC Duct Flow Performance \t\t\t\t</figcaption>  \t\t\t\t<p> \t\t\t\t\tThe automatic topology optimization in HELYX Adjoint converged to the overall shape in less than 100 iterations and a final state geometry in 300 iterations that captured all relevant physics and reduced power loss by 33 percent and volume by 52 percent. \t\t\t\t</p>  \t\t\t\t<h2>Motorsport Intercooler Design</h2>  \t\t\t\t<p> \t\t\t\t\tThe second application case explored by Dr. Combest of ENGYS was topology optimization of a motorsport intercooler. The first step was to determine the available package design space with one inlet and two outlets. \t\t\t\t</p>  \t\t\t\t<p> \t\t\t\t\tThe next step was to determine the case setup for Helyx Adjoint. \t\t\t\t</p>  \t\t\t\t<ul> \t\t\t\t\t<li>HELYX Adjoint case setup \t\t\t\t\t\t<ul> \t\t\t\t\t\t\t<li>Flow characteristics \t\t\t\t\t\t\t\t<ul> \t\t\t\t\t\t\t\t\t<li>Incompressible flow at 50 l/s</li> \t\t\t\t\t\t\t\t\t<li>Approximate tube bundle as porous media with preserved volume of tubes</li> \t\t\t\t\t\t\t\t</ul> \t\t\t\t\t\t\t</li> \t\t\t\t\t\t\t<li>Mesh Characteristics \t\t\t\t\t\t\t\t<ul> \t\t\t\t\t\t\t\t\t<li>1.6 million tetrahedral cells converted to 307k polyhedral</li> \t\t\t\t\t\t\t\t</ul> \t\t\t\t\t\t\t</li> \t\t\t\t\t\t\t<li>Optimization Objectives \t\t\t\t\t\t\t\t<ul> \t\t\t\t\t\t\t\t\t<li>Minimize volume </li> \t\t\t\t\t\t\t\t\t<li>Minimize curvature for manufacturability</li> \t\t\t\t\t\t\t\t\t<li>Minimize power loss</li> \t\t\t\t\t\t\t\t\t<li>Maximize uniformity</li> \t\t\t\t\t\t\t\t</ul> \t\t\t\t\t\t\t</li> \t\t\t\t\t\t</ul> \t\t\t\t\t</li> \t\t\t\t</ul>  \t\t\t\t<img data-src=\"images/Fig3-Motocross-Intercooler-800x450.png\" alt=\"Optimized Motorsport Intercooler\" \t\t\t\t\t class=\"img-fluid center-block\" /> \t\t\t\t<figcaption> \t\t\t\t\tFigure 3: Optimized Motorsport Intercooler \t\t\t\t</figcaption>  \t\t\t\t<p> \t\t\t\t\tThe automatic topology optimization in HELYX Adjoint then converged to the overall shape in less than 300 iterations and a final state geometry in 750 iterations that captured all relevant physics and reduced power loss by 20 percent and volume by 20 percent. \t\t\t\t</p>  \t\t\t\t<p> \t\t\t\t\tThis design case had multiple objectives that conflict with each other. Therefore, Dr. Combest decided to further explore the influence on Darcy-Forchheimer Coefficient and tube bundle length. This was possible due to the automation and efficiency of the approach. Each optimization case took only 49 minutes. \t\t\t\t</p>  \t\t\t\t<img data-src=\"images/Fig4-Intercooler-Variations-800x383.png\" alt=\"Motorsport Intercooler Design Variations\" \t\t\t\t\t class=\"img-fluid center-block\" /> \t\t\t\t<figcaption> \t\t\t\t\tFigure 4: Motorsport Intercooler Design Variations \t\t\t\t</figcaption>  \t\t\t\t<p> \t\t\t\t\tFrom the various optimization runs, it was possible to select the best design for each objective and to evaluate design options that would balance the objectives. Higher porous losses with the largest porous media length resulted in the most uniform flow, while the lowest porous losses and shortest porous media resulted in the best pressure loss. \t\t\t\t</p>  \t\t\t\t<h2>Just the beginning</h2>  \t\t\t\t<p> \t\t\t\t\tThe two examples of performance-driven Topology Optimization for automotive components are just the beginning of the exploration of how HELYX Adjoint can be used with Pointwise meshing to transform the makes CFD performance-based optimization practical. The next steps include investigation of mesh morphing and the use of Glyph scripting in Pointwise to broaden the capabilities and applicability of this revolutionary approach. Dr. Combest and the team at ENGYS plan to work with Pointwise, and Pointwise customers to further explore the potential impact of this approach on real-world applications that require optimal fluid flow performance. \t\t\t\t</p>  \t\t\t\t<p> \t\t\t\t\tFor more information about how ENGYS has leveraged Pointwise meshing to enable topology optimization of automotive components, watch Dr. Combest’s presentation entitled &ldquo;<a href=\"https://info.pointwise.com/topology-optimization-pointwise-helyx-adjoint\">Topology Optimization with Pointwise and HELYX Adjoint</a>.&rdquo; \t\t\t\t</p>","__v":0}
{"_id":{"$oid":"5fa464015787332e68115136"},"title":"Accurate Performance Predictions for Marine Propellers","abstract":"Engineers from two different companies teamed up to try to simulate a set of experiments using the Potsdam propeller. The mesh was completed using Pointwise and the simulation was done using TCFD. The results match well across a range of operating conditions.","postDate":{"$date":"2020-06-05T00:00:00Z"},"imgUrl":"Propeller-3840x1200.png","imgAltText":"The potsdam propeller in its actual form","author":"","clientName":"CFD SUPPORT","clientLogo":"CFDSupport-Logo-400x141.png","clientSinceHead":"","clientSince":"","clientAboutHead":"About the Client","clientAbout":"\t\t\t\t\t<p>\r\n\t\t\t\t\t\tCFD SUPPORT is a private engineering company dealing mainly with engineering simulations. CFD SUPPORT was established in 2009 as a decision of two engineers and PhD graduates during their research fellowship at the prestigious Von Karman Institute for Fluid Dynamics to deal with CFD on professional basis. The company is located in Prague, Czech Republic.\r\n\t\t\t\t\t</p>\r\n\t\t\t\t\t<p>\r\n\t\t\t\t\t\tCFD is a very complex science which transcends several fields – physics, mathematics and software engineering. CFD SUPPORT has therefore built up a flexible team of young engineers, mathematicians and programmers with excellent education, because the cooperation of our top experts gives us the opportunity to cover fully all the needs of this demanding industry.\r\n\t\t\t\t\t</p>\r\n\t\t\t\t\t<p>\r\n\t\t\t\t\t\tCFD SUPPORT deals primarily with the CFD and FEA simulations, software development, mathematical modeling, numerical methods, algorithms, visualization techniques, scripting, automation, optimization and many other activities related to numerical simulations of physical phenomena.\r\n\t\t\t\t\t</p>","challenge":"The high demand for improving the accuracy, quality, and credibility of the CFD simulation results, should be assessed by providing a qualitative and intensive comparison with experimental measurement data. The purpose of this benchmark is the validation of CFD simulation software TCFD® with the mesh created in the meshing software Pointwise® and to compare the results with the measurement data available. The thrust coefficient, torque coefficient, and efficiency were compared to the advance coefficient over eleven operating conditions.","solution":"The final mesh consisted of 4.1 million cells. The simulated predictions for each of the coefficients as well as the efficiency were very close to experimental results across the full range of operating conditions. All simulations and post-processing were performed using TCFD; visual post-processing of volume fields can be done with ParaView.","benefit":"The Potsdam propeller was accurately modeled across a broad range of operating conditions using a mesh created by Pointwise and the simulation package TCFD.","ymal1Title":"The Influence of Meshing Strategies on Simulation Efficiency","ymal1Img":"accurate-ymal1.png","ymal1Alt":"PPTC Mesh","ymal1Abstract":"Watch this on-demand webinar that will help you determine the best type of mesh to use for the fastest and most accurate CFD simulations.","ymal1Url":"https://info.pointwise.com/webinar_best_mesh_strategy_ondemand","ymal2Title":"Simulation of Unsteady Propeller Blade Loads Using OpenFOAM®","ymal2Img":"accurate-ymal2.png","ymal2Alt":"Propeller Simulation","ymal2Abstract":"Researchers at the University of Chalmers used Pointwise and OpenFOAM® to analyze unsteady propeller blade loads on ships that cause noise and vibration. Initial results are good and are being extended to include cavitation and pre-swirl stators.","ymal2Url":"../../theconnector/2014-May/Simulation-Unsteady-Propeller-Blade-Loads-Using-OpenFOAM.html","ymal3Title":"Simulation of in-flight icing on UAVs","ymal3Img":"ymal3.png","ymal3Alt":"Simulation of in-flight icing on UAVs","ymal3Abstract":"In-flight icing is a severe hazard to all aircraft and has been a point of concern for manned aviation for many years. UAVs are a new technology, and icing only recently has been addressed as a key limitation to UAV operations. Watch a webinar on how to use icing simulations on unmanned aerial vehicles to develop ice protection systems. ","ymal3Url":"https://info.pointwise.com/simulation-in-flight-icing-uavs","gated":true,"caseStudy":"\t\t\t\t<p>\r\n\t\t\t\t\tThis report presents the benchmark validation of CFD simulation results of the <a href=\"https://www.sva-potsdam.de/en/potsdam-propeller-test-case-pptc/\">Potsdam Propeller Test Case (PPTC)</a> using TCFD® with a Pointwise® mesh. PPTC is a marine propulsor that was extensively measured by <a href=\"https://www.sva-potsdam.de/\">SVA Potsdam</a>, and related data were published [<a href=\"#ref1\" class=\"page-scroll\">1</a>] [<a href=\"#ref2\" class=\"page-scroll\">2</a>] [<a href=\"#ref3\" class=\"page-scroll\">3</a>]. The aim of this benchmark was to evaluate the TCFD, computational fluid dynamics (CFD) software, on the mesh created in Pointwise mesh generation software, and to compare the results with the measurement data available. The particular goal of this benchmark is to compare the propeller efficiency, torque coefficient, and thrust coefficient vs. advance coefficient with the real experimental measurement of <a href=\"https://www.sva-potsdam.de/\">SVA Potsdam Laboratory</a>.\r\n\t\t\t\t</p>\r\n\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-Potsdam-Propeller-800x240.png\" alt=\"Figure 1: The potsdam propeller in its actual form as well as its computational rendering\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 1: The potsdam propeller in its actual form as well as its computational rendering\r\n\t\t\t\t</figcaption>\r\n\r\n\r\n\t\t\t\t<h2>Benchmark Parameters</h2>\r\n\r\n\t\t\t\t<div class=\"row\">\r\n\t\t\t\t\t<div class=\"col-lg-6 col-md-6\">\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Mean flow speed: 4 m/s </li>\r\n\t\t\t\t\t\t\t<li>Rotation speed: 900 RPM</li>\r\n\t\t\t\t\t\t\t<li>Flow model: incompressible </li>\r\n\t\t\t\t\t\t\t<li>Mesh size: 4.1 M cells</li>\r\n\t\t\t\t\t\t\t<li>Medium: water</li>\r\n\t\t\t\t\t\t\t<li>Speedlines: 1</li>\r\n\t\t\t\t\t\t\t<li>Simulation points: 11</li>\r\n\t\t\t\t\t\t\t<li>Fluid: Water</li>\r\n\t\t\t\t\t\t\t<li>Reference pressure: 1 atm</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</div>\r\n\t\t\t\t\t<div class=\"col-lg-6 col-md-6\">\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Reference density: 997.71 kg/m<sup>3</sup></li>\r\n\t\t\t\t\t\t\t<li>Dynamic viscosity: 9.559 × 10<sup>-4</sup> Pa⋅s</li>\r\n\t\t\t\t\t\t\t<li>CPU Time: 30 core.hours/point</li>\r\n\t\t\t\t\t\t\t<li>Turbulence: RANS</li>\r\n\t\t\t\t\t\t\t<li>Turbulence model:  kOmegaSST</li>\r\n\t\t\t\t\t\t\t<li>Simulation type: Propeller</li>\r\n\t\t\t\t\t\t\t<li>Time management: steady-state</li>\r\n\t\t\t\t\t\t\t<li>Number of components: 2</li>\r\n\t\t\t\t\t\t\t<li>Wall treatment: Wall functions</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</div>\r\n\t\t\t\t</div>\r\n\r\n\t\t\t\t<h2>Potsdam Propeller CFD Benchmark Description</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe high demand for improving the accuracy, quality, and credibility of CFD simulation results, should be assessed by providing a qualitative and intensive comparison with experimental measurement data.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe purpose of this benchmark is the validation of CFD simulation software TCFD with a mesh created in Pointwise and to compare the results with the measurement data available. PPTC is a marine propulsor that was extensively measured by SVA Potsdam, and related data were published in [<a href=\"#ref1\" class=\"page-scroll\">1</a>], [<a href=\"#ref2\" class=\"page-scroll\">2</a>], and [<a href=\"#ref3\" class=\"page-scroll\">3</a>].\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe particular goal of this benchmark is to compare the propeller efficiency, torque coefficient, and thrust coefficient vs. advance coefficient with the experimental measurements of SVA Potsdam Laboratory. The experimental investigation includes open water test and velocity field measurements at different operating conditions. A detailed description of the open water tests conducted at the towing tank of the SVA is presented in the SVA report [<a href=\"#ref1\" class=\"page-scroll\">1</a>], which can be found on the SVA website (<a href=\"https://www.sva-potsdam.de/\">sva-potsdam.de</a>).\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig2-Experimental-Propeller-800x315.png\" alt=\"Figure 2: The propeller used for experimental measurements.\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 2: The propeller used for experimental measurements.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor propeller analysis, there are a few important dimensionless numbers. Those are advance coefficient, thrust coefficient, torque coefficient, and efficiency. They are defined as (respectively):\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/propeller-equation-800x86.png\" alt=\"Advance coefficient, thrust coefficient, torque coefficient, and efficiency\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tWhere Va is the advance speed [m/s], n is the speed of rotation [1/s], D is propeller diameter [m], T is thrust [N], ϱ is water density [kg/m3], Q is torque [Nm]. The measurement results are available for advance coefficients from J = 0.5 to 1.6 and the simulation points are chosen accordingly. Altogether, 11 advance coefficient modes were simulated.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Mesh</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAn unstructured viscous computational mesh was constructed with Pointwise on the Potsdam propeller geometry as part of this TCFD validation benchmark. Pointwise has previously worked with variants of the geometry for other studies. For an in-depth discussion of Pointwise technology and how it can be used for this particular geometry, please consult Carrigan and Bagheri’s NAFEMS World Congress 2017 paper [<a href=\"#ref4\" class=\"page-scroll\">4</a>].\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tA combination of anisotropic and isotropic triangles was used in the surface mesh discretization. Areas of high curvature, such as the leading edge, trailing edge, and the tip, were resolved by utilizing Pointwise’s T-Rex algorithm. This tool grows anisotropically stretched, right-angle triangles layered in the normal direction to a boundary [<a href=\"#ref5\" class=\"page-scroll\">5</a>], as shown below. Using this, areas of high curvature are able to be resolved without the need to isotropically refine the area. The result is an accurate adherence to the surface and a reduction in the point count. The interior of the surface mesh was resolved with isotropic triangles created using a modified Delaunay algorithm.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig3-Propeller-Blade-800x479.png\" alt=\"The surface mesh on one blade of the propeller.\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 3: The surface mesh on one blade of the propeller. You can see the anisotropic layers generated near the blade's edge as well as the isotropic triangles near the center of the blade.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAfter meshing the geometry, the outer boundary of the moving reference frame (MRF) as well as the outer boundary of the computational domain were meshed utilizing isotropic triangles and the Delaunay algorithm. The MRF is cylindrical domain approximately 4.8 D long (4.8x the propeller diameter) and 1.5 D in diameter. It starts just upstream of the propeller and extends downstream into the wake. A farfield block was generated outside of the MRF corresponding to 10 D and 2.6 D.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig4-Domains-800x226.png\" alt=\"The computational domains based upon the diameter of the propeller.\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 4: The computational domains based upon the diameter of the propeller.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe volume mesh is a combination of a prismatic near wall cells surrounded by isotropic tetrahedral cells. The prismatic portions of the grid were initialized using T-Rex. Starting from the surface mesh, anisotropic tetrahedral cells were grown until reaching a desired stop criteria, colliding with another front, or violating quality criteria. If an element stops advancing this does not prevent adjacent elements from continuing. After the tetrahedral layers are grown, the cells are combined to form prisms (or hexahedras if the surface mesh is made up of quadrilateral cells). This reduces the total cell count of the mesh without sacrificing quality. Once the near-wall viscous mesh was generated, the remainder of the volume was populated with isotropic tetrahedral cells. The total cell count was just below 4.1 million cells. The average maximum included angle was 101 degrees, and the maximum was 170. The average volume ratio was 1.8 with a maximum of 28.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig5-Volume-Mesh-800x479.png\" alt=\"The computational domains based upon the diameter of the propeller.\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 5: A slice of the volume mesh around a blade. The blue cells are tetrahedra, the green are prisms, and the yellow are pyramids. The prism cells adjacent to boundaries are a result of the T-Rex algorithm. The surface mesh of the blade and hub can also be seen.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe data for the mesh is included in the table.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<table class=\"table table-bordered\">\r\n\t\t\t\t\t<thead class=\"thead-dark\">\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t<th scope=\"col\">Mesh Elements</th>\r\n\t\t\t\t\t\t<th scope=\"col\">points</th>\r\n\t\t\t\t\t\t<th scope=\"col\">faces</th>\r\n\t\t\t\t\t\t<th scope=\"col\">internal faces</th>\r\n\t\t\t\t\t\t<th scope=\"col\">faces per cell</th>\r\n\t\t\t\t\t\t<th scope=\"col\">hexahedra</th>\r\n\t\t\t\t\t</tr>\r\n\t\t\t\t\t</thead>\r\n\t\t\t\t\t<tbody>\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t<th scope=\"row\">#</th>\r\n\t\t\t\t\t\t<td>1018546</td>\r\n\t\t\t\t\t\t<td>8753113</td>\r\n\t\t\t\t\t\t<td>8434441</td>\r\n\t\t\t\t\t\t<td>4.203379</td>\r\n\t\t\t\t\t\t<td>2052</td>\r\n\t\t\t\t\t</tr>\r\n\t\t\t\t\t</tbody>\r\n\t\t\t\t\t<thead class=\"thead-dark\">\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t<th scope=\"col\">Mesh Elements</th>\r\n\t\t\t\t\t\t<th scope=\"col\">prisms</th>\r\n\t\t\t\t\t\t<th scope=\"col\">pyramids</th>\r\n\t\t\t\t\t\t<th scope=\"col\">tetrahedra wedges</th>\r\n\t\t\t\t\t\t<th scope=\"col\">polyhedra</th>\r\n\t\t\t\t\t\t<th scope=\"col\">cells</th>\r\n\t\t\t\t\t</tr>\r\n\t\t\t\t\t</thead>\r\n\t\t\t\t\t<tbody>\r\n\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t<th scope=\"row\">#</th>\r\n\t\t\t\t\t\t<td>788137</td>\r\n\t\t\t\t\t\t<td>39373</td>\r\n\t\t\t\t\t\t<td>0</td>\r\n\t\t\t\t\t\t<td>0</td>\r\n\t\t\t\t\t\t<td><strong>4,088,985</strong></td>\r\n\t\t\t\t\t</tr>\r\n\t\t\t\t\t</tbody>\r\n\t\t\t\t</table>\r\n\r\n\t\t\t\t<h2>TCFD Simulation Setup</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe simulation run in TCFD is quite straightforward. The external mesh, created in Pointwise, is simply loaded and the simulation parameters are set. The simulation type is the propeller. Time management is steady-state. The fluid flow model is incompressible. The mesh has two components (the water tunnel and the cylinder with propeller inside) of total 4.1<i>M</i> cells. The inlet flow velocity defines the advance coefficient, and the velocity varies from 1.7 to 5.9 m/s in 11 points. The outlet boundary condition is static pressure. For turbulence modeling, the RANS modeling approach has been used with the k-omega SST turbulence model with the wall functions. The fluid properties of water are selected. The density of 997.71 kg/m3. Dynamic viscosity of 9.559e-4 Pa·s.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig6-Pressure-Calculations-800x446.png\" alt=\"The computational domains based upon the diameter of the propeller.\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 6: Pressure calculations on the propeller taken from the TCFD post-processor.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig7-GUI-800x415.png\" alt=\"The computational domains based upon the diameter of the propeller.\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 7: The GUI for TCFD depicting results of one simulation.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<h2>TCFD Simulation Post-processing</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tTCFD includes a built-in post-processing module that automatically evaluates the required total quantities, such as propeller efficiency, thrust coefficient, torque coefficient, forces, force coefficients, flow rates, and much more. All these quantities are evaluated throughout the simulation run, and all the important data is summarized in tabled .csv files as well as in the HTML report, which can be updated anytime during the simulation for every run. Furthermore, visual post-processing of the volume fields can be done with ParaView.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Efficiency, Thrust & Torque Coefficient vs. Advance Coefficient</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tA propeller is the most common propulsor on ships, imparting momentum to a fluid causing a force to act on the ship. The most comprehensive propeller performance information is provided by displaying all the key characteristics into one graph.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Graph-800x480.png\" alt=\"Graph\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<h2>Conclusion</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe CFD analysis of the PPTC was performed successfully. It has been shown that the TCFD in connection with Pointwise provides very accurate results that are in perfect agreement with the measurement data.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAll the simulation and measurement data are freely available. Potential questions about TCFD are to be sent to <a href=\"mailto:info@cfdsupport.com\">info@cfdsupport.com</a>. Questions about Pointwise are to be sent to <a href=\"mailto:letstalk@pointwise.com\">letstalk@pointwise.com</a>.\r\n\t\t\t\t</p> \r\n\t<h3>References</h3>\r\n\r\n\t\t\t\t<ol>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref1\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tBarkmann, U., Potsdam Propeller Test Case (PPTC) - Open Water Tests with the Model Propeller VP1304, Report 3752, SchiffbauVersuchsanstalt Potsdam, April 2011\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref2\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tBarkmann, U., Heinke, H.-J., Potsdam Propeller Test Case (PPTC) Test Case Description, Second International Symposium on Marine Propulsors smp’11, Hamburg, Germany, June 2011, Workshop: Propeller performance\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref3\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tHeinke, H.-J., Potsdam Propeller Test Case (PPTC), Cavitation Tests with the Model Propeller VP1304, Report 3753, SchiffbauVersuchsanstalt Potsdam, April 2011\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref4\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tCarrigan, T., Bagheri, B., “A Study of the Influence of Meshing Strategies on CFD Simulation Efficiency,” NAFEMS World Congress 2017, NWC17-466, 2017.\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref5\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tSteinbrenner, J. P. and Abelanet, J.P., \"Anisotropic Tetrahedral Meshing Based on Surface Deformation Techniques,\" AIAA-20060554, AIAA 45th Aerospace Sciences Meeting, Reno, NV.\r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ol>\r\n","__v":0}
{"_id":{"$oid":"5fa46c815787332e68115137"},"title":"Automatic Generation of High-Quality Meshes Using Pointwise and Glyph","abstract":"Read a case study on how Glyph scripts integrated with Pointwise can reduce meshing time from up to 15 hours to one or two, and time spent on manual input from 12 hours to a few minutes. Automation also ensures a more consistent application of best practices for higher quality results.","postDate":{"$date":"2020-05-15T00:00:00Z"},"imgUrl":"ESP-PW-Case-Study-3840x1200.png","imgAltText":"Dragon space capsule, from the ESP example case gallery.","author":"","clientName":"U.S. Air Force","clientLogo":"esp-logo-200.png","clientSinceHead":"","clientSince":"","clientAboutHead":"About the Project","clientAbout":"This project was commissioned by the U.S. Air Force under a subcontract from Bob Haimes, the principal investigator of the AFRL CAPS program, in order to allow Pointwise to automatically generate meshes for geometries created in ESP.","challenge":"Meshing is a tedious, time-consuming, and sometimes mind-numbing process. However, it is a critical, necessary component of accurate CFD solutions. Automating this process has long been a goal with significant challenges: general automated meshers sacrifice quality, and while they can produce high-quality meshes, specialized automatic meshers can only be used on a very narrow class of problems.","solution":"Integrating custom Glyph scripts enables Pointwise to automatically generate high-quality meshes for any Engineering Sketch Pad (ESP) created geometry.","benefit":"For a typical aircraft geometry, Glyph scripts integrated with the latest version of Pointwise can reduce meshing time from up to 15 hours to one or two, and time spent on manual input from 12 hours to a few minutes. Automation also ensures a more consistent application of best practices for higher quality results. ","ymal1Title":"Reducing Discretization Error with Mesh Adaptation","ymal1Img":"auto-mesh-ymal1.png","ymal1Alt":"Reducing Discretization Error with Mesh Adaptation","ymal1Abstract":"Mesh adaptation can automatically add finer mesh resolution in areas where it is needed by examining an error metric or flow gradients to determine where the existing mesh is not adequately resolving the flow.","ymal1Url":"https://info.pointwise.com/case-study-reducing-discretization-error-mesh-adaptation","ymal2Title":"Glyph Scripting with Python in Pointwise","ymal2Img":"auto-mesh-ymal2.png","ymal2Alt":"Glyph Scripting with Python in Pointwise","ymal2Abstract":"In this video, we demonstrate how to configure the new Glyph Server in Pointwise and add support for new scripting languages including Python. We will also introduce some example Python scripts that highlight the utility and value of these new Glyph features.","ymal2Url":"https://info.pointwise.com/webinar-glyph-scripting-python-pointwise","ymal3Title":"Unstructured Quad & Hex Meshing Using Pointwise","ymal3Img":"auto-mesh-ymal3.png","ymal3Alt":"Unstructured Quad & Hex Meshing Using Pointwise","ymal3Abstract":"In this webinar, we highlight four new major features available in Pointwise V18: quad-dominant surface meshing, farfield shape creation, unstructured hex-dominant boundary layer meshing, and volumetric sources.","ymal3Url":"https://info.pointwise.com/webinar-unstructured-quad-hex-meshing","gated":false,"caseStudy":"          <h2>\r\n            Scripts executed in Pointwise using Engineering Sketch Pad geometry automatically generate high-quality meshes for any configuration\r\n          </h2>\r\n\r\n          <h3>\r\n            Meshing time can be reduced by up to 90 percent, user input requires minutes not hours, on a typical aircraft geometry\r\n          </h3>\r\n\r\n          <br />\r\n\r\n          <p>\r\n            Meshing is a tedious, time-consuming, and sometimes mind-numbing process. It also is an essential and necessary component in the production of accurate computational fluid dynamics (CFD) solutions. Automating this process has been a decades-long goal with significant challenges: General automated meshers must sacrifice the quality of the mesh and, while they can produce high-quality meshes, specialized automatic meshers can only be used on a very narrow class of problems. \r\n          </p>\r\n\r\n          <p>\r\n            Now, the latest version of Pointwise software and a collection of Glyph scripts is making it possible for users to automatically generate high-quality meshes for any geometry. The solution substantially reduces both the meshing time and the time required for manual input. \r\n          </p>\r\n\r\n          <blockquote class=\"blockquote-reverse pw-blue\">\r\n            Watching a three-toed sloth doing the back stroke through a lake of molasses is kind of like meshing . . . It seems to take forever.\r\n          </blockquote>\r\n\r\n          <p>\r\n            &ldquo;For a typical aircraft geometry, meshing times can be reduced from 10 to 15 hours to one or two, while time spent on manual input drops from 11 to 12 hours to a few minutes,” says Dr. Rick Matus, Pointwise executive vice president. “This frees users up from repetitive and tedious tasks, allowing them to focus more on mission-critical work.&rdquo;\r\n          </p>\r\n\r\n          <p>\r\n            Several Pointwise users have been generating meshes automatically with Pointwise and a Glyph script package named <a href=\"https://github.com/pointwise/GeomToMesh\" target=\"_blank\" rel=\"noreferrer noopener\">GeomToMesh</a>. The geometry is created using Engineering Sketch Pad (ESP), developed by Bob Haimes at MIT and Dr. John Dannenhoffer at Syracuse University. Working with ESP on a sub-contract for the U.S. Air Force, Pointwise created the Glyph scripts to enabled automatic unstructured mesh generation from water-tight geometry. \r\n          </p>\r\n\r\n          <p>\r\n            &ldquo;Basically, ESP provided the geometry and information about the desired mesh properties for different parts of the geometry via attribution,&rdquo; says Dr. Steve Karman, Pointwise staff specialist, who worked on the project. &ldquo;The Pointwise software then used that information to generate the mesh.&rdquo;\r\n          </p>\r\n\r\n          <p>\r\n            The scripts can automatically create a volume mesh for geometry input in one of four formats: IGES (Initial Graphics Exchange Specification), STEP (Standard for the Exchange of Product Data), EGADS (Electronic Geometry Aircraft Design System), or NMB (Non-Manifold Boundary Representation). \r\n          </p>\r\n\r\n          <p>\r\n            If the geometry is fully closed and water-tight, then a volume mesh is constructed. If the geometry is not closed, then just the surfaces are meshed, but that also saves the user a great deal of time according to Dr. Karman. If the geometry is in EGADS or NMB formats, then the meshing process in Pointwise is guided by the attributed information to construct a mesh more aligned with the user’s intent.\r\n          </p>\r\n\r\n          <p>\r\n            &ldquo;The meshes generated by U.S. Air Force personnel are proprietary,&rdquo; says Karman. &ldquo;But we did create some hypothetical cases that were shared at a workshop before the AIAA Science and Technology Forum and Exposition 2019.&rdquo;\r\n          </p>\r\n\r\n          <img data-src=\"images/Fig-2-Parametric-Study.png\"\r\n          alt=\"mesh parametric study of a notional commercial transport aircraft\" class=\"img-fluid\" />\r\n          <figcaption>\r\n            One workshop scenario was a mesh parametric study of a notional commercial transport aircraft using files generated by ESP. Above are the results with meshing times and data sizes. The geometry files were attributed with boundary names and a specified wall spacing of 1.0e-04.\r\n          </figcaption>\r\n\r\n          <p>\r\n            Another advantage that automation has over manual input, according to Dr. Karman, is that best practices can be applied consistently throughout the meshing process, which helps ensure a high-quality mesh. \r\n          </p>\r\n\r\n          <p>\r\n            &ldquo;Good geometry is the key here&rdquo; he says. &ldquo;If you start at the beginning and get it all set up in terms of attributes on the geometry for meshing, downstream flow solver, adaptation and design then that information can be available every step of the way. If the whole CFD process is geometry-centric, it will work like magic.&rdquo;\r\n          </p>\r\n\r\n          <p>\r\n            Dr. Karman adds that this is just the beginning for automated meshing. Work in the near future will include more testing and documentation, and his team expects the capability to evolve as necessary to support things such as high order mesh curving, solution-based adaptation and design.\r\n          </p>\r\n\r\n          <p>\r\n            Take a deeper dive into the technical aspects of automatically generating high-quality meshes by accessing the video of the presentation that Steve Karman gave on this subject: \r\n          </p>\r\n\r\n          <div class=\"cta-space text-center\">\r\n            <!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-ea9103b9-84cc-4d75-84e6-df531e0797e9\"><span class=\"hs-cta-node hs-cta-ea9103b9-84cc-4d75-84e6-df531e0797e9\" id=\"hs-cta-ea9103b9-84cc-4d75-84e6-df531e0797e9\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]--><a href=\"https://cta-redirect.hubspot.com/cta/redirect/3788790/ea9103b9-84cc-4d75-84e6-df531e0797e9\" ><img class=\"hs-cta-img\" id=\"hs-cta-img-ea9103b9-84cc-4d75-84e6-df531e0797e9\" style=\"border-width:0px;\" src=\"https://no-cache.hubspot.com/cta/default/3788790/ea9103b9-84cc-4d75-84e6-df531e0797e9.png\"  alt=\"Watch Automatic Unstructured Mesh Generation with Geometry Attribution\"/></a></span><script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script><script type=\"text/javascript\"> hbspt.cta.load(3788790, 'ea9103b9-84cc-4d75-84e6-df531e0797e9', {}); </script></span><!-- end HubSpot Call-to-Action Code -->\r\n          </div>","__v":0}
{"_id":{"$oid":"5fa59a9362b00106a458f4a5"},"title":"Researchers use CFD to Help Quantify the Benefits of Truck Platooning Technologies","abstract":"Find out how CFD is helping the commercial trucking industry develop platooning technologies for safer roads and increased fuel efficiency.","postDate":{"$date":"2020-06-05T00:00:00Z"},"imgUrl":"truck-platoon-main-3840x1200.png","imgAltText":"Depiction of the Pointwise Source feature (in yellow) around the vehicle","author":"","clientName":"Auburn University","clientLogo":"auburn-logo-horizontal-400.png","clientSinceHead":"Client Since","clientSince":"2005","clientAboutHead":"About the Client","clientAbout":"Auburn University is a nationally ranked land grant institution recognized for its commitment to world-class scholarship, interdisciplinary research with an elite, top-tier Carnegie R1 classification, and an undergraduate education experience second to none. Auburn is home to more than 30,000 students, and its faculty and research partners collaborate to develop and deliver meaningful scholarship, science and technology-based advancements that meet pressing regional, national and global needs. Auburn's commitment to active student engagement, professional success, and public/private partnership drives a growing reputation for outreach and extension that delivers broad economic, health and societal impact. Auburn's mission to educate, discover and collaborate drives its expanding impact on the world.","challenge":"The practice of drafting – where moving objects are grouped tightly together to exploit the lead object’s slipstream – has been used in motorsports, cycling, and speedskating for years. It would make sense for commercial vehicles to use this method to increase fuel efficiencies. There’s one problem; however: it is an extremely dangerous practice on the road. ","solution":"Truck platooning is the term for an emerging set of technologies that can link heavy vehicles together using wireless communications, adaptive cruise control, crash avoidance systems, and automatic coupling /decoupling features. CFD is helping the automotive industry develop platooning technologies for commercial truck fleets that can help create safer roads and increase fuel efficiencies.","benefit":"With fuel making up about 38 percent of the cost of operating a truck fleet, any increase in fuel efficiency stands to significantly reduce costs. The Department of Energy estimates that platooning could deliver a four percent reduction in fuel consumption. With commercial trucks consuming more than 30 billion gallons of fuel annually in the U.S. alone, the cost savings and reduction in carbon emissions would be significant.","ymal1Title":"Using CFD to Help Increase the Safety of Driverless Cars","ymal1Img":"platooning-ymal1.png","ymal1Alt":"Driverless Car Case Study","ymal1Abstract":"Autonomous vehicles are expected to become a viable form of transportation sometime in the first half of this century. One of the major hurdles will be to provide these cars with the artificial intelligence they need to position themselves in a location where there is less drag for optimal fuel efficiency, travel time, and stability. Ultimately, it should lead to fewer serious accidents and safer roads. Find out how Pointwise is helping researchers in the automotive industry do that.","ymal1Url":"https://www.pointwise.com/case-studies/Using-CFD-Increase-Safety-Driverless-Cars/index.html","ymal2Title":"Hybrid Conformal Meshing for Wind Farm CFD Applications","ymal2Img":"platooning-ymal2.png","ymal2Alt":"wind farm mesh","ymal2Abstract":"Learn more about techniques that can be used to generate hybrid conformal meshes that span the entirety of a wind farm. In this webinar, we discuss how to efficiently move from the terrain scale of a wind farm to the wind turbine scale and how the process was automated to support the arbitrary placement of wind turbines for siting applications.","ymal2Url":"https://info.pointwise.com/hybrid-conformal-meshing-wind-farm-cfd-applications","ymal3Title":"Pointwise delivers fast, accurate results for Garry Rogers Motorsport","ymal3Img":"platooning-ymal3.jpg","ymal3Alt":"v8 Super Car","ymal3Abstract":"Due to governing body rule changes, Garry Rogers Motorsport needed to design and build a completely new V8 Supercar without blowing their budget and schedule. By moving their CFD meshing to Pointwise, Garry Rogers Motorsport was able to significantly reduce their hours spent generating meshes while also having a great deal of confidence in the results. ","ymal3Url":"https://info.pointwise.com/pointwise-delivers-fast-accurate-results-garry-rogers-motorsport","gated":true,"caseStudy":"<p>\r\n\t\t\t\t\tThe concept of drafting – where moving objects are grouped tightly together to conserve energy by exploiting the lead object’s slipstream – has been around for years. From motorcycle racing to auto racing, cycling, speedskating, and more, sports enthusiasts and engineers are quite familiar with this aerodynamic technique for reducing drag and conserving energy while maintaining speed. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<blockquote class=\"blockquote text-center pw-blue\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;The connectors were fantastic . . .  I don’t think I would have had as fine a control as I had if I hadn’t been able to use the connectors in Pointwise.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"><cite title=\"Source Title\">Michael Siemon</cite></footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThis method would seem to make sense for commercial vehicles such as semi-trucks, which average a measly six miles per gallon of diesel.<a href=\"#ref1\" class=\"page-scroll\"><sup>1</sup></a>  With fuel making up about 38 percent of the cost of operating a truck fleet,<a href=\"#ref2\" class=\"page-scroll\"><sup>2</sup></a> any increase in fuel efficiency stands to significantly reduce costs. There is one problem, though: it is an extremely dangerous practice on the open road. To gain any real fuel efficiency, drivers would have to follow each other so closely they would not be able to brake or respond quickly enough in an emergency.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tRecent advances in automated vehicle technology are on the verge of changing that. Commonly referred to as platooning, this emerging technology can link heavy vehicles together using wireless communications, adaptive cruise control, crash avoidance systems, and automatic coupling /decoupling features that respond when other vehicles cut between two trucks. By being able to react to dangerous situations more quickly than a human driver can, platooning technology reduces the safe following distances enough for the drafting efficiencies to kick-in.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Environmental Benefits</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tIn addition to increased fuel efficiency and safety, platooning technology has the potential for reducing the trucking industry’s carbon footprint. The Department of Energy estimates that 65 percent of today’s long-haul truck miles could be platooned with an overall four percent reduction in fuel consumption.<a href=\"#ref3\" class=\"page-scroll\"><sup>3</sup></a> Apply those numbers to the more than 30 billion gallons of fuel consumed by commercial trucks annually,<a href=\"#ref4\" class=\"page-scroll\"><sup>4</sup></a> and there’s the potential to removing carbon emissions from 1.2 billion gallons of fuel from our environment every year. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Using CFD to Quantify Benefits of Truck Platooning</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tComputational fluid dynamics (CFD) studies play an integral role in quantifying the drag reduction and fuel efficiency that can be achieved from various platooning scenarios. As a graduate student at Auburn University, Michael Siemon recently contributed his CFD skills to a major, ongoing research project for the U.S. Army’s Tank and Automotive Research, Development and Engineering Center (TARDEC). While investigating the potential safety and fuel benefits of platooning is the goal of this study, TARDEC’s larger, long-term objective is to develop fleets of fully autonomous trucks that can venture over extremely rough terrains in combination with armored manned vehicles.<a href=\"#ref5\" class=\"page-scroll\"><sup>5</sup></a> \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tDuring the initial phase of the project, researchers used homogenous /identical vehicle meshes with very few details as a starting point, or &ldquo;baseline,&rdquo; to run simulations. The next step for Siemon was to develop a series of heterogeneous meshes with which to run CFD simulations — for example, positioning a truck with an empty load behind one with a full load to generate more realistic, real-world results. He began with computer-aided design (CAD) models of the trucks to create the meshes, a rather complex and detailed process.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;CAD models are not necessarially indicative of a final mesh. They may provide a basic skeleton, but you have to do a lot of fixing and some artistry even,&rdquo; says Siemon. &ldquo;Plus, ground vehicles have a lot more complexity than, say, a missile or plane. Things like wheels within wheel wells can be really tricky because you have two different surfaces working off of each other with a very small volume.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Creating Complex Automotive Meshes with Pointwise</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tBy using Pointwise to build the grids from the imported CAD models, Siemon was able to refine the meshes to handle the complexities of automotive cases and generate more accurate CFD solutions. One of the biggest challenges was dealing with random volumes that were skewed and not located near walls or other features. The Pointwise connectors feature helped Siemon tackle that problem by giving him precise control over local grid spacing and ensuring that sharp edges in the geometry were accurately captured in the analysis mesh. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;The connectors were fantastic,&rdquo; says Siemon. &ldquo;It made it so much easier to import the CAD models and resolve the areas that weren’t CFD ready. I don’t think I would have had as fine a control as I had if I hadn’t been able to use the connectors in Pointwise.&rdquo; \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAnother advantage with Pointwise, according to Siemon, has been its ability to generate meshes that work with most solver codes. For this project, Siemon used Tenasi: an unstructured CFD solver developed at the Chattanooga campus of the University of Tennessee. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;Tetrahedra are probably the biggest challenge. They can be really thin or smushed,&rdquo; he says. &ldquo;The solver can’t track the gradients across them, so you can get numerically unstable solutions.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-Volume-Grid-800x474.png\"\r\n\t\t\t\talt=\"Slice of the volume grid around a single box trailer vehicle\" class=\"img-fluid center-block\" class=\"img-fluid\"/>\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tSlice of the volume grid around a single box trailer vehicle. Tetrahedral elements in red are smaller in the area of the Pointwise Source feature than the outside.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tA couple of features in Pointwise helped Siemon make the solutions more numerically stable: the Source feature enabled him to control the tetrahedra more tightly; while the ability to build quads provided greater resolution near the walls. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;The nice thing about Pointwise is that it allows for more user input when building the grids and meshes,&rdquo; says Siemon. &ldquo;It gives me a much more active hand in building the block. I could refine the areas more tightly where I wanted more precise info.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig2-XVelocity-800x398.png\"\r\n\t\t\t\talt=\"This image shows an X-Velocity profile for a homogeneous, two-box trailer platoon with a 10 ft. separation distance and 25 percent lateral offset\" class=\"img-fluid center-block\" class=\"img-fluid\"/>\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tResearchers are using CFD to help quantify the benefits of truck platooning technologies. This image shows an X-Velocity profile for a homogeneous, two-box trailer platoon with a 10 ft. separation distance and 25 percent lateral offset.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor more information about how engineers and designers in the automotive industry use Pointwise to build faster, more efficient, and safer vehicles, visit: \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a href=\"https://info.pointwise.com/pointwise-delivers-fast-accurate-results-garry-rogers-motorsport\">Pointwise delivers fast, accurate results for Garry Rogers Motorsport</a>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a href=\"../Using-CFD-Increase-Safety-Driverless-Cars/index.html\">Using CFD to Help Increase the Safety of Driverless Cars</a>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ul>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tIf you want to read Siemon’s thesis visit: <a href=\"http://hdl.handle.net/10415/6405\" target=\"_blank\" rel=\"noreferrer noopener\">http://hdl.handle.net/10415/6405</a>\r\n\t\t\t\t</p> \r\n\t\t\t\t<h3>References</h3>\r\n\t\t\t\t<ol>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref1\" class=\"anchor\"></a>\r\n\t\t\t\t\t\t<a href=\"https://www.fhwa.dot.gov/policyinformation/statistics/2017/vm1.cfm\" target=\"_blank\" rel=\"noreferrer noopener\">Federal Highway Administration, Highway Statistics 2017</a>, Table VM-1, average miles traveled per gallon of fuel consumed 2017, combination trucks\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref2\" class=\"anchor\"></a>\r\n\t\t\t\t\t\t<a href=\"https://trid.trb.org/view/1324567\" target=\"_blank\" rel=\"noreferrer noopener\">An Analysis of the Operational Costs of Trucking: 2014 Update</a>, Table VM-1, average miles traveled per gallon of fuel consumed 2017, combination trucks\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref3\" class=\"anchor\"></a>\r\n\t\t\t\t\t\t<a href=\"https://www.energy.gov/eere/articles/platooning-trucks-cut-cost-and-improve-efficiency\" target=\"_blank\" rel=\"noreferrer noopener\">Platooning Trucks to Cut Cost and Improve Efficiency</a>, Office of Energy Efficiency & Renewable Energy\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref4\" class=\"anchor\"></a>\r\n\t\t\t\t\t\t<a href=\"https://www.fhwa.dot.gov/policyinformation/statistics/2017/vm1.cfm\" target=\"_blank\" rel=\"noreferrer noopener\">Federal Highway Administration, Highway Statistics 2017</a>, Table VM-1, fuel consumed (thousand gallons) 2017, combination trucks\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref5\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tFor more about the TARDEC projects see: <a href=\"https://mitechnews.com/autonomous-vehicles/5467/\" target=\"_blank\" rel=\"noreferrer noopener\">Army TARDEC Tests Autonomous Trucks In Convoy Along I-69 In Lapeer County</a> and <a href=\"https://www.army.mil/article/195049/us_army_brings_autonomous_technology_across_blue_water_bridge\" target=\"_blank\" rel=\"noreferrer noopener\">U.S. Army Brings Autonomous Technology Across Blue Water Bridge</a> \r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ol>","__v":0}
{"_id":{"$oid":"5fa5c0bd62b00106a458f4a6"},"title":"Meshing Strategies for Propulsion Aerodynamics","abstract":"Several meshing techniques and meshing best-practices have been developed while creating workshop-supplied meshes for the 3rd and 4th AIAA Propulsion Aerodynamics Workshops. These meshing strategies and lessons learned have been collected to help CFD practitioners gather experience meshing these types of challenging internal flow problems.","postDate":{"$date":"2020-02-19T00:00:00Z"},"imgUrl":"PAWS-Main-3840x1200.png","imgAltText":"Mixed-element hybrid unstructured mesh","author":"","clientName":"4th AIAA Propulsion Aerodynamics Workshop","clientLogo":"4th AIAA Propulsion Aerodynamics Workshop","clientSinceHead":"Participating Since","clientSince":"2016","clientAboutHead":"About the Workshop","clientAbout":"The focus of the workshop will be on assessing the accuracy of CFD in obtaining air breathing system performance and flow structure to include nozzle forces, plume surveys, subsonic inlet recovery and distortion, and high-speed inlet performance.","challenge":"Meshing remains somewhat of an art. Qualified engineers tend to spend an inordinate amount of time generating grids, while mathematicians focus on developing more advanced algorithms that may end up being tested on unsuitable meshes. Propulsion aerodynamics cases present a number of unique meshing challenges for CFD practitioners from capturing secondary flows in internal inlet passages to appropriately resolving shear layers and mixing phenomena in nozzle exhaust plumes.","solution":"Several meshing techniques and meshing best-practices have been developed while creating workshop-supplied meshes for the 3rd and 4th AIAA Propulsion Aerodynamics Workshops. These meshing strategies and lessons learned have been collected to help CFD practitioners gather experience meshing these types of challenging internal flow problems.","benefit":"Discover meshing best-practices that can be applied across a wide variety of propulsion aerodynamics cases.","ymal1Title":"Multi-block Structured Meshing of a Diffusing S–Duct","ymal1Img":"propulsion-ymal1.png","ymal1Alt":"Multi-block Structured Meshing of a Diffusing S–Duct","ymal1Abstract":" In this webcast, we use a diffusing serpentine inlet to demonstrate some of the more advanced structured meshing techniques available in Pointwise to quickly create a multi-block structured mesh.","ymal1Url":"https://info.pointwise.com/webinar-multi-block-structured-meshing-diffusing-s-duct","ymal2Title":"Meshing Overview & S-Duct Results from the 3rd Propulsion Aerodynamics Workshop","ymal2Img":"propulsion-ymal2.png","ymal2Alt":"Meshing Overview & S-Duct Results from the 3rd Propulsion Aerodynamics Workshop","ymal2Abstract":"Pointwise, Inc. has been involved in various AIAA sponsored workshops in the past including High Lift, Drag Prediction, and more recently Sonic Boom Prediction workshops in order to further develop a set of best meshing practices for each respective application area.","ymal2Url":"../../theconnector/2016-Q3/Meshing-Overview-and-S-Duct-Results-from-Propulsion-Aerodynamics-Workshop.html","ymal3Title":"Computational Optimization of Rocket Engine Nozzles","ymal3Img":"propuulsion-ymal3.png","ymal3Alt":"Computational Optimization of Rocket Engine Nozzles","ymal3Abstract":"The primary aim of this project was to investigate the capability of using modern commercial computational fluid dynamics (CFD) packages (Pointwise and ANSYS Fluent®) as tools for analysis and design of rocket engine nozzles.","ymal3Url":"../../theconnector/2014-January/Computational-Optimization-Rocket-Engine-Nozzles.html","gated":true,"caseStudy":"        <p>\r\n          The <a href=\"https://paw.larc.nasa.gov/\" target=\"_blank\" rel=\"noreferrer noopener\">4th AIAA Propulsion Aerodynamics Workshop (PAW04)</a> was held during the weekend of 7-8 July 2018 and preceded the <a href=\"https://propulsionenergy.aiaa.org/\" target=\"_blank\" rel=\"noreferrer noopener\">54th AIAA/SAE/ASEE Joint Propulsion Conference</a> at the <a href=\"https://www.cincyusa.com/duke-energy-center/\" target=\"_blank\" rel=\"noreferrer noopener\">Duke Energy Convention Center</a> in Cincinnati, Ohio. The two-day workshop provided participants an impartial forum to present numerical results for three separate challenging validation benchmark cases for simulating unsteady and steady-state aerodynamics of complex inlet and nozzle exhaust flows that are of interest to the propulsion community. There were 35 participants in attendance with several others who submitted data. During workshops, participants are encouraged to exchange ideas and evaluate the effectiveness of existing computational fluid dynamics (CFD) codes and modeling techniques.\r\n        </p>\r\n\r\n        <p>\r\n          A set of workshop-supplied grids are published by the workshop’s organizing technical committee for each test case, and participants are encouraged to use these meshes in order to help reduce scatter in results that are contributed as well as to help encourage participation. For this latest workshop, as well as the <a href=\"../../theconnector/2016-Q3/Meshing-Overview-and-S-Duct-Results-from-Propulsion-Aerodynamics-Workshop.html\">previous one</a>, the workshop-supplied meshes for two of the three test cases were created using Pointwise.\r\n        </p>\r\n\r\n        <h2>S-Duct Test Case</h2>\r\n\r\n        <p>\r\n          The <a href=\"https://ntrs.nasa.gov/search.jsp?R=20120002597&hterms=IFCPT&qs=N%3D0%26Ntk%3DAll%26Ntt%3DIFCPT%26Ntx%3Dmode%2520matchallpartial\" target=\"_blank\" rel=\"noreferrer noopener\">Inlet Flow Control and Prediction Technologies for Embedded Propulsion Systems (IFCPT) serpentine inlet</a> is a holdover test case from the previous workshop, and the entire first day of PAW04 was spent covering participant contributions for this case.\r\n        </p>\r\n\r\n        <p>\r\n          In the 3rd Propulsion Aerodynamics Workshop (PAW03), participant contributions resulted in a lot of scatter despite using a common set of workshop-supplied grids. One primary reason for this was related to how the empirical data reported mass flow rate through the inlet. Using 40 total pressure and eight static pressure readings at the Aerodynamic Interface Plane (AIP) during wind tunnel testing, the massflow rate at the AIP was recorded by using Eq. (1).\r\n        </p>\r\n\r\n        <img data-src=\"images/equations-800x387.png\"\r\n        alt=\"Equations\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n        </figcaption>\r\n\r\n        <p>\r\n          However, most CFD codes do not compute mass flow rate in this way. Instead, users apply a mass flow out boundary condition at the exit of the control volume, and the back pressure is adjusted until this target mass flow rate value is achieved. Assuming that the solution is converged, then mass flow through the entire control volume is a conserved quantity, and the integrated mass flow value over the entire exit plane should be the same value at the AIP. Although, many will survey the integrated mass flow rate at the AIP plane itself as well.\r\n        </p>\r\n\r\n        <p>\r\n          Participants in this latest workshop were asked to iteratively adjust the mass flow out boundary condition value in their CFD simulations until the mass flow rate at the AIP as calculated via Eq. (1) was achieved when making comparisons to empirical data. As this can be a tedious process, one clever participant in this latest workshop developed a special back pressure driver for their <a href=\"https://fun3d.larc.nasa.gov/\" target=\"_blank\" rel=\"noreferrer noopener\">solver</a> to adjust the back pressure based on Eq. (1) using the prescribed 40-probe total pressure and eight rake static pressure locations at the AIP.\r\n        </p>\r\n\r\n        <p>\r\n          The instrumentation rake assembly geometry modeled in PAW04 was different than the one used for the previous workshop. Two separate rake assemblies were used over the course of wind tunnel testing. In PAW03, it was noted that for the flow condition participants were given to simulate, a different rake was used during the test other than the one modeled by participants. An updated rake geometry was released and integrated into the baseline S-Duct geometry by using the solid modeling features within Pointwise.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig1-s-duct-meshes-800x258.png\"\r\n        alt=\"S-Duct Meshes\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 1: Sets of multi-block structured and mixed-element unstructured meshes were provided to workshop participants. Grids were created by using a variety of meshing features in Pointwise including normal extrusions, elliptical smoothing, quad-dominant surface meshing, 2-D and 3-D T-Rex, and sources.\r\n        </figcaption>\r\n\r\n        <p>\r\n          Overall, three sets of meshes—a total of 15 grids—were provided to participants for the S-Duct test case. Sets of both multi-block structured and mixed-element unstructured meshes were created in Pointwise as shown in Figure 1 and listed in Table 1. The structured grids were provided as PLOT3D formatted files, while the unstructured grids were given in CGNS format. Several participants requested grids formatted specifically for their CFD solver, which were provided using the CAE export options available in Pointwise.\r\n        </p>\r\n\r\n        <figcaption class=\"case-table\">\r\n          Table 1: Workshop-supplied meshes for the S-Duct test case include three sets of grids consisting of both multi-block structured and mixed-element unstructured meshes for two test case configurations.\r\n        </figcaption>\r\n        <img data-src=\"images/Table1-800x495.png\"\r\n        alt=\"Table 1\" class=\"img-fluid center-block\" />\r\n\r\n        <p>\r\n          Five grid-refinement meshes were provided for each set of grids, so that participants could independently perform grid sensitivity studies. The normal wall spacing for each of these grids was held constant at a y<sup>+</sup> value of 1. As the surface grids were refined for the mixed-element meshes, holding the initial normal wall spacing and growth rate constant causes the anisotropic layers of hexahedra advanced from wall boundaries to terminate earlier due to reaching isotropy sooner. It is important that the extent of the boundary layer resolved mesh is maintained as the grid is refined so that both the boundary layer and any secondary flows can be captured accurately as the mesh is refined. This can be accomplished by utilizing a custom growth profile in Pointwise to advance anisotropic layers beyond isotropy using a growth rate of 1.0. Sources were used in Pointwise to control the size of isotropic tetrahedra within the duct as shown in Figure 2.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig2-sources-800x450.png\"\r\n        alt=\"Sources in Pointwise\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 2: Sources (shown in green) in Pointwise are used to limit the target edge lengths of isotropic tetrahedra from growing too large in sensitive regions of the flowfield.\r\n        </figcaption>\r\n\r\n        <p>\r\n          Some results from a grid sensitivity study are shown in Figure 3. Assuming second-order accuracy for a 3-D problem, the characteristic grid spacing can be estimated by <em>N<sup>-2/3</sup></em> where <em>N</em> is the complexity within a given mesh (i.e., the number of grid nodes for a node-centered flow solver). For a grid family, as the number of degrees of freedom is uniformly increased (<em>N<sup>-2/3</sup></em> decreases), one should expect a linear trend if a solution is second-order accurate. Extrapolating to <em>N<sup>-2/3</sup></em> = 0 should yield the exact value for the metric plotted along the ordinate axis for an infinitesimally fine mesh.\r\n        </p>\r\n\r\n        <p>\r\n          For the results shown in Figure 3, mass flow rate was not iteratively varied at the exit boundary in order to target a value derived from 48 discrete total and static pressure points via Eq. (1). Instead, the mass flow rate at the prescribed flow condition was applied at the exit boundary. This results in a mass flow rate at the AIP that is approximately seven percent higher than the empirical value reported, which was derived from 40 total pressure and eight static pressure values. This explains why the total pressure recovery is lower than the empirical value reported at the prescribed flow condition. Results provided were run using the coarse, medium, and fine grid-refinement meshes for the baseline configuration and coarse, medium, fine, and fine-1.5 refinement grids for the S-Duct with Rake Assembly configuration.\r\n        </p>\r\n\r\n        <p>\r\n          Linear trends were observed by workshop participants, and the fine-1.5 grid refinement level was identified as the one providing mesh independent results.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig3-mesh-sensitivity-800x487.png\"\r\n        alt=\"Grid sensitivity to total pressure recovery\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 3: Grid sensitivity to total pressure recovery shows some linear trends as meshes are refined suggesting second-order accuracy.\r\n        </figcaption>\r\n\r\n        <p>\r\n          Inlet distortion was computed in accordance with <a href=\"https://www.sae.org/standards/content/arp1420b/\" target=\"_blank\" rel=\"noreferrer noopener\">SAE ARP-1420</a> guidelines. These results are far more sensitive to modeling errors depending on how accurately the secondary flows are resolved and their proximity to the 40 total pressure probes at the AIP. Small variations in total pressure due to proximity of a pressure transducer to a low-pressure region can yield large discrepancies in tip distortion between empirical and numerical results for this case. Participants seemed to settle on using turbulence models with rotation/curvature (RC) and quadratic constitutive relation (QCR) corrections to help more accurately resolve the secondary flows that setup in this case. Overall, participant contributions were much less scattered than those from PAW03, but this test case continues to be a challenge to predict accurately using CFD.\r\n        </p>\r\n\r\n        <h2>Nozzle Test Case</h2>\r\n\r\n        <p>\r\n          The second day of the workshop was spent covering the other two test cases which include a nozzle and an external compression supersonic inlet. A new high-aspect-ratio convergent rectangular nozzle configuration was introduced for PAW04. This particular configuration was based on the experimental work of <a href=\"https://arc.aiaa.org/doi/10.2514/1.J053376\" target=\"_blank\" rel=\"noreferrer noopener\">Behrouzi and McGuirk</a>.\r\n        </p>\r\n\r\n        <p>\r\n          Interest in development of these types of nozzles has been driven by observations that rectangular-nozzle jet/ambient mixing, velocity, and temperature decay rates are faster than for an axisymmetric nozzle. Plume mixing affects jet noise production in civil aircraft propulsion, while reduced infrared signature is a focus of interest in military applications.\r\n        </p>\r\n\r\n        <p>\r\n          It was invaluable to have one of the authors of the experimental work for the nozzle test case, Professor James McGuirk from Loughborough University, present during the workshop given his familiarity with the case study. The nozzle test case consisted of two separate configurations—the baseline nozzle and baseline nozzle with an aft-deck as shown in Figure 4.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig4-nozzle-800x274.png\"\r\n        alt=\"nozzle test case\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 4: The nozzle test case consisted of two nozzle configurations for participants to model: a baseline high-aspect-ratio converging rectangular nozzle and this baseline nozzle with an aft deck.\r\n        </figcaption>\r\n\r\n        <p>\r\n          For this case, the nozzle expands to ambient conditions and participants simulated a number of nozzle pressure ratio (NPR) conditions between 1.5 and 6.0 for each configuration. Participant results surveyed the mean axial velocity, Reynolds stress fluctuating velocity, and non-dimensional Reynolds shear stress from the nozzle exit to 15 characteristic lengths (i.e., the nozzle exit hydraulic diameter, <em>D<sub>h</sub></em> = 22.46 mm) downstream of the exit. Static pressure along the aft deck surface was also computed.\r\n        </p>\r\n\r\n        <p>\r\n          Both multi-block structured and mixed-element grids were created in Pointwise and provided to participants to use. Details of the workshop-supplied meshes for the nozzle test case are listed in Table 2.\r\n        </p>\r\n\r\n        <figcaption class=\"case-table\">\r\n          Table 2: Sets of multi-block structured and mixed-element unstructured meshes were provided to workshop participants for both nozzle test case configurations. Each set of grids includes three grid refinement levels for participants to use in grid sensitivity studies.\r\n        </figcaption>\r\n        <img data-src=\"images/Table2-800x417.png\"\r\n        alt=\"table 2\" class=\"img-fluid center-block\" />\r\n\r\n        <p>\r\n          For these meshes, a constant <em>y+</em> = 1 normal wall spacing value was computed for the NPR = 6 condition and applied to all grid refinement levels. The wall spacing is roughly driven by where the quantity, <em>&#961;u</em> (the product of density and axial velocity) is a maximum. Flow expands to choked conditions, and an assumption was made that <em>u</em> increases faster than <em>&#961;</em> decreases to reach a maximum value at the maximum Mach number. At high NPR, the choked exit conditions may be higher than ambient, so in order to estimate the initial normal wall spacing, stagnation conditions were expanded using isentropic relations to Mach = 1.\r\n        </p>\r\n\r\n        <p>\r\n          In the case of the mixed-element unstructured meshes, sources were used to add isotropic refinement in the region of the plume immediately downstream of the nozzle exit in this sensitive region of the flowfield as shown in Figure 5.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig5-plume-source-800x450.png\"\r\n        alt=\"quad-dominant surface mesh\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 5: A quad-dominant surface mesh was used in creating the mixed-element grids to recover layers of flow-aligned hexahedra in the boundary-layer resolved portion of each mesh. Sources (shown in green) were used to add grid refinement in the critical plume region of the flowfield.\r\n        </figcaption>\r\n\r\n        <p>\r\n          The multi-block structured grids were created by first using a normal extrusion off the inner-mold line (IML) surface of the nozzle, then creating an H-grid between the extents of the normal extrusion. The domains at the inlet and nozzle exit were smoothed using the elliptical solver in Pointwise, and then the same was done for the volume grid. The H-grid topology was extended to the farfield boundary, and an O-grid was wrapped around this H-grid topology and the nozzle’s outer-mold line (OML). Figure 6 shows a centerline cut through one of the multi-block structured baseline nozzle meshes.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig6-structured-fine-symmetry-800x456.png\"\r\n        alt=\"centerline cut through the baseline multi-block structured nozzle mesh.\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 6: A centerline cut through the baseline multi-block structured nozzle mesh.\r\n        </figcaption>\r\n\r\n        <p>\r\n          Participants’ CFD results (velocity, pressure, etc.) showed pretty favorable agreement with experimental results up to about <em>x/D<sub>h</sub></em> = 5.5. However, they appeared to show an additional oblique shock forming in the plume which was not captured during the wind tunnel test. This influenced much of the flowfield downstream, and properties of the plume generally appeared to decay faster in participants’ numerical results than what was observed in the experiment.\r\n        </p>\r\n\r\n        <p>\r\n          Interestingly, out of the seven participants in attendance who submitted results for the nozzle test case, only one used the multi-block structured set of meshes. Given the inherent dissipative nature of tetrahedra elements with finite volume solvers and the relatively simple nozzle geometry, it seems multi-block structured meshes would have been more suitable for this case. At least qualitatively, the shock train for solutions run on the multi-block structured meshes appeared far more defined than in other participants’ results.\r\n        </p>\r\n\r\n        <p>\r\n          One other interesting tidbit with this test case was observed. As NPR increases, the angle of the plume measured from the nozzle exit plane increases; thereby, rotating the plume counterclockwise (i.e., there is some natural thrust-vectoring accomplished by increasing NPR). Because the shear layer that develops immediately downstream of the nozzle exit is integral to flow properties that develop in the plume further downstream, resolving this region of the mesh is pretty important. This suggests that a single mesh is likely not suitable for simulating a large range of NPR conditions, or that the mesh used needs to refine a larger expansion region aft of the nozzle exit to capture the plume as it shifts, which may not be as efficient with regards to cell count. Determining the correct plume angle to use downstream of the nozzle exit for a given NPR in order to resolve it accurately also is not straightforward and doing so is probably best accomplished by adopting an adaptive mesh refinement (AMR) strategy.\r\n        </p>\r\n\r\n        <h2>Special Topics Test Case</h2>\r\n\r\n        <p>\r\n          Increased interest in this workshop was a catalyst for adding a new, third case study to PAW04. For the special topics test case participants were asked to predict the flow characteristics through a supersonic external compression inlet. The inlet model was designed by Techland Research, Inc. and tested on an F-15B propulsion flight test aircraft at Armstrong Research Facility as shown in Figure 7.\r\n        </p>\r\n\r\n        <p>\r\n          The design includes a translating channeled centerbody to facilitate engine airflow at off-design flight conditions, and its design was commissioned to satisfy NASA interest for its application to future Mach 2.5 cruise civil aircraft.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig7-external-compression-inlet-567x379.png\"\r\n        alt=\"compression inlet\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 7: The Techland Research external compression inlet installed on an F-15B propulsion flight test aircraft.\r\n        </figcaption>\r\n\r\n        <p>\r\n          Three attendees submitted results for this particular case study, and a couple of hours were spent Sunday afternoon covering participant results. Total pressure recovery and inlet distortion metrics were compared to available empirical data, and the CFD results generally agreed with one another, but given this test case is somewhat new additional time is needed to look more closely at contributors’ data.\r\n        </p>\r\n\r\n        <h2>In Closing</h2>\r\n\r\n        <p>\r\n          Meshing still remains somewhat of an art. Qualified engineers tend to spend an inordinate amount of time generating grids, while mathematicians focus on developing more advanced algorithms that may end up being tested on unsuitable meshes. Creating proper meshes for a given problem requires a lot of iteration and a wealth of experience. AIAA sponsored workshops provide an avenue whereby meshing expertise and ideas for solving domain-specific problems with CFD can be exchanged. There are several complex flow phenomena that are unique to propulsion aerodynamic internal flows that are important to consider when creating meshes for these types of complex problems.\r\n        </p>\r\n\r\n        <p>\r\n          Given the expertise of those involved in these workshops, they are well-suited for helping to educate the next generation of CFD engineers using relevant, real-world examples and provide a wealth of opportunity for mentoring.\r\n        </p>\r\n\r\n        <p>\r\n          At the end of the workshop, there was quite a bit of open and lively discussion surrounding CFD education at the undergraduate level, and what level of exposure to CFD would attract students’ interest while being accessible with available resources. Strangely, there were a few strong opinions shared that suggested perhaps grid generation shouldn’t be the starting-off point, but given the unique challenges posed by resolving complex flow phenomena with proper meshing techniques, there’s probably no better place to start.\r\n        </p>\r\n\r\n        <p>\r\n          If you are interested in running any of these test cases yourself, feel free to head over to the <a href=\"https://paw.larc.nasa.gov/\" target=\"_blank\" rel=\"noreferrer noopener\">Propulsion Aerodynamics Workshop website</a> where you can download the test case grids and participant guideline documents.\r\n        </p>","__v":0}
{"_id":{"$oid":"5fa969898e31332d3479f6ae"},"title":"Pointwise Enables Revolutionary Building Construction","abstract":"Branch Technology recognizes a problem with efficiency, cost, and effectiveness in building construction. They leverage inspiration from nature and large scale robotic additive manufacturing to revolutionize building construction and became the first company to 3D print large-scale structures. Using Pointwise for structured mesh generation enables Branch Technology to increase reliability of their process while simultaneously decreasing the time to generate printer instructions. Learn how Pointwise reduces the time for generating 3D printed instructions from weeks to hours.","postDate":{"$date":"2020-05-15T00:00:00Z"},"imgUrl":"Miami-Pavilion-3840x2160.png","imgAltText":"Largest 3D Printed Pavilion in the World","author":"","clientName":"Branch Technology","clientLogo":"Branch-Tech-Logo-400.png","clientSinceHead":"Client Since","clientSince":"2015","clientAboutHead":"About the Client","clientAbout":"Branch Technology consists of a diverse team of architects programmers, mechanical engineers, mathematicians and industrial designers focused on the common goal of revolutionizing the built environment. They are passionate about translating the strength, beauty, and efficiency of nature into how we build.","challenge":"Building construction is problematic in terms of efficiency, cost, and effectiveness with massive wasted materials and labor, very poor transfer of digital designs to the construction site, and high costs due to every project being custom.","solution":"Branch Technology, the first company to 3D print large-scale structures, leverages Pointwise structured mesh generation techniques to improve the efficiency and reliability of their large scale robotic additive manufacturing of structures.","benefit":"Using Pointwise for mesh generation enables Branch Technology to increase reliability while decreasing the time to generate printer instructions from weeks to hours.","ymal1Title":"Structured Grid for an Aneurysm","ymal1Img":"branch-tech-ymal1.png","ymal1Alt":"structured mesh","ymal1Abstract":"Beginning with a faceted geometry model of an arterial aneurysm, this webinar demonstrates how to generate a multi-block structured grid with O-H topology quickly and with high quality.","ymal1Url":"https://info.pointwise.com/webinar-structured-grid-aneurysm","ymal2Title":"High-Order Mesh Generation Using Pointwise","ymal2Img":"branch-tech-ymal2.png","ymal2Alt":"high-order mesh","ymal2Abstract":"There are two primary challenges associated with the degree elevation of linear elements: boundary conformance and curving of high aspect ratio cells encountered within the boundary layer region. In this webinar, we address these challenges and show how to improve CFD solution accuracy by generating boundary conforming, high-order meshes.","ymal2Url":"https://info.pointwise.com/webinar-high-order-mesh-generation-using-pointwise","ymal3Title":"Pointwise Visits Branch Tech for 3-D Printing Fun","ymal3Img":"branch-tech-ymal3.jpg","ymal3Alt":"Dr. Steve Karman (left) from Pointwise and Dr. Bruce Hilbert from Branch Technology (right) pose near one of Branch’s 3-D printing robots.","ymal3Abstract":"Dr. Steve Karman from our applied research team recently visited Branch Technology in Chattanooga to see their 3-D printing robots and learn more about their patented freeform, 3-D printing technology called Cellular Fabrication (TM). ","ymal3Url":"https://blog.pointwise.com/2017/04/12/pointwise-visits-branch-tech-for-3-d-printing-fun/","gated":true,"caseStudy":"\t\t\t\t<h2>\r\n\t\t\t\t\t&ldquo;And now for something completely different&rdquo;\r\n\t\t\t\t</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise&reg; is broadly recognized as a leader in CFD (computational fluid dynamics) meshing but how about as a leader in enabling 3D printing of large-scale structures? Branch Technology recognizes a problem with efficiency, cost, and effectiveness in building construction. They leverage inspiration from nature and large scale robotic additive manufacturing to revolutionize building construction and became the first company to 3D print large-scale structures. Using Pointwise for structured mesh generation enables Branch Technology to increase reliability of their process while simultaneously decreasing the time to generate printer instructions.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tBranch Technology utilizes a proprietary technology and process to drive robots to 3D print large scale truss structures which included defining a regular grid to drive the robots. Dr. C. Bruce Hilbert reviewed the process of generating the regular grid and quickly recognized that these regular grids were very similar to structured meshes.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<blockquote class=\"blockquote text-center pw-blue\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;You are making a structured grid. That problem has been solved for thirty years.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"><cite title=\"Source Title\">Dr. C. Bruce Hilbert, Branch Technology</cite></footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tMonty Python’s Flying Circus made the phrase &ldquo;And now for something completely different&rdquo; famous in the world of humor. Read on further to learn how Dr. Hilbert of Branch Technology made this phrase applicable to CFD Meshing.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>We have a problem</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe building construction industry is highly inefficient with a study from NSF highlighting $30B in wasted materials and $73B in wasted labor annually. The building construction industry is also very costly since every project is custom and incurs significantly higher costs due to customization. This is further compounded by an inability to effectively transfer digital design information to a construction site.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<blockquote class=\"blockquote text-center pw-blue\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;If you want anything more than a box your cost goes up by an order of magnitude.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"><cite title=\"Source Title\">Dr. C. Bruce Hilbert, Branch Technology</cite></footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<h2>Branch Technology envisions a solution</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tBranch Technology set out to enable the same qualities of strength, resilience, beauty, and variety found in nature to be applied to large scale structures. The process started with a recognition that internal mesh like structures were the key to nature’s flexibility and strength. This recognition of the role of structured meshing led Branch Technology to investigate and develop a process to drive large industrial robots. Branch Technology used their own proprietary print technology and large industrial robots to develop a unique process to 3D print large scale structures.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-Additive-Manufacturing-800x450.png\" alt=\"Geometry to Structured Mesh to 3D Print\"\r\n\t\t\t\t\tclass=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tLarge scale robotic additive manufacturing\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<h2>Pointwise enables the solution</h2>\r\n\t\t\t\t\r\n\t\t\t\t<p>\r\n\t\t\t\t\tA regular grid is required to drive the robots. Initially Branch Technology developed a visual computer script to generate the underlying regular grid. Dr. Hilbert quickly recognized that the structured meshing in Pointwise could enable more reliable and efficient generation of the underlying grid across a broader range of geometries to drive the 3D printing process. The new process leveraged Pointwise tools to go from overall geometry to a structured mesh that provided the grid definition to drive the 3D printing by robots.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig2-Geometry-Structured-Mesh-800x450.png\" alt=\"Large scale robotic additive manufacturing\"\r\n\t\t\t\t\tclass=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tGeometry to Structured Mesh to 3D Print\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe improved process of using Pointwise to go from geometry to structured mesh to 3D print rather than the previous scripting method enabled Branch Technology to increase reliability while decreasing the time to generate printer instructions from weeks to hours and increased the breadth of potential designs.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Branch Technology makes 3D printed large scale structures a reality</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tWith the design and 3D printing process leveraging Pointwise meshing established, Branch Technology moved on to applying the approach to a wide range of projects including: a structure in Cheekwood Gardens, Design Miami Pavilion, OneC1ty Band Pavilion in Nashville, Tennessee, and many more. Each project brought more and more complex geometries and meshing requirements including the use of transition blocks in Pointwise to handle rapidly changing geometries.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe Design Miami Pavilion was a landmark project resulting in the largest 3D printed pavilion in the world. The Design Miami Pavilion has survived at least two hurricanes.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig3-Miami-Pavilion-800x450.png\" alt=\"Miami Design Pavilion\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tDesign Miami Pavilion\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tBranch Technology also made a presence in the art world including; a display at the Atlanta Museum of Art, a topological map of the Tennessee river, and the Nature Cloud installed at the Field Museum in Chicago.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig4-Nature-Clouds-800x450.png\" alt=\"Nature Clouds at the Field Museum\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tNature Clouds at the Field Museum\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tBranch Technology is now actively investigating how to improve the breadth and complexity of the large scale structures that it can print. This investigation includes the development of a printing process that can work from an unstructured grid leveraging the tetrahedral meshing available in Pointwise.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor more information about how Branch Technology is leveraging Pointwise meshing to make 3D printing of large scale structures a reality, watch Dr. Hilbert’s presentation outlining the Branch Technology journey.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<div class=\"cta-space\">\r\n\t\t\t\t\t<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\"\r\n\t\t\t\t\t\tid=\"hs-cta-wrapper-a8de282b-68d3-4a6b-9d6c-8bc96d0432ba\"><span\r\n\t\t\t\t\t\t\tclass=\"hs-cta-node hs-cta-a8de282b-68d3-4a6b-9d6c-8bc96d0432ba\" id=\"hs-cta-a8de282b-68d3-4a6b-9d6c-8bc96d0432ba\">\r\n\t\t\t\t\t\t\t<!--[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]--><a\r\n\t\t\t\t\t\t\t\thref=\"https://cta-redirect.hubspot.com/cta/redirect/3788790/a8de282b-68d3-4a6b-9d6c-8bc96d0432ba\"><img\r\n\t\t\t\t\t\t\t\t\tclass=\"hs-cta-img\" id=\"hs-cta-img-a8de282b-68d3-4a6b-9d6c-8bc96d0432ba\" style=\"border-width:0px;\"\r\n\t\t\t\t\t\t\t\t\tsrc=\"https://no-cache.hubspot.com/cta/default/3788790/a8de282b-68d3-4a6b-9d6c-8bc96d0432ba.png\"\r\n\t\t\t\t\t\t\t\t\talt=\"Branch Technology’s Progress Utilizing Structured Grids Created with Pointwise\" /></a></span>\r\n\t\t\t\t\t\t<script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script>\r\n\t\t\t\t\t\t<script type=\"text/javascript\"> hbspt.cta.load(3788790, 'a8de282b-68d3-4a6b-9d6c-8bc96d0432ba', {}); </script></span>\r\n\t\t\t\t\t<!-- end HubSpot Call-to-Action Code --> \r\n</div>","__v":0}
{"_id":{"$oid":"5fa9a44a9d586024a4bfbcab"},"title":"How to Mesh a Frozen Drone","abstract":"Icing is a severe hazard that significantly limits the usage of autonomous unmanned aerial vehicles (UAVs). Computational fluid dynamic (CFD) methods are a vital tool for understanding the effects of icing on UAVs. One of the most challenging tasks for the simulation is the generation of high-quality meshes of complex ice shapes. Find out how Pointwise met the challenge and decreased the mesh creation time with its automation.","postDate":{"$date":"2020-04-27T00:00:00Z"},"imgUrl":"FrozenDrone-Main-3840x1200.png","imgAltText":"Example of CFD results for a clean and iced airfoil","author":"by Richard Hann<br />Department of Engineering Cybernetics<br />Norwegian University of Science and Technology<br />","clientName":"The Department of Engineering Cybernetics at Norwegian University of Science and Technology","clientLogo":"ntnu-logo-400.png","clientSinceHead":"Partner Since","clientSince":"2018","clientAboutHead":"About the Partner","clientAbout":"The Department of Engineering Cybernetics at Norwegian University of Science and Technology is involved with the interdisciplinary study and automatic control of dynamic systems like robots, aircraft, marine craft, automotive systems, electrical circuits, biological systems, process plants, etc. and their behavior.","challenge":"Icing is a severe hazard that significantly limits the usage of autonomous unmanned aerial vehicles. One of the most challenging tasks is creating high-quality meshes of multiple complex ice shapes in a timely manner.","solution":"Pointwise’s T-Rex functionality, reliably and with little manual adjustments, meshes the complex ice structures, thus allowing us to accurately capture the aerodynamic penalties. The macro-function of Pointwise automated our workflow for the large number of ice shapes.","benefit":"The CFD results quickly attained using Pointwise meshes show that the degree of performance degradation is strongly related to the temperature. At low temperatures droplets freeze on impact forming streamlined shapes, while at warmer temperatures not all freeze immediately and can form complex ice horns that disrupt the flow.","ymal1Title":"Rapid Viscous CFD Mesh Generation for Propellers","ymal1Img":"frozen-drone-ymal1.png","ymal1Alt":"propeller mesh","ymal1Abstract":"Learn strategies to quickly construct a high-quality viscous mesh for a model aircraft propeller. These strategies can be used to accurately capture relevant blade geometry as well as efficiently resolve the surface curvature and boundary layer.","ymal1Url":"https://info.pointwise.com/video-rapid-viscous-mesh-generation-propellers","ymal2Title":"Unstructured Mesh Generation for Simulation of Airfoil Ice Accretion","ymal2Img":"frozen-drone-ymal2.png","ymal2Alt":"Airfoil Ice Simulation","ymal2Abstract":"Researchers at Penn State University are using T-Rex anisotropic tetrahedral extrusion in Pointwise to make high-quality, boundary layer-resolved hybrid meshes for CFD analysis of a critical flight safety issue: ice build-up on aircraft structures.","ymal2Url":"https://www.pointwise.com/theconnector/2015-March/Unstructured-Mesh-Generation-Simulation-Airfoil-Ice-Accretion.html","ymal3Title":"Application of Pointwise T-Rex Meshing and CFD Modeling to the Analysis of Supercritical Carbon Dioxide (S-CO2) Power Cycles","ymal3Img":"frozen-drone-ymal3.png","ymal3Alt":"carbon dioxide compressor","ymal3Abstract":"A team of engineers at CRAFT Tech set out to model an experimental supercritical carbon dioxide (S-CO2) compressor configuration. The engineers needed software that would resolve flow gradients with a minimum number of grid points and be flexible enough to provide the best grid for each region of the machine that they were modeling. They found both these solutions in Pointwise. ","ymal3Url":"https://info.pointwise.com/case-study-application-pointwise-t-rex-meshing-cfd-modeling","gated":true,"caseStudy":"<p>\t\t\t\t\t<strong>\t\t\t\t\t\tIcing of drones is a severe hazard that significantly limits the usage of autonomous unmanned aerial vehicles (UAVs). Computational fluid dynamics (CFD) methods, originally developed for manned aircraft icing, are a vital tool for understanding the effects of icing on UAVs. One of the most challenging tasks for the simulation is the generation of high-quality meshes of complex ice shapes.\t\t\t\t\t</strong>\t\t\t\t</p>\t\t\t\t<p>\t\t\t\t\tAtmospheric icing, also called in-cloud icing, occurs when an aircraft encounters supercooled droplets in the atmosphere. Liquid droplets, with a temperature below freezing, turn into ice when they collide with the airframe. Small surfaces, like wings, elevators, and propellers are particularly sensitive to icing and can accumulate significant amounts of ice on the leading-edge. The resulting ice shapes disrupt the airflow and lead to a decrease in aerodynamic performance. The typical penalties are an increase in drag, a decrease in lift, and a reduction of the stall margin. Atmospheric icing is, therefore, a severe hazard to all aircraft and has catastrophic consequences.\t\t\t\t</p>\t\t\t\t<!-- 16:9 aspect ratio -->\t\t\t\t<div class=\"lets-talk-video embed-responsive embed-responsive-16by9\">\t\t\t\t\t<iframe width=\"560\" height=\"315\" title=\"Towards Mesh Adaptation with Pointwise Video on YouTube\" src=\"https://www.youtube.com/embed/jZfjtbI7mcs\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\t\t\t\t</div>\t\t\t\t<figcaption>\t\t\t\t\tWind tunnel experiments on UAV icing by NTNU and UBIQ Aerospace at the icing wind tunnel facilities at VTT.\t\t\t\t</figcaption>\t\t\t\t<p>\t\t\t\t\tUAVs are an emerging technology with many potential applications. Some that are particularly relevant when it comes to icing are operations that occur beyond visual line of sight (BVLOS) because icing can occur without the ground pilot noticing. BVLOS missions are required for many drone applications, which are currently discussed, e.g. package deliveries, search & rescue, communications, or pipeline monitoring. Management of the icing risk is a key step in ensuring that these applications can be conducted safely and reliably in the future.\t\t\t\t</p>\t\t\t\t<p>\t\t\t\t\tUntil today, very little research has been conducted on the differences between icing on manned and unmanned aircraft. One of the things we are working on is to understand how icing affects the aerodynamic performance of a fixed-wing UAV. Numerical icing codes, mostly developed for manned aircraft applications (e.g. LEWICE, FENSAP-ICE), are a useful tool to investigate icing on drones. These icing codes typically rely on CFD methods to simulate the flow field and to calculate the impingement rates of droplets on the airframe. We use these codes to simulate ice shapes and to compare the clean and iced aerodynamic performance on 2D and 3D UAV geometries. To validate the numerical results, we have conducted several experimental campaigns in specialized icing wind tunnels that are able to generate icing conditions under laboratory conditions.\t\t\t\t</p>\t\t\t\t<img data-src=\"images/Fig1-Rim-Ice-800x533.png\" alt=\"Experimental rim ice shape\"\t\t\t\t\tclass=\"img-fluid center-block\" />\t\t\t\t<figcaption>\t\t\t\t\tExperimental rim ice shape\t\t\t\t</figcaption>\t\t\t\t<p>\t\t\t\t\tA key input for all CFD tools is a good mesh. The ice horns that form on the leading-edges of wings are particularly difficult to discretize. These ice shapes are characterized by irregular and complex geometries that need to be meshed well in order to capture the aerodynamic penalties accurately. We are using Pointwise to generate hybrid T-Rex meshes, with a structured grid in the boundary layer and an unstructured grid in the far-field. The T-Rex functionality is able to capture the complex ice structures reliably and requiring little manual adjustment. Since we are dealing with large numbers of ice shapes, we are also relying on Pointwise’s Glyph scripting language to automate our workflow which significantly decreases processing times. We use the resulting meshes in combination with ANSYS FENSAP-ICE on 2D and 3D UAV geometries to simulate the aerodynamic penalties at low Reynolds numbers (ca. 1,000,000).\t\t\t\t</p>\t\t\t\t<img data-src=\"images/Fig2-Hybrid-Mesh-800x494.png\" alt=\"Hybrid T-Rex 2D mesh on a complex experimental glaze ice shape.\"\t\t\t\t\t class=\"img-fluid center-block\" />\t\t\t\t<figcaption>\t\t\t\t\tHybrid T-Rex 2D mesh on a complex experimental glaze ice shape.\t\t\t\t</figcaption>\t\t\t\t<img data-src=\"images/Fig3-Hybrid-3D-800x477.png\" alt=\"Hybrid T-Rex 3D mesh on a full-scale UAV with artificial ice shapes attached to the wing.\"\t\t\t\t\t class=\"img-fluid center-block\" />\t\t\t\t<figcaption>\t\t\t\t\tHybrid T-Rex 3D mesh on a full-scale UAV with artificial ice shapes attached to the wing.\t\t\t\t</figcaption>\t\t\t\t<p>\t\t\t\t\tThe CFD results show that the degree of performance degradation is strongly related to the temperature. The reason for this is that the temperature governs the ice shape. At very low temperatures all incoming droplets freeze upon impact, forming relatively streamlined rime ice shapes. At temperatures close to freezing, only a fraction of the droplets freezes immediately. This can lead to complex glaze ice horns that are associated with large penalties.\t\t\t\t</p>\t\t\t\t<img data-src=\"images/Fig4-Clean-Iced-800x299.png\" alt=\"Example of CFD results for a clean and iced airfoil\"\t\t\t\t\t class=\"img-fluid center-block\" />\t\t\t\t<figcaption>\t\t\t\t\tExample of CFD results for a clean and iced airfoil (source: Fajt et al, 2019)\t\t\t\t</figcaption>\t\t\t\t<img data-src=\"images/Fig-Sim-Results-800x533.png\" alt=\"Simulation results for the aerodynamic performance degradation at Re=800,000\"\t\t\t\t\t class=\"img-fluid center-block\" />\t\t\t\t<figcaption>\t\t\t\t\tSimulation results for the aerodynamic performance degradation at Re=800,000 (source: Fajt et al, 2019)\t\t\t\t</figcaption>\t\t\t\t<p>\t\t\t\t\tWe are currently working on the validation of the numerical tools with experimental data and aim to publish more information next year. In the future, our objective will be the numeric simulation of iced UAV propellers and rotors, which will also be very challenging when it comes to meshing.\t\t\t\t</p> \r\n\t\t\t\t<h3>References</h3>\r\n\t\t\t\t<ol>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref1\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tHann, R. (2019). UAV Icing: Ice Accretion Experiments and Validation. SAE Technical Paper. No. 2019-01-2037. DOI: 10.4271/2019-01-2037\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref2\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tFajt, N., Hann, R. (2019) The Influence of Meteorological Conditions on the Icing Performance Penalties on a UAV Airfoil. 8th European Conference for Aeronautics and Aerospace Sciences (EUCASS). DOI: 10.13009/EUCASS2019-240\r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ol>","__v":0}
{"_id":{"$oid":"5fa9acdcfa21213bc831692d"},"title":"High-Order Curved Meshes for More Accurate CFD Solutions","abstract":"Read about how Pointwise generates high-order curved meshes for high Reynolds number flows and how it helps you do more in less time with fewer resources while lowering program uncertainty and expense.","postDate":{"$date":"2020-02-19T00:00:00Z"},"imgUrl":"high-order-cs-3840x1200.png","imgAltText":"Example of curved mesh generated in Pointwise software","author":"","clientName":"University of Tennessee","clientLogo":"UT-logo-200.png","clientSinceHead":"Client Since","clientSince":"2014","clientAboutHead":"About the Client","clientAbout":"Founded in 1794, the University of Tennessee (UT) was the first public university chartered west of the Appalachian Divide. UT Knoxville — which includes the UT Space Institute — serves the state by educating its citizens, enhancing its culture, and making a difference in people's lives through research and service.","challenge":"The traditional approach to increasing the fidelity of linear meshes has been to use bigger, faster computers; techniques such as vectorization, parallelization, and GPU solvers; and unstructured or hybrid grids to reduce grid points. Unfortunately, this approach has reached its limits.","solution":"Pointwise has released the first commercial CFD mesher to generate high-order curved meshes for high Reynolds number flows. Flow solvers that use high-order, curved meshes require less memory and CPU time than existing methods, scale well on parallel computing clusters, and offer increased flexibility for mesh adaption to decrease grid points and file size.","benefit":"Decrease memory and CPU needs, work on parallel computer clusters, and reduce file size.","ymal1Title":"Recent Developments in Pointwise Applied Research","ymal1Img":"curved-mesh-ymal1.jpg","ymal1Alt":"Nick Wyman presenting Recent Developments in Pointwise Applied Research","ymal1Abstract":"Watch a presentation given at the Pointwise User Group Meeting about user-independent automated meshing and the latest meshing technologies under development at Pointwise.","ymal1Url":"https://info.pointwise.com/recent-developments-pointwise-applied-research","ymal2Title":"High-Order Mesh Generation Using Pointwise","ymal2Img":"curved-mesh-ymal2.png","ymal2Alt":"A Q2 high-order mesh was generated for the NASA Rotor 37 geometry","ymal2Abstract":"There are two primary challenges associated with the degree elevation of linear elements: boundary conformance and curving of high aspect ratio cells encountered within the boundary layer region. In this webinar, we address these challenges and show how to improve CFD solution accuracy by generating boundary conforming, high-order meshes.","ymal2Url":"https://info.pointwise.com/webinar-high-order-mesh-generation-using-pointwise","ymal3Title":"Towards Mesh Adaptation with Pointwise","ymal3Img":"curved-mesh-ymal3.png","ymal3Alt":"A point cloud source consisting of more than two-million points was imported into Pointwise using a Glyph script.","ymal3Abstract":"This webinar introduces a feature currently in development for mesh adaptation. It accepts from the flow solver a point cloud on which target cell sizes are specified. This point cloud is used as a clustering source in Pointwise to adapt both the volume and surface meshes.","ymal3Url":"https://info.pointwise.com/webinar-towards-mesh-adaptation-with-pointwise","gated":true,"caseStudy":"<p>\r\n\t\t\t\t\t<strong>It is a relatively simple concept: The higher a mesh’s fidelity, the more accurate the solution, and the more accurate the solution, the lower the program uncertainty and expense. As with many such concepts, however, implementation is not so simple or easy.</strong>\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe traditional approach to increasing the fidelity of linear meshes has been to use bigger, faster computers; techniques such as vectorization, parallelization, and GPU solvers; and unstructured or hybrid grids that help reduce grid points and file size. All this requires massive files that strain CPU time and memory, testing the limits of even the most advanced computer hardware. Today, there is not much more fidelity that can be squeezed out of linear meshes. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<blockquote class=\"blockquote text-center pw-blue\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;Now we can generate meshes with true curves like the curves we see in nature, not a highly resolved facetted linear mesh, which will never be able to map true curves or circles.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"><cite title=\"Source Title\">Ryan Glasby, Ph.D., Joint Institute for Computational Sciences at the University of Tennessee</cite></footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t<strong>Put another way: you can only go so far with linear meshes, especially when it comes to using them with today’s high-order CFD solvers.</strong>\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tTo address this, Pointwise has released the first commercial mesher for generating high-order curved meshes for high Reynolds number flows. It works with today’s new high-order CFD solvers to yield the most accurate solutions possible. Flow solvers that use high-order, curved meshes require less memory and CPU time than existing methods, scale well on parallel computing clusters, and offer increased flexibility for mesh adaption to decrease grid points and file size.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;With linear meshes, the edges of the elements are straight. To resolve a round shape, the mesh has to have many small straight segments,&rdquo; says Dr. Steve Karman, Pointwise staff specialist, who helped pioneer the new high-order mesh software. &ldquo;But a high-order mesh defines the shape using different order polynomial lines and surfaces.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise can generate curved meshes with fourth order polynomials, according to Karman. If the actual shape of the geometry being analyzed can be represented with a polynomial up to fourth degree, he says, the shape becomes &ldquo;true&rdquo; to the geometry. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-HO-Curved-Mesh-880x352.png\"\r\n\t\t\t\talt=\"High-order curved mesh (L) compared to a highly resolved linear mesh (R) of an airplane wing\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;This is more than making better use of time and resources, though. This is a paradigm shift,&rdquo; adds Dr. Ryan Glasby with the Joint Institute for Computational Sciences at the University of Tennessee. &ldquo;Now we can generate meshes with true curves like the curves we see in nature, not a highly resolved facetted linear mesh, which will never be able to map true curves or circles.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tGlasby and his group are working to develop a finite element flow solver that can handle high-order meshes. He compares the difference between linear and curved meshing to the difference between cathode-ray and plasma televisions.  \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;Cathode-ray TVs paint lines on the screen to create a picture. To increase the fidelity of the picture you had to have more lines, which meant larger and larger cathode-ray tubes to the point that the TV was massive,&rdquo; Glasby says. &ldquo;Plasma TVs increase fidelity by enriching the pixels with polynomials and now TV screens are a quarter-of-an-inch thick.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tGlasby adds that the higher accuracy offered by high-order curved meshes is especially useful for off design conditions such as landing in a crosswind, helicopters, ships, and similar applications. But the future promises uses that we haven’t even considered.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;We don’t know what we have until we have it,&rdquo; he concludes.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor a closer look at the technical aspects of high-order meshing, watch the video of the presentation given by Ryan Glasby on this subject:\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p class=\"text-center cta-space\">\r\n\t\t\t\t\t<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-3e79f2e7-29bf-48de-a746-94ce8f81a5b6\"><span class=\"hs-cta-node hs-cta-3e79f2e7-29bf-48de-a746-94ce8f81a5b6\" id=\"hs-cta-3e79f2e7-29bf-48de-a746-94ce8f81a5b6\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]--><a href=\"https://cta-redirect.hubspot.com/cta/redirect/3788790/3e79f2e7-29bf-48de-a746-94ce8f81a5b6\" ><img class=\"hs-cta-img\" id=\"hs-cta-img-3e79f2e7-29bf-48de-a746-94ce8f81a5b6\" style=\"border-width:0px;\" src=\"https://no-cache.hubspot.com/cta/default/3788790/3e79f2e7-29bf-48de-a746-94ce8f81a5b6.png\"  alt=\"Higher Order Results from DoD HPCMP CREATETM-AV Kestrel\"/></a></span><script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script><script type=\"text/javascript\"> hbspt.cta.load(3788790, '3e79f2e7-29bf-48de-a746-94ce8f81a5b6', {}); </script></span><!-- end HubSpot Call-to-Action Code -->\r\n\t\t\t\t</p>","__v":0}
{"_id":{"$oid":"5faacb5504d997423c0ac578"},"title":"Pointwise delivers fast, accurate results for Garry Rogers Motorsport","abstract":"Due to governing body rule changes, Garry Rogers Motorsport needed to design and build a completely new V8 Supercar without blowing their budget and schedule. By moving their CFD meshing to Pointwise, Garry Rogers Motorsport was able to significantly reduce their hours spent generating meshes while also having a great deal of confidence in the results.","postDate":{"$date":"2018-10-22T00:00:00Z"},"imgUrl":"GRM-Volvo-V8-Supercar-3840x1200.jpg","imgAltText":"V8 Supercar","author":"","clientName":"Garry Rogers Motorsport","clientLogo":"GRM-logo-200.png","clientSinceHead":"Client Since","clientSince":"2012","clientAboutHead":"About the Client","clientAbout":"Garry Rogers Motorsport, is an Australian motor racing team owned by retired racing driver Garry Rogers. Based in Melbourne, the team has competed in a variety of touring car series in Australia. In 2013 the team celebrated its 50th year in racing since Rogers made his debut.","challenge":"Due to governing body rule changes, Garry Rogers Motorsport needed to design and build a completely new V8 Supercar without blowing their budget and schedule.","solution":"By moving their CFD meshing to Pointwise, Garry Rogers Motorsport was able to significantly reduce their hours spent generating meshes while also having a great deal of confidence in the results.","benefit":"Using Pointwise, they avoided the time and money spent by other teams on recertification.","ymal1Title":"Automotive Design Optimization using Pointwise, Sculptor, and OpenFOAM&reg;","ymal1Img":"Webinar-Automotive-Design-Optimization-DrivAer-400x240.png","ymal1Alt":"Automotive Design Optimization using Pointwise, Sculptor, and OpenFOAM","ymal1Abstract":"When coupled with a high-quality mesh generator, mesh morphing promises to allow rapid design space exploration by eliminating the need to remesh. Using the DrivAer geometry as an example, we use Pointwise, OpenFOAM, and Sculptor to simulate design variations.","ymal1Url":"http://info.pointwise.com/webinar-automotive-design-optimization","ymal2Title":"Localized Remeshing Strategies for Parametric Models in Pointwise","ymal2Img":"webcast-DrivAer-Components-400x240.png","ymal2Alt":"Localized Remeshing Strategies for Parametric Models in Pointwise","ymal2Abstract":"This video demonstrates the flexibility you will gain from Pointwise’s ability to limit remeshing to regions where geometry changes during your design cycle. Included are techniques for remeshing on geometry model import, merging adjacent meshes, and more.","ymal2Url":"http://info.pointwise.com/webinar-localized-remeshing-strategies-parametric-models","ymal3Title":"The Stanford Solar Car Project's Race for Aerodynamic Efficiency","ymal3Img":"solar-400x240.png","ymal3Alt":"The Stanford Solar Car Project's Race for Aerodynamic Efficiency","ymal3Abstract":"Chasing the Sun 3000 km across the Australian Outback is a challenge. And doing it in a solar powered vehicle is an even bigger challenge. But every two years the Stanford Solar Car Project, a student-run organization, arrives in Australia with a new design ready to take on the Bridgestone World Solar Challenge.","ymal3Url":"../../theconnector/2016-Q3/Stanford-Solar-Car-Projects-Race-for-Aerodynamic-Efficiency.html","gated":true,"caseStudy":"\t\t\t\t<p>\r\n\t\t\t\t\tAustralia’s V8 Supercars Championship is one of the most popular touring car series in the country. As the name suggests, these custom-built cars are based on V8 production cars manufactured for open roads and highways. The Garry Rogers Motorsport (GRM) racing team has been a leader in Australian touring car racing for more than 50 years. Since joining the V8 Supercars Championship series in 1996, the team has introduced several legendary drivers and claimed major championships such as the Bathurst 1000 and Bathurst 24 Hour. For GRM, the automotive CFD meshing capabilities provided by Pointwise played an integral part in building the Supercars that could help get them to the finish line first.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>V8 Supercar of the Future</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe year 2010 brought major changes to the sport when plans for the &ldquo;Car of the Future&rdquo; were unveiled by the V8 Supercars governing body. The plans were well-received and promised to reduce the cost of the car by 50 to 60 percent, improve safety, make the race more exciting, and attract new automotive manufacturers, among other benefits.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-Mesh-Rear-Diffuser.png\"\r\n\t\t\t\talt=\"Pointwise meshing for rear diffuser of GRM’s Volvo V8 Supercar\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tPointwise meshing for rear diffuser of GRM’s Volvo V8 Supercar. For most automotive CFD solutions, the quality of the mesh is critical to generating accurate solutions, especially for viscous flows over the complex geometries.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe plans specified that the next generation V8 Supercars have a fixed chassis design, be dimensionally identical, and produce near identical downforce and drag numbers to create parity between all V8 cars. Because of parity, human skills are what wins races, making it more exciting for fans and a more interesting challenge for the teams and drivers.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>High-quality meshing in less time saves money</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPartnering with Volvo, GRM’s priority was to build its V8 Supercar with speed and accuracy without exceeding budget. Because wind tunnels are against regulations, the team relies on CFD solutions to evaluate and adjust a car’s aerodynamics. For most automotive CFD solutions, the quality of the mesh is critical to generating accurate solutions, especially for viscous flows over the complex geometries of a race car. It takes a lot of time to generate quality meshes without automating the process, however, and that’s where Pointwise comes in handy.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig2-Visualization-rear-diffuser.png\"\r\n\t\t\t\talt=\"CFD visualization of viscous flow over the V8 Supercar’s rear diffuser.\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tCFD visualization of viscous flow over the V8 Supercar’s rear diffuser.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;Since moving the CFD meshing operation to Pointwise, the hours invested in mesh generation have been significantly reduced while also having a great deal of confidence with the results we obtain.&rdquo; said Garry Rogers, GRM founder and owner.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise's features include the anisotropic tetrahedral extrusion method (T-Rex), which can capture the highly detailed boundary layer as it develops around a complex geometry. For GRM, this is critical to accurately predicting the downforce on the wing elements and diffusers near the ground. New features such as point-matched structured and unstructured blocks and quad-dominant meshing also make it possible to increase geometric complexity without increasing computational costs.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig3-Mesh-wing.png\"\r\n\t\t\t\talt=\"Pointwise mesh of V8 Supercar’s rear wing.\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tPointwise mesh of V8 Supercar’s rear wing.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;The fact that some manufacturers have had to re-homologate  their cars represent a large — and what should have been an unnecessary — expenditure in time, money and personnel,&rdquo; added Rogers. &ldquo;We have managed to avoid these expenditures by demonstrating the savings achievable from utilizing Pointwise for meshing.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise offers highly sophisticated levels of automation that enable users to rapidly mesh the complex shapes needed to quickly generate accurate CFD solutions. On the other end of the spectrum, Pointwise users can make detailed changes manually, including moving grid points one at a time. This provides users with high levels of automation for greater speed and high levels of control for extremely accurate results and is typically not found in other preprocessing products.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<div class=\"cta-space text-center\">\r\n\t\t\t\t\t<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-932a8cb6-6fc2-4747-8e4f-99938b6982a9\"><span class=\"hs-cta-node hs-cta-932a8cb6-6fc2-4747-8e4f-99938b6982a9\" id=\"hs-cta-932a8cb6-6fc2-4747-8e4f-99938b6982a9\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]--><a href=\"https://cta-redirect.hubspot.com/cta/redirect/3788790/932a8cb6-6fc2-4747-8e4f-99938b6982a9\" ><img class=\"hs-cta-img\" id=\"hs-cta-img-932a8cb6-6fc2-4747-8e4f-99938b6982a9\" style=\"border-width:0px;\" src=\"https://no-cache.hubspot.com/cta/default/3788790/932a8cb6-6fc2-4747-8e4f-99938b6982a9.png\"  alt=\"Get a Free Trial\"/></a></span><script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script><script type=\"text/javascript\"> hbspt.cta.load(3788790, '932a8cb6-6fc2-4747-8e4f-99938b6982a9', {}); </script></span><!-- end HubSpot Call-to-Action Code -->\r\n\t\t\t\t</div>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tWhen it comes to automotive CFD meshing, Pointwise users do not need to choose between speed and accuracy. They get the best of both worlds.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<!-- 16:9 aspect ratio -->\r\n\t\t\t\t<div class=\"lets-talk-video embed-responsive embed-responsive-16by9\">\r\n\t\t\t\t\t<video controls>\r\n\t\t\t\t\t\t<source src=\"Adelaide-2014-R2-Last-Lap.mp4\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen>\r\n\t\t\t\t\t\t</video>\r\n\t\t\t\t\t</div>\r\n\t\t\t\t\t<figcaption>\r\n\t\t\t\t\t\tWatch as GRM Driver Scott McLaughlin takes the final lap in Race 2 of the 2014 Adelaide Clipsal 500. McLaughlin drives a blue Volvo. The automotive CFD meshing capabilities provided by Pointwise gave GRM the ability to rapidly mesh complex shapes while quickly generating accurate CFD solutions.\r\n\t\t\t\t\t</figcaption>","__v":0}
{"_id":{"$oid":"5faad43b04d997423c0ac579"},"title":"Pointwise Enables Accurate CFD for Nuclear Reactor Rod Bundles","abstract":"Obtaining accurate computational fluid dynamics (CFD) for nuclear reactor rod bundles can be extremely challenging due to the complex geometry of the rods and wrapped wires. Automatic unstructured meshing techniques do not provide enough control over the mesh for the wire-wrapped rod bundles. Multiple Pointwise meshing techniques were used to capture the complex geometry. A fully structured mesh was used near the boundaries, and a hex-dominant unstructured mesh was used away from the boundaries to enable an accurate CFD solution for a 19-rod nuclear reactor rod bundle with ANSYS CFX. Pointwise provides a great deal of control and different techniques that can be used to make high-quality meshes for extremely complex geometries.","postDate":{"$date":"2020-06-30T00:00:00Z"},"imgUrl":"Rod-Bundle-Main-3840x1200.png","imgAltText":"Optimized Grid for 19-Rod Bundle","author":"","clientName":"The Karlsruhe Institute of Technology (KIT)","clientLogo":"Kit-Logo-400.png","clientSinceHead":"Client Since","clientSince":"2001","clientAboutHead":"About the Client","clientAbout":"The Karlsruhe Institute of Technology (KIT) was created to occupy a leading position worldwide in selected research areas. KIT is an institution for top-class research, excellent scientific training, lifelong learning, unlimited knowledge exchange, and a sustainable culture of innovation.","challenge":"Accurate computational fluid dynamics (CFD) results are needed for the design of nuclear reactor rod bundle cooling, which requires a high-quality, detailed mesh of the complex bundle and wrapped wire geometry to capture the physics appropriately.","solution":"Michael B&ouml;ttcher of KIT used multiple Pointwise structured and unstructured meshing techniques to model the complex geometry of the rods and the wrapped wires that resulted in a highly accurate computational fluid dynamics (CFD) solution with ANSYS CFX.","benefit":"Leveraging Pointwise meshing techniques enabled accurate computational fluid dynamics (CFD) results for nuclear reactor rod bundles at stringent convergence levels, which cannot be achieved with automatic &ldquo;free&rdquo; meshing alone.","ymal1Title":"CFD Simulation of Supercritical CO2 Power Cycles","ymal1Img":"power-cycle-ymal1.png","ymal1Alt":"Carbon dioxide compressor","ymal1Abstract":"A team of engineers at CRAFT Tech set out to model an experimental supercritical carbon dioxide (S-CO2) compressor configuration. The engineers needed software that would resolve flow gradients with a minimum number of grid points and be flexible enough to provide the best grid for each region of the machine that they were modeling. They found both these solutions in Pointwise.","ymal1Url":"https://info.pointwise.com/case-study-application-pointwise-t-rex-meshing-cfd-modeling","ymal2Title":"Mesh Strategies for the FDA Benchmark Centrifugal Blood Pump","ymal2Img":"power-cycle-ymal2.png","ymal2Alt":"Slice through the hybrid-viscous mesh topology in the FDA centrifugal blood pump, including the element type and count.","ymal2Abstract":"Learn how a hybrid-viscous mesh can improve solution efficiency. For many applications, structured meshes are preferred. However, if more efficient meshing techniques are possible and provide accurate solutions, exploration of those alternatives is imperative. In this webinar, we compare solutions obtained using a hybrid-viscous mesh with a multi-block structured mesh.","ymal2Url":"https://info.pointwise.com/mesh-strategies-fda-benchmark-centrifugal-blood-pump","ymal3Title":"Hybrid Meshing Key to Improving CFD Simulation Efficiency","ymal3Img":"power-cycle-ymal3.png","ymal3Alt":"The Potsdam Propeller test case geometry","ymal3Abstract":"Read the case study, &ldquo;Hybrid Meshing Key to Improving CFD Simulation Efficiency,&rdquo; which summarizes how a T-Rex hybrid grid showed up to a seven-fold improvement in solution efficiency compared to other approaches in predicting thrust and torque for a marine propeller.","ymal3Url":"../../case-studies/U3dS33ng4YN7frFJ/","gated":true,"caseStudy":"<h2>Pointwise Meshing Techniques Meet the Challenge</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAccurate fluid flow modeling of nuclear reactor rod bundles is essential and extremely challenging with exacting standards for the mesh to deal with the geometric complexity and near-wall physics. The tightly packed rods with wrapped wires, mainly used in liquid metal cooled systems, that contact the rods provide a challenging geometry into which well-defined boundary layers need to be inserted to capture the local physics accurately. Multiple Pointwise structured meshing techniques were used at the boundaries with hex-dominant unstructured meshing away from the boundaries to successfully meet the meshing challenge and produce accurate fluid flow modeling of a 19-rod bundle.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<blockquote class=\"blockquote text-center pw-blue\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;A high-quality computational fluid dynamics (CFD) model for a rod assembly was developed, which exhibited very good numerical performance at academic convergence levels.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"><cite title=\"Michael B&ouml;ttcher, Karlsruhe Institute of Technology (KIT)\">Michael B&ouml;ttcher, Karlsruhe Institute of Technology (KIT)</cite></footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<h2>Sodium Cooled Generation IV Fast Reactor</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe core design of the Advanced Sodium Technological Reactor for Industrial Demonstration (ASTRID) nuclear reactor was used as the basis of the 19-rod bundle model. The ASTRID reactor uses a primary sodium pool for heat transfer and cooling of the rod. The core consists of over fifty thousand rods, which are grouped in 217-rod bundle assemblies. The numerical model represents only a part of such an assembly but can be considered as sufficient to study effects like the influence of rod position and assembly corners on heat transfer.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Modeling a Single 19-Rod bundle</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tOne 19-rod bundle was modeled to be able to predict accurately: 1. Local heat transfer qualities (in terms of rod specific Nusselt numbers), and 2. Hot spot temperatures at contact zones. The bundle consists of 19 rods with a diameter of 9.6 millimeters and a length of 0.18 meters representing a single coil of the wires. The rods are wrapped with 1 millimeter diameter wires in a spiral pattern at a 1.11 rod diameter pitch to maintain rod spacing.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-Rod-Bundle-800x497.png\" alt=\"19-rod bundle with spacing wires\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 1: 19-rod bundle with spacing wires\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe wrapped wires are in contact with one rod and result in a 0.1 millimeter gap to adjacent rods. Obtaining accurate CFD results requires capturing the complex geometry of the interaction between the rods and the wrapped wires with a very controlled mesh near the boundary walls to capture the physics. ANSYS CFX solver and Pointwise meshing were used to generate accurate CFD results.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<blockquote class=\"blockquote text-center pw-blue\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;Because of sensitivity to heat transfer, the contact regions between wires and rods need to be modeled as accurately as possible.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"><cite title=\"Michael B&ouml;ttcher, Karlsruhe Institute of Technology (KIT)\">Michael B&ouml;ttcher, Karlsruhe Institute of Technology (KIT)</cite></footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<h2>Meshing the 19-Rod Bundle</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAccurate capture of the heat transfer quantities required precise boundary layer definitions with high-quality cells. The initial layer spacing from the wall was 0.001 millimeters at the contact areas between the rods and the wrapped wire and 0.005 millimeters on the non-contact areas of the rods and wires. Four boundary layers were created through simple extrusion from the first layer. Ten more boundary layers were created using the T-Rex meshing. The remainder of the volume was meshed with hex-dominant unstructured meshing.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe first challenge was handling the contact between the rods and the spirally wrapped wires. Two solution approaches to this challenge were used. The first approach used a small gap of 0.01 millimeters for a contact zone, which was modeled as wrapped wire material. The second approach was to have an unmodified contact line between the wrapped wires and the rods and to use a spiral type prismatic block extrusion using adjacent grids as boundaries. The second approach required non-default parameters to the extrusion meshing process. Both approaches resulted in locally poor angles that were acceptable to ANSYS CFX but might not be acceptable to other CFD solvers.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig2-Contact-Area-800x497.png\" alt=\"Contact area modeled with spiral extrusion block\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 2: Contact area modeled with spiral extrusion block\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe second challenge was dealing with the 0.1 millimeter gap between the wrapped wires and the adjacent rods. Under standard operating conditions, this could be handled well with the general meshing approach. However, special consideration had to be given to high-temperature accident conditions that would result in the closure of this gap. A full structured mesh approach in the contact zones was used. The boundaries of the structured mesh region were determined by\r\n\t\t\t\t</p>\r\n                    <ol>\r\n\t\t\t\t\t<li>projecting the wire geometry past the rod</li>\r\n\t\t\t\t\t<li>calculating the intersection of the projected wire geometry with the rod</li>\r\n\t\t\t\t\t<li>projecting the intersection curves back past the wire</li>\r\n\t\t\t\t\t<li>and calculating the intersection of the projected rod intersection geometry with the wire.</li>\r\n\t\t\t\t\t</ol>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig3-Gap-Closure-800x480.png\" alt=\"Structured block for gap closure\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 3: Structured block for gap closure\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe third challenge was related to addressing the importance of conjugate heat transfer in the rods. Two variants of the model were used to determine the impact of conjugate heat transfer. The first variant used hollow rods with a constant heat flux at the rod surface. The second variant used a solid extrusion mesh for the rods and included the conjugate heat transfer.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe meshing strategy used resulted in a high-quality mesh with 107 million cells.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig4-Quality-Mesh-800x480.png\" alt=\"107 million cell high-quality mesh of the 19-rod bundle\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 4: 107 million cell high-quality mesh of the 19-rod bundle\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<h2>Preparing the CFD Solution</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe appropriate CFD solutions attributes were defined for ANSYS CFX\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Inlet Boundary Conditions\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Three Cartesian velocity components (taken from unheated simulation)</li>\r\n\t\t\t\t\t\t\t<li>1 percent turbulence intensity </li>\r\n\t\t\t\t\t\t\t<li>Constant temperature (623 K)</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Outlet Boundary Conditions\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Averaged relative pressure at 0 Pa</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Rod Material\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Steel for full rod variant</li>\r\n\t\t\t\t\t\t\t<li>Hollow rods heat flux of 106 W/m2 scaled by Reynolds Number</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Wire Material\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Steel</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Assembly wall specification\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Adiabatic walls</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Coolant\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Sodium with temperature-dependent material properties</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Discretization\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Higher-order method</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Physics models\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>ω RS turbulence model</li>\r\n\t\t\t\t\t\t\t<li>Turbulent heat transfer adjusted to liquid metal conditions (non-default turbulent Prandtl number)</li>\r\n\t\t\t\t\t\t\t<li>Steady-state</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ul>\r\n\r\n\t\t\t\t<h2>Reviewing the CFD Solution</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe ANSYS CFX solution converged efficiently and produced accurate results for the heat transfer quantities of interest and the hot-spot local temperatures.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe resulting flow was a highly turbulent swirling flow with velocities in the off-axial directions at up to 40 percent of the velocities in the axial direction.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe average rod Nusselt Numbers from the ANSYS CFX solution were compared to two empirical approaches (Mikityuk, Subbotin) that can be found in the literature. The calculated results were in between the two empirical techniques at various Reynolds Numbers. The benefit of the simulation was the ability to determine rod specific Nusselt Numbers with the highest heat transfer found in the central position.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe rod bundle temperature distribution indicated that the hot spot temperature increase using hollow rods was up to 15 degrees Kelvin. The conjugate heat transfer is only of influence close to the touching regions and reduces the hot spot temperature increase to 13 degrees Kelvin.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig5-Temp-Distributions-800x480.png\" alt=\"107 million cell high-quality mesh of the 19-rod bundle\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFigure 5: 19-rod bundle temperature distributions\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<h2>Pointwise Meshing Techniques Meet the Challenge</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAccurate fluid flow modeling of nuclear reactor bundles is essential and extremely challenging with exacting standards for the mesh to deal with the geometric complexity and near-wall physics. The tightly packed rods with wrapped wires that contact the rods provide a challenging geometry into which well-defined boundary layers need to be inserted to capture the local physics accurately. Multiple Pointwise structured meshing techniques were used at the boundaries with hex-dominant unstructured meshing away from the boundaries to successfully meet the meshing challenge and produce accurate fluid flow modeling of a 19-rod nuclear reactor bundle.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor more information about how KIT has leveraged Pointwise meshing to enable accurate CFD solutions of a 19-rod bundle, check out the recording of Michael B&ouml;ttcher's presentation entitled \"<a href=\"https://info.pointwise.com/development-cfd-wrapped-wire-rod-bundle-sodium-flow\">Development of a CFD Wrapped Wire Rod Bundle Model in Sodium Flow</a>.\"\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h3>Acknowledgement</h3>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThis work is supported by the European Union within the SESAME project under Grant Agreement number 654935.\r\n\t\t\t\t</p>","__v":0}
{"_id":{"$oid":"5faad78404d997423c0ac57a"},"title":"Pointwise and the Evolution of Faster, Easier, More Reliable Automated Meshing","abstract":"Generating high-quality automated meshes for CFD analysis has been an industry goal for more than 30 years. Meshing solution developers have spent much of those years trying to create user-independent solutions, only to be stymied by the inherent complexities of geometry models, the mesh, and the CFD solution. Pointwise researchers have made tremendous strides in this area lately by building on the work of others over the last three decades. As a result, they expect to release several new features very soon that will help make automated meshing a reality. Find out more about these latest advances.","postDate":{"$date":"2020-02-25T00:00:00Z"},"imgUrl":"Solution-Complexity-3840x1200.png","imgAltText":"Automatically generated mesh after three user-independent iterations of mesh adaptation.","author":"by Nick Wyman<br>Directory of Applied Research<br>Pointwise, Inc.","clientName":"","clientLogo":" ","clientSinceHead":"","clientSince":"","clientAboutHead":" ","clientAbout":" ","challenge":"Generating high-quality automated meshes for CFD analysis is difficult for three reasons: the geometry models upon which the mesh is built are complex, the mesh has numerous quality constraints, and it must resolve flowfield features that are unknown at the time the mesh is created.","solution":"The ultimate goal at Pointwise is to deliver user-independent solutions freeing users from tedious and repetitive work so they can focus on their core objectives. It begins with developing new technologies for automatically generating high-quality meshes.","benefit":"Automated meshing is still under development, so it is difficult to attach concrete statistics. However, in-house testing on a variety of industrial geometries has demonstrated that our automated meshing approach consistently produces high-quality meshes with very little user input.","ymal1Title":"Automatic Unstructured Mesh Generation with Geometry Attribution","ymal1Img":"pw-auto-mesh-ymal1.jpg","ymal1Alt":"Automatic Unstructured Mesh Generation with Geometry Attribution","ymal1Abstract":"Download the technical paper presented at AIAA SciTech 2019 that describes a process that automatically creates unstructured meshes from water-tight geometry input using Glyph scripting. Utilizing this process, one can reduce meshing time by up to 90 percent and manual input from hours to minutes.","ymal1Url":"https://info.pointwise.com/technical-paper-automatic-unstructured-mesh-generation-geometry-attribution","ymal2Title":"High-Order Mesh Generation Using Pointwise","ymal2Img":"pw-auto-mesh-ymal2.png","ymal2Alt":"High-Order Mesh Generation Using Pointwise","ymal2Abstract":"There are two primary challenges associated with the degree elevation of linear elements: boundary conformance and curving of high aspect ratio cells encountered within the boundary layer region. In this webinar, we address these challenges and show how to improve CFD solution accuracy by generating boundary conforming, high-order meshes.","ymal2Url":"https://info.pointwise.com/webinar-high-order-mesh-generation-using-pointwise","ymal3Title":"Reducing Discretization Error with Mesh Adaptation","ymal3Img":"pw-auto-mesh-ymal3.png","ymal3Alt":"Reducing Discretization Error with Mesh Adaptation","ymal3Abstract":"Learn how mesh adaptation can improve CFD solution accuracy. Mesh adaptation can automatically add finer mesh resolution in areas where it is needed by examining an error metric or flow gradients to determine where the existing mesh is not adequately resolving the flow.","ymal3Url":"https://info.pointwise.com/case-study-reducing-discretization-error-mesh-adaptation","gated":false,"caseStudy":"        <p>\r\n          It makes sense to think that our goal at Pointwise is to deliver meshing capabilities that are truly automatic, and we are indeed working on that. But our vision goes beyond automated meshing: we want to make it possible to run automatic <em>solutions</em> requiring no user input or interactions from start to finish. Imagine being able to generate accurate CFD solutions with little or no work. You can focus more on your core objectives instead of wasting time on the tedious, repetitive tasks involved in generating accurate CFD solutions – and you can generate them faster. The Pointwise research team, with significant contributions from others throughout the company and industry, is making great strides towards this goal. Here is a preview of some of our latest advances. \r\n        </p>\r\n\r\n        <blockquote class=\"blockquote text-center pw-blue\">\r\n          <p class=\"mb-0\">&ldquo;Any sufficiently advanced technology is equivalent to magic.&rdquo;</p>\r\n          <footer class=\"blockquote-footer\"><cite title=\"Source Title\"> Arthur C. Clarke, Author</cite></footer>\r\n        </blockquote>\r\n\r\n        <h2>It is All About the Complexity</h2>\r\n\r\n        <p>\r\n          Users have been asking for automated meshing capabilities for more than 30 years now. One would think we could have accomplished this by now.  It is a gross understatement, however, to say that the combined complexities of the model, mesh, and solution make it extremely difficult. In fact, the new Pointwise features and technology we are using to address these challenges are built upon more than 30 years of research and development.\r\n        </p>\r\n      \r\n        <h2>Model Complexity</h2>\r\n\r\n        <p>\r\n          Let me start with the geometry models that meshes are built on. The complexity begins with things such as large configuration management and the need to deal with repetitive geometry and moving bodies. \r\n        </p>\r\n\r\n        <p>\r\n          Pointwise has already gone to great lengths to address model complexity by supporting a variety of analytic and faceted models. We once thought that faceted models were going away, but we are actually seeing more and more hybrid models. This might be due to the user’s need to integrate or retrofit a legacy aircraft with a new design. There also may be cases where geometry models cannot be shared with other teams or organizations and, as a result, you end up dealing with legacy or scanned data. While Pointwise does work with this data, it can be problematic. This is especially true when the CFD drops below the faceted model resolution. You also have the problem of faceted normal discontinuities preventing us from doing nice things like curved meshing.\r\n        </p>\r\n\r\n        <h3>Solution: Faceted Geometry Fitting</h3>\r\n\r\n        <p>\r\n          A future release of Pointwise will feature a new optimization technique, developed by Professor John Dannenhoffer at Syracuse University, enabling Pointwise to convert faceted models to analytic geometry. \r\n        </p>\r\n\r\n        <h2>Model Complexity and Configuration Management</h2>\r\n\r\n        <p>\r\n          Configuration management has created a significant cognitive load for end users. It is hard enough to make a mesh on a single part, but now users must bring component parts together to form large complex assemblies, many of which involve motion, making it tricky to get everything correct.\r\n        </p>\r\n\r\n        <h3>Solution: Pointwise Frameworks</h3>\r\n\r\n        <p> \r\n          As part of a US Air Force project we recently completed, we have added a new feature to our 18.2 version called Pointwise Frameworks. The simplest way to explain it is that it is a sandbox for a component grid and geometry. We put the frameworks into a hierarchical structure, allowing users to naturally build complex component assemblies. We also designed it so that each framework can have its own local coordinate system, making things much easier on the user. Attachment points defined within the local coordinate system of each framework allow users to quickly build configurations with the confidence that they are building the configuration correctly. We also added lightweight component instancing to help with repetitive geometry.\r\n        </p>\r\n\r\n        <h2>Meshing Complexity</h2>\r\n\r\n        <p>\r\n          The mesh itself is subject to a number of quality constraints, such as smoothness, forcing us to perform repetitive and tedious work before we can pass it along for solution. Then, when we get to the solution, we have even more complexities because accuracy is a function of the mesh, and the local solution and the mesh must be able to resolve flowfield features that are not known at the time the mesh is created.  \r\n        </p>\r\n\r\n        <h3>Solution: Quilts</h3>\r\n\r\n        <p>\r\n          At Pointwise, we believe surface meshing can be automated using edge-based rules that drive mesh topology and density. However, structured meshes are over-constrained and CAD surface topologies can be problematic. We are developing a tool that uses quasi-structured meshing and a relatively new higher-level CAD topology entity called a &ldquo;quilt&rdquo; to enable edge-based rules. A quilt is defined as a collection of slope continuous surfaces within a model. The process involves a couple of steps. When we assemble a solid model, which is a collection of NURBS (non-uniform rational basis spline) surfaces, we can see how different patches fit together to form a water-tight solid. Although the model has edges, we do not apply automated edge-based rules to this collection of facets and their boundaries. The rules are actually applied to the quilt that is placed above the model in the topology chain and assume that all of the edges within each solid color on the quilt are smooth. \r\n        </p>\r\n\r\n        <h2>Flow Complexity</h2>\r\n\r\n        <p>\r\n          As mentioned earlier, the flow solution is unknown when we start our meshing process. The challenge is that simulation accuracy is a function of the mesh and local solution gradients. To enable a user-independent simulation, therefore, we must go with mesh adaptation. Mesh adaptation must occur in the volume and at the surface, so access to CAD becomes a requirement. As a result, we have taken a multi-solution approach to these challenges.\r\n        </p>\r\n\r\n        <h3>Solution I: Geometry-mesh Associativity</h3>\r\n\r\n        <p>\r\n          Geometry-mesh associativity relates CAD topology to mesh topology. We are presently working with NASA and the US Air Force to define a geometry and mesh associativity data schema. We can then develop a library to work with that schema independently of Pointwise. This combination will give you the geometry and the mesh, as well as describe how they work together. \r\n        </p>\r\n\r\n        <p>\r\n          What do I mean by geometry mesh associativity? Can you just send the geometry with it? Well, only in the crudest sense. What you really want to know is the mesh topology, or how the mesh curves map to the geometry. The connectors and domains in Pointwise map explicitly to the geometry model, giving you the robustness that you need for user-independent mesh adaptation. For instance, if your solution directs you to refine a connector on a wing tip, you have to make sure all the new points you insert lie on the string of geometry curves that define that location in space. By including information in the geometry model that describes the points and edges on the curves and faces in the surface, we are able to save the user quite a bit of time without sacrificing the accuracy of the solution. \r\n        </p>\r\n\r\n        <h3>Solution II: <em>HP</em> Mesh Adaptation</h3>\r\n\r\n        <p>\r\n          Solution accuracy can be attained most efficiently utilizing <em>h-p</em> mesh adaptation. In other words, we use either <em>h-</em> or <em>p-</em>refinement, depending on the geometry and solution. With <em>h-</em>refinement, we re-mesh based on the solution information. This requires the mesh, geometry, and solution to identify locations where the mesh is coarse and the solution gradient is high. These are the areas we want to make the mesh finer. We use the size field technique for this because it only requires a cloud of points. With <em>p-</em>refinement, we elevate the solution order of accuracy. At the mesh level, this requires adding extra grid points on element edges and faces, which again have to be associated with the geometry to ensure an accurate representation. This technique is incorporated into Pointwise Staff Specialist, Dr. Steve Karman’s project, called <em>hp-</em>CurveMesh, which looks at the solution and wherever the solution and the geometry are smooth, does order elevation locally.\r\n        </p>\r\n\r\n        <p>\r\n          Another use of mesh link technology is a GeomToMesh developed as well by Karman. Karman is working to expand this into what we call HP-curve mesh, which looks at the solution and wherever the solution and the geometry are smooth, we do order elevation locally. Conversely, wherever the geometry and or solution is discontinuous we do h-refinement locally, both of which require the geometry. We have been asked what the computational times are for these features, but we do not have enough data yet. We do think that HP mesh adaptation will create huge gains in the performance of high order solutions because we are attacking the problem in the most efficient way: locally. \r\n        </p>\r\n\r\n        <h3>Solution III: Multi-disciplinary Analysis Optimization</h3>\r\n\r\n        <p>\r\n          We have been working with Bob Haimes at MIT to bring EGADS (Engineering Geometry Aircraft Design System) geometry into Pointwise to automatically generate meshes based on attribution. Even more interesting, we are working on sending information back to EGADS. Basically, Haimes and his colleagues are trying to solve an optimization problem for the conservative fitting of the data when interpolating data from one mesh to another. In short, you want to make sure that the integrated conservative qualities are matching as closely as possible through optimization. They have done a lot of work to support a wide variety of discrimination schemes, both continuous and discontinuous and higher order. \r\n        </p>\r\n\r\n        <h2>For More Information</h2>\r\n\r\n        <p>\r\n          As you can see, automated meshing is improving almost exponentially. It is so gratifying to see us all working together to deliver faster, easier, and more reliable automated meshing. For example, Karman comes up with a new case almost daily that works without the user present. That frequently happens because folks throughout the company regularly send geometries to Karman with a note to &ldquo;try this.&rdquo; I am constantly astonished by our crew’s dedication and teamwork that takes place here at Pointwise every day. As a result, we expect to make it possible for you to integrate meshing and linked geometry into your workflow process in the very near future. It an exciting time.\r\n        </p>\r\n\r\n        <p>\r\n          I invite you to take a closer look at our latest technical advances. Check out <a href=\"https://info.pointwise.com/recent-developments-pointwise-applied-research\">this video from the Pointwise User Group Meeting</a> that goes into details about the above work Pointwise is doing.\r\n        </p>\r\n\r\n        <div class=\"cta-space text-center\">\r\n            <!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-8cd7cc09-4de7-4520-b21e-41d8201eb1fd\"><span class=\"hs-cta-node hs-cta-8cd7cc09-4de7-4520-b21e-41d8201eb1fd\" id=\"hs-cta-8cd7cc09-4de7-4520-b21e-41d8201eb1fd\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]--><a href=\"https://cta-redirect.hubspot.com/cta/redirect/3788790/8cd7cc09-4de7-4520-b21e-41d8201eb1fd\" ><img class=\"hs-cta-img\" id=\"hs-cta-img-8cd7cc09-4de7-4520-b21e-41d8201eb1fd\" style=\"border-width:0px;\" src=\"https://no-cache.hubspot.com/cta/default/3788790/8cd7cc09-4de7-4520-b21e-41d8201eb1fd.png\"  alt=\"Watch Now\"/></a></span><script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script><script type=\"text/javascript\"> hbspt.cta.load(3788790, '8cd7cc09-4de7-4520-b21e-41d8201eb1fd', {}); </script></span><!-- end HubSpot Call-to-Action Code -->\r\n          </div>","__v":0}
{"_id":{"$oid":"5faaec5304d997423c0ac57b"},"title":"Application of Pointwise T-Rex Meshing and CFD Modeling to the Analysis of Supercritical Carbon Dioxide (S-CO2) Power Cycles","abstract":"A team of engineers at CRAFT Tech set out to model an experimental supercritical carbon dioxide (S-CO2) compressor configuration. The engineers needed software that would resolve flow gradients with a minimum number of grid points and be flexible enough to provide the best grid for each region of the machine that they were modeling. They found both these solutions in Pointwise.","postDate":{"$date":"2020-03-10T00:00:00Z"},"imgUrl":"Compressor-3840x1200.png","imgAltText":"CRAFT Tech developed T-Rex unstructured meshes to model the impeller and diffuser sections of a supercritical carbon dioxide compressor.","author":"","clientName":"Combustion Research and Flow Technology, Inc. (CRAFT Tech)","clientLogo":"craft-tech-logo-400x177.png","clientSinceHead":"Partner Since","clientSince":"Over 20 Years","clientAboutHead":"About the Partner","clientAbout":"Combustion Research and Flow Technology, Inc. (CRAFT Tech), based in Pipersville PA, specializes in high-fidelity computational fluid dynamics simulation of complex flow and combustion problems.","challenge":"Interest has increased in the S-CO2 Brayton cycle for new efficient power systems, but the ability to analyze these systems at off-design conditions is lacking. The complex analysis requires modeling of flow transitioning between liquid and gas phases with high-resolution meshing.","solution":"Pointwise provided the high-quality meshes needed for high-resolution analyses of supercritical CO2 cycle machines using multi-species/multi-phase flow solvers to resolve the complex physics.","benefit":"Pointwise’s T-Rex meshing resolved the flow gradients with a minimum number of grid points – in this case, 1.5 million or fewer cells – to speed up the solution.","ymal1Title":"The Influence of Meshing Strategies on Simulation Efficiency","ymal1Img":"craft-ymal1.png","ymal1Alt":"A hybrid mesh for the PPTC geometry","ymal1Abstract":"Watch this on-demand webinar that will help you determine the best type of mesh to use for the fastest and most accurate CFD simulations.","ymal1Url":"https://info.pointwise.com/webinar_best_mesh_strategy_ondemand","ymal2Title":"Mesh Topology Influence on Volute Aerodynamic Performance Computed Using Code Leo","ymal2Img":"craft-ymal2.png","ymal2Alt":"(from back to front): fully structured (hexahedral), unstructured with extruded hexahedral boundary layer, and unstructured with extruded prismatic boundary layer","ymal2Abstract":"Three meshes (multi-block structured and unstructured with hexahedral and prismatic boundary layers) were generated for a generic volute and simulations were performed in the Code Leo CFD solver. Meshing time, solution time, and solution accuracy are compared.","ymal2Url":"https://info.pointwise.com/webinar-mesh-influence-aerodynamic-performance","ymal3Title":"CFD Analysis of Cavitation and Acoustics of a High Energy Water Injection Pump","ymal3Img":"craft-ymal3.png","ymal3Alt":"Hybrid meshing coupled with complex multi-phase cavitation models and interactive post-processing of a high energy water injection pump.","ymal3Abstract":"Pointwise can easily manage and organize complex assemblies so you can focus on meshing a single component at a time. This allows engineers to rapidly generate high quality hybrid grids while maintaining the connectivity between adjacent components. ","ymal3Url":"https://info.pointwise.com/webinar-simulation-injection-pump-cavitation","gated":true,"caseStudy":"\t\t\t\t<p>\r\n\t\t\t\t\tIn 2018, a team of engineers at Combustion Research and Flow Technology, Inc. (CRAFT Tech) set out to model an experimental supercritical carbon dioxide compressor configuration. The analysis, which would provide important insights into the design of high-efficiency components for power generation, required modeling of flow transitioning between liquid and gas phases and high-resolution meshing of geometries.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tCRAFT Tech needed a solution that would resolve flow gradients with a minimum number of grid points and be flexible enough to provide the best grid for each region of the machine that they were modeling. They found both these solutions in Pointwise.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Background</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tSupercritical carbon dioxide (S-CO<sub>2</sub>) is a fluid state of carbon dioxide (CO<sub>2</sub>) in which it is heated and held at or above its critical temperature and pressure. In this supercritical phase, carbon dioxide exhibits properties and behaviors between that of a liquid and a gas. In particular, supercritical CO<sub>2</sub> possesses liquid-like densities with gas-like diffusivity, surface tension, and viscosity.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tBecause it has gas-like behavior but liquid-like density, systems using supercritical CO<sub>2</sub> as the working fluid can be extremely compact and are valuable to the design of high-efficiency components for uses including power generation. Sandia National Laboratories, for example, is researching a thermal-to-electric power conversion technology in a &ldquo;recompression closed Brayton cycle&rdquo; (RCBC) configuration that uses supercritical carbon dioxide, rather than steam, as the working fluid, thereby dramatically increasing conversion efficiency when compared to the steam Rankine cycle [<a href=\"#ref1\" class=\"page-scroll\">Ref 1</a>].\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe S-CO<sub>2</sub> power cycle can be applied to many types of thermal sources. Advantages over conventional steam Rankine systems include very compact size and greater efficiency at moderate temperatures.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-Power-Cycle-800x628.png\" alt=\"S-CO2 power cycle\"\r\n\t\t\t\t\tclass=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tThe S-CO<sub>2</sub> power cycle can be applied to many types of thermal sources. Advantages over conventional steam Rankine systems include very compact size and greater efficiency at moderate temperatures.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe primary reason for improved power conversion efficiency is simply that the use of S-CO<sub>2</sub> as the working fluid in a Brayton cycle requires less work to convert a given thermal input to electricity. In general, increased efficiency represents increased output for the same thermal input, regardless of the thermal source (such as natural gas, nuclear, solar, or coal). Where fuel costs are a significant portion of overall costs (coal and natural gas-fired plants), the benefit is reduced fuel costs. Where capital investments are high (nuclear and concentrating solar power), the benefit is increased output for the initial investment.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tBefore the benefits of S-CO<sub>2</sub> Brayton can be realized, however, it must be shown to be ready and reliable. In concert with the Department of Energy, Sandia has been supporting research and development to deliver a technology that is ready for commercialization.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Goals of Research</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tIn 2018, CRAFT Tech modeled an experimental S-CO<sub>2</sub> compressor configuration that was tested at Sandia. Their goal was to develop an advanced real-fluid numerical framework for modeling trans-critical CO2 spanning both supercritical and sub-critical regimes [<a href=\"#ref2\" class=\"page-scroll\">Ref 2</a>].  Highlights of this work were presented by CRAFT Tech’s Jeremy Shipman at the 2018 Pointwise User Group meeting.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe motivation for CRAFT Tech’s research was the need for analysis capability not just for supercritical carbon dioxide under design conditions, but also for off-design conditions that result in a subcritical regime. The research required modeling of flow transitioning between liquid and gas phases and high-resolution meshing of geometries.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig2-High-Res-Grid-800x800.png\" alt=\"high resolution grid\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tHigh resolution areas of the grid include 1: blade leading edges, 2: fillet features at the hub, and 3: the tip gap clearance between the blade tip and the shroud.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tCRAFT Tech explored three areas that are subject to subcritical operations: Solar thermal applications (where temperature drops can result in fluid in the subcritical regime); start-up circumstances where temperature and pressure have not yet worked up to full design conditions; and situations where contaminants such as water impact the performance of the system.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise’s computational fluid dynamics (CFD) mesh generation software was crucial to CRAFT Tech’s work. The software allows the use of regular hexahedra instead of unstructured tetrahedra in regions away from the geometry model, and its T-Rex (anisotropic tetrahedral extrusion) technique generates layers of hexahedra or prisms near the geometry model for boundary layer resolution. Use of regular hexahedra elsewhere in the mesh can improve the CFD flow solver’s rate of convergence and accuracy of the resulting solution. An added benefit is a potential reduction in overall cell count.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor this project, CRAFT Tech used the software to develop T-Rex unstructured meshes to model the compressor impeller and diffuser sections. Pointwise’s high-quality meshing solutions helped them resolve flow gradients with a minimum number of grid points to speed the solution. Secondarily, using mixed grid types provided more efficiency by allowing them to match the best type of grid to each region of the machine to be modeled.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe numerical framework that CRAFT Tech’s team developed in the CRUNCH CFD unstructured solver allowed analysis in a broad range of subcritical operating conditions and fluid phase change compositions, including accounting for water, carbon dioxide, and other contaminants. Shipman cites the following as being highlights of the analysis:\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<ol>\r\n\t\t\t\t\t<li>Providing versatile thermodynamics:\r\n\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t<li>Matrices retain thermodynamic derivatives in generalized form</li>\r\n\t\t\t\t\t\t<li>Allows specification of generalized equation of state (EOS routines) without modifying the code numerical formulation</li>\r\n\t\t\t\t\t\t<li>Preconditioning to robustly solve for large gradients in density and Mach number that appear near the critical point and phase change boundaries</li>\r\n\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Ensuring the framework extends to multi-species & phases\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>To model finite rate-phase change, liquid or vapor species transport are solved separately </li>\r\n\t\t\t\t\t\t\t<li>The model is extendable to additional contaminant species such as water and carbon dioxide</li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>Providing two different ways to do the specification: EOS and Thermodynamic Property Specification\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>Specified through analytic formulations (e.g. SRK) </li>\r\n\t\t\t\t\t\t\t<li>Specified via NIST Table look-up </li>\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ol>\r\n\r\n\t\t\t\t<h2>The Process</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe CRAFT Tech team applied the framework to a Sandia Lab S-CO<sub>2</sub> compressor with a motor-driven centrifugal impeller and diffuser housing. The component included a straight inflow with a radial diffuser with a volume and exit pipe. The impeller is extremely small – only 1.5 inch in diameter, with a tip clearance of .01 inch. In addition, under the design conditions, it operates at a tremendous rotational velocity of up to 75,000 RPM. The inlet condition under design is just above the critical point (slightly supercritical). For the CFD model, the team looked only at the impeller, inlet pipe, and diffuser.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig3-Sim-Results-800x361.png\" alt=\"simulation results\"\r\n\t\t\t\t\t class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tSimulation results for off-design start-up conditions show two-phase flow surrounding the blade leading edge that condenses back to all liquid as the pressure rises through the compressor.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tGenerating a T-Rex grid for the impeller involved complicated geometry because there is both a primary blade and a splitter blade with a vane diffuser. The team was able to generate an extremely high-quality T-Rex grid of 1.5 million or fewer cells with only one periodic blade passage.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe key steps to the meshing process were as follows:\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<ol>\r\n\t\t\t\t\t<li>Start with structured domains on the primary and splitter blades. </li>\r\n\t\t\t\t\t<li>Apply unstructured domains to the shroud and hub surfaces.</li>\r\n\t\t\t\t\t<li>Because the compressor included a false shroud, Shipman noted the structured, hexahedral grid at the tip gap created by cylindrically extruding the tip surface grid outward to the shroud. Modeling that that tip gap is crucial, he says.</li>\r\n\t\t\t\t\t<li>Run the T-Rex solver to extrude unstructured hexahedra off the remainder of the blade surfaces.</li>\r\n\t\t\t\t\t<li>Finally, structured blocks are added for the inlet and the diffuser sections.</li>\r\n\t\t\t\t</ol>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAchieving good resolution at the leading edge of the blades was crucial, says Shipman, because &ldquo;in off-design conditions, that's where all of the action happens in terms of phase change.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe team validated the model with strong results under a range of phase change conditions, including supercritical inlet; subcritical 2-phase inlet; subcritical compressed liquid; and subcritical vapor inlet. The overall meshing process was greatly simplified by Pointwise’s meshing solutions, says Shipman. &ldquo;When we were doing cases like this long ago, the process was very painful. Lately it’s been much easier to make these grids with the various features that are in Pointwise.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor more information about how Pointwise provided the high-quality meshes needed for high-resolution analyses of supercritical CO2 cycle machines, watch the video of Jeremy Shipman’s presentation entitled, &ldquo;<a href=\"https://info.pointwise.com/simulation-real-fluid-thermodynamics-supercritical-co2-power-cycles\">Simulation of Real-Fluid Thermodynamics for Application to Supercritical CO2 Power Cycles</a>.&rdquo;\r\n\t\t\t\t</p> \r\n\t<h3>References</h3>\r\n\t\t\t\t<ol>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref1\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tWright, S. A., Radel, R. F., Conboy, T. M., and Rochau, G. E., “Modeling and Experimental Results for Condensing Supercritical CO2 Power Cycles”, SANDIA Report, SAND2010-8840, 2011.\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\t<a id=\"ref2\" class=\"anchor\"></a>\r\n\t\t\t\t\t\tHosangadi, A., Liu, Z., Weathers, T.,  Ahuja, V., Busby, J., \"Modeling Multiphase Effects in CO2 Compressors at Subcritical Inlet Conditions,\" Journal of Engineering for Gas Turbines and Power, Vol. 141, Aug 2019.\r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ol>","__v":0}
{"_id":{"$oid":"5faaf33404d997423c0ac57c"},"title":"Hybrid Meshing Key to Improving CFD Simulation Efficiency | Pointwise Case Study","abstract":"Read the case study, \"Hybrid Meshing Key to Improving CFD Simulation Efficiency,\" which summarizes how a T-Rex hybrid grid showed up to a seven-fold improvement in solution efficiency compared to other approaches in predicting thrust and torque for a marine propeller.","postDate":{"$date":"2019-01-23T00:00:00Z"},"imgUrl":"main-coverage-3840x1200.png","imgAltText":"Several different mesh topologies were compared to determine which offered the best accuracy and shortest overall solution time for the Potsdam Propeller test case.","author":"","clientName":"NAFEMS World Congress 2017","clientLogo":"NAFEMS World Congress 2017","clientSinceHead":"Participating Since","clientSince":"2017","clientAboutHead":"About the Event","clientAbout":"The NAFEMS World Congress is the only event dedicated to showcasing the state-of-the-art and state-of-practice in the simulation world in an impartial forum, open to everyone with an interest in how to benefit most from their use of simulation.","challenge":"Mesh topology can have significant effects on both CFD simulation time and accuracy. Several different mesh topologies were compared to determine which offered the best accuracy and shortest overall solution time for the Potsdam Propeller test case.","solution":"For this propeller test case a hybrid grid with high-aspect ratio hexahedra in the boundary layer and isotropic tetrahedral cells in the far field produced the most accurate solution and did it in the least amount of time.","benefit":"T-Rex hybrid grid gained 7x efficiency predicting thrust and torque for a marine propeller.","ymal1Title":"The Influence of Meshing Strategies on Simulation Efficiency","ymal1Img":"efficiency-ymal1.png","ymal1Alt":"The Influence of Meshing Strategies on Simulation Efficiency","ymal1Abstract":"Watch this on-demand webinar that will help you determine the best type of mesh to use for the fastest and most accurate CFD simulations.","ymal1Url":"https://info.pointwise.com/webinar_best_mesh_strategy_ondemand","ymal2Title":"Meshing the Potsdam Propeller Test Case (PPTC) in Pointwise","ymal2Img":"efficiency-ymal2.png","ymal2Alt":"Meshing the Potsdam Propeller Test Case (PPTC) in Pointwise","ymal2Abstract":"The Potsdam Propeller Test Case (PPTC) is a benchmark case used for assessing the accuracy of existing computer codes and modeling strategies in simulating hydrodynamic propeller performance. The controllable pitch propeller design was tested at several different conditions and has a wealth of experimental data for CFD validation.","ymal2Url":"https://info.pointwise.com/webinar-meshing-potsdam-propeller-test-case-pptc","ymal3Title":"Mesh Topology Influence on Volute Aerodynamic Performance Computed Using Code Leo","ymal3Img":"efficiency-ymal3.png","ymal3Alt":"Mesh Topology Influence on Volute Aerodynamic Performance Computed Using Code Leo","ymal3Abstract":"Three meshes (multi-block structured and unstructured with hexahedral and prismatic boundary layers) were generated for a generic volute and simulations were performed in the Code Leo CFD solver. Meshing time, solution time, and solution accuracy are compared.","ymal3Url":"https://info.pointwise.com/webinar-mesh-influence-aerodynamic-performance","gated":false,"caseStudy":"        <p>\r\n          When most people think about efficiency in completing a task, they think about speed. But when CFD (computational fluid dynamics) engineers think about efficiency, they understand there is a vital second component – solution accuracy. A CFD simulation solution achieved quickly is not efficient if it is not accurate. It is the much-sought-after combination of speed and accuracy that results in true efficiency.\r\n        </p>\r\n\r\n        <p>\r\n          Determining how CFD engineers can best improve simulation efficiency is the focus of &ldquo;<em>A Study on the Influence of Meshing Strategies on CFD Simulation Efficiency</em>,&rdquo; a heavily-illustrated 39-page conference paper co-authored by Travis Carrigan, manager of technical sales at Fort Worth, Texas-based Pointwise, Inc. The paper was presented at the 2017 NAFEMS World Congress.\r\n        </p>\r\n\r\n        <p>\r\n          For the paper, Carrigan and co-author Faranggis Bagheri, managing director at neptech, generated CFD solutions for computing the torque and thrust coefficients of the benchmark Potsdam Propeller Test Case (PPTC) geometry -- a highly three-dimensional, variable pitch propeller consisting of five blades. Both hybrid and multi-block structured overset meshes were generated to achieve the CFD solutions. The result was that a hybrid mesh could be generated and a CFD solution achieved in little more than 2.5 hours, whereas a multi-block structured overset mesh and resulting solution took more than 33 hours. Furthermore, the hybrid solution was more accurate. \r\n        </p>\r\n\r\n        <img data-src=\"images/Fig1-800x555.png\"\r\n        alt=\"The Potsdam Propeller test case geometry is an extensively tested ship propeller model.\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 1 - The Potsdam Propeller test case geometry is an extensively tested ship propeller model.\r\n        </figcaption>\r\n\r\n        <p>\r\n          The hybrid mesh resulted in a reduction of the overall number of cells, higher cell quality, and boundary-aligned hexahedra near wall boundaries, all of which contributed to a significantly shorter simulation time and improved solution accuracy when compared with the other meshing strategies.\r\n        </p>\r\n\r\n        <p>\r\n          While the hybrid hexahedra/tetrahedra meshing strategy was the most efficient, Carrigan cautioned that this result does not imply that hybrid meshing is the most appropriate for any simulation. Each mesh generated and each simulation performed may favor one strategy over another. In fact, the PPTC study demonstrated that efficiency can vary even for the same mesh and the same simulation depending on the engineering metric of interest. \r\n        </p>\r\n\r\n        <img data-src=\"images/Fig2-800x600.png\"\r\n        alt=\"A hybrid hexahedral/tetrahedral mesh proved to be the most efficient in terms of accuracy and time for this case.\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 2 - A hybrid hexahedral/tetrahedral mesh proved to be the most efficient in terms of accuracy and time for this case.\r\n        </figcaption>\r\n\r\n        <p>\r\n          For engineers focused on CFD simulation efficiency in industries as varied as marine, aerospace, wind energy, automotive, and bio-medical, Pointwise, Inc. offers an effective software meshing solution. The company is a leader in mesh generation, covering all of preprocessing from geometry model import to flow solver export. \r\n        </p>\r\n\r\n        <p>\r\n          As an all-in-one grid generation solution, Pointwise software features multi-block structured, overset and hybrid meshing techniques. &ldquo;Historically, multi-block structured meshing techniques are often used in the turbo-machinery and marine industries for rotating machinery geometries, but little work has been done to compare the performance of other meshing techniques for a marine propeller,&rdquo; Carrigan said when asked about the motivation behind his conference paper. &ldquo;Due to its versatility, Pointwise software allows CFD engineers to compare and contrast the effectiveness of other meshing strategies to determine which improves simulation efficiency to the greatest extent.&rdquo;\r\n        </p>\r\n\r\n        <p>\r\n          Of particular note are the hybrid meshing techniques available in Pointwise software, which offer several advantages when generating both surface and volume meshes. These advantages include native CAD import, anisotropic stretching, and mixing of both structured and unstructured block topologies.\r\n        </p>\r\n\r\n        <p>When studying marine propellers and other complex geometries, CFD engineers benefit from many Pointwise features, including: </p>\r\n\r\n        <ul>\r\n          <li>Native CAD import and solid modeling, which eases reliable interaction with the native CAD file and prepares it for surface meshing; </li>\r\n          <li>Anisotropic meshing, which reduces cell count by packing cells normal to areas of high curvature;</li>\r\n          <li>T-Rex, an advancing layer technique which automates hybrid viscous meshing for complex geometries;</li>\r\n          <li>Overset, which allows overlapping grids to be constructed to reduce the burden of conformal multi-block structured meshing; and</li>\r\n          <li>CAE solver export, which specifies both boundary and volume conditions for completed grids and export to any CFD solver format. </li>\r\n        </ul>\r\n\r\n        <p>\r\n          &ldquo;Perhaps the biggest benefit of using Pointwise software, however, is its ability to reliably generate hybrid viscous meshes for arbitrarily complex geometries,&rdquo; Carrigan said.\r\n        </p>\r\n\r\n        <p>\r\n          Based on the impressive PPTC results from this work, it is clear that hybrid meshing is a viable alternative to multi-block structured and overset meshing and, in many cases, may be the better solution. “Since Pointwise software seamlessly integrates with existing workflows and has demonstrated time and time again the ability to achieve accurate results using hybrid viscous meshing strategies in less time than traditional multi-block structured solutions, CFD engineers in many industries now have a way to greatly improve their simulation efficiency,” Carrigan concluded.\r\n        </p>\r\n\r\n        <p><strong>\r\n          For more information about the benefits of hybrid meshing relative to CFD simulation efficiency:\r\n        </strong></p>\r\n\r\n        <div class=\"cta-space text-center\">\r\n          <!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-8c6fdf6c-49c4-44c3-9571-13a952370d4a\"><span class=\"hs-cta-node hs-cta-8c6fdf6c-49c4-44c3-9571-13a952370d4a\" id=\"hs-cta-8c6fdf6c-49c4-44c3-9571-13a952370d4a\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]--><a href=\"https://cta-redirect.hubspot.com/cta/redirect/3788790/8c6fdf6c-49c4-44c3-9571-13a952370d4a\" ><img class=\"hs-cta-img\" id=\"hs-cta-img-8c6fdf6c-49c4-44c3-9571-13a952370d4a\" style=\"border-width:0px;\" src=\"https://no-cache.hubspot.com/cta/default/3788790/8c6fdf6c-49c4-44c3-9571-13a952370d4a.png\"  alt=\"Watch Now\"/></a></span><script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script><script type=\"text/javascript\"> hbspt.cta.load(3788790, '8c6fdf6c-49c4-44c3-9571-13a952370d4a', {}); </script></span><!-- end HubSpot Call-to-Action Code -->\r\n        </div>","__v":0}
{"_id":{"$oid":"5faaf77a04d997423c0ac57d"},"title":"Using CFD to Help Increase the Safety of Driverless Cars","abstract":"Autonomous vehicles are expected to become a viable form of transportation sometime in the first half of this century. One of the major hurdles will be to provide these cars with the artificial intelligence they need to position themselves in a location where there is less drag for optimal fuel efficiency, travel time, and stability. Ultimately, it should lead to fewer serious accidents and safer roads. Find out how Pointwise is helping researchers in the automotive industry do that.","postDate":{"$date":"2019-07-09T00:00:00Z"},"imgUrl":"driverless-car-3840x1200.png","imgAltText":"vehicle visualization","author":"","clientName":"Cranfield University","clientLogo":"cranfield-logo-200.png","clientSinceHead":"Client Since","clientSince":"Cranfield University has been a Pointwise customer for over twenty years and was Pointwise’s first customer in the United Kingdom","clientAboutHead":"About the Client","clientAbout":"As the UK’s only exclusively postgraduate university, with world-class expertise, large-scale facilities, and unrivalled industry partnerships Cranfield is helping to create leaders in technology and management globally. The university is located about 80 km (50 miles) northwest of London near the town of Milton Keynes.","challenge":"There are many hurdles to clear before driverless cars can be used safely by the general public. One challenge is to provide the artificial intelligence needed to teach driverless cars how to respond safely to changing conditions on the road.","solution":"To do this, engineers must thoroughly understand how road conditions and variables such as the number, type, and distance of other vehicles on the road affect the aerodynamics surrounding a driverless car.","benefit":"It is estimated that 94 percent of all serious car crashes in the United States are caused by driver error. Teaching these driverless cars to position themselves on the road in areas with less drag will help increase fuel efficiency, travel time, and stability. Ultimately, it should lead to fewer serious accidents.","ymal1Title":"Automatic Unstructured Mesh Generation with Geometry Attribution","ymal1Img":"driverless-ymal1.jpg","ymal1Alt":"Dr. Steve Karman at the 2018 Pointwise User Group Meeting","ymal1Abstract":"Watch and download the presentation given by Steve Karman, Pointwise, Inc. at the Pointwise User Group Meeting about how Pointwise used custom Glyph scripts to automatically generate high-quality unstructured meshes for Engineering Sketch Pad (ESP) geometries, saving time and freeing users from repetitive and tedious tasks.","ymal1Url":"https://info.pointwise.com/presentation-automatic-unstructured-mesh-generation-geometry-attribution","ymal2Title":"Localized Remeshing Strategies for Parametric Models in Pointwise","ymal2Img":"driverless-ymal2.png","ymal2Alt":"Various meshed components of the DrivAer benchmark model.","ymal2Abstract":"In this video, we demonstrate a couple of different strategies users can leverage in Pointwise to limit changes to only those localized regions in their computational domain that have been modified from one configuration to the next helping them spend more time focusing on the results of their parametric studies.","ymal2Url":"https://info.pointwise.com/webinar-localized-remeshing-strategies-parametric-models","ymal3Title":"The Stanford Solar Car Project's Race for Aerodynamic Efficiency","ymal3Img":"driverless-ymal3.png","ymal3Alt":"Hybrid volume mesh generated for the vehicle using Pointwise’s T-Rex algorithm.","ymal3Abstract":"The Stanford Solar Car Project team developed a repeatable, simulation driven design framework consisting of Pointwise for rapid hybrid grid generation, SU2 to run the CFD simulations, and Tecplot 360 EX to post-process and interpret the results. ","ymal3Url":"https://info.pointwise.com/webinar-students-race-aerodynamic-efficiency","gated":false,"caseStudy":"\t\t\t\t<h2>First numerical study of its kind provides basis for future CFD studies and ongoing development of AI for autonomous vehicles</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAutonomous vehicles – or driverless cars – are expected to become a viable form of transportation within the first half of this century. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tProponents believe these vehicles can help create a safer driving environment. The National Highway Traffic Safety Administration (NHTSA) estimates that 94 percent of serious car accidents are caused by human error<sup><a href=\"#ref1\" class=\"page-scroll\">1</a></sup>. Considering that more than 35,000 people in the United States were killed in automobile accidents in 2015, the potential for saving lives is tremendous. Less important, but still significant, the NHTSA puts the economic cost of these accidents in the hundreds of billions of dollars each year. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThere are many issues to address and hurdles to clear; however, before safe driverless cars can be safely and widely used.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<blockquote class=\"blockquote text-center pw-blue\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;Self-driving cars are the natural extension of active safety and obviously something we should do.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"><cite title=\"Source Title\">Elon Musk, entrepreneur</cite></footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<h2>Artificial Intelligence and Numerical Studies</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tOne of the first challenges will be to provide the Artificial Intelligence (AI) needed to teach autonomous cars how to respond safely to aerodynamic conditions encountered on real-world roads, which is something human drivers have been responsible for up until now. To do this, engineers must thoroughly understand how road conditions and variables such as the number, type, and distance of other vehicles on the road affect the aerodynamics surrounding a driverless car.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig1-Right-Wind-1000x564.png\"\r\n\t\t\t\talt=\"This CFD visualization illustrates how the subject vehicle is affected by wind on its right side.\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\t\tThis CFD visualization illustrates how the subject vehicle is affected by wind on its right side. In the initial rear position, the vehicle experienced high drag and a destabilizing flow field. The intermediate location improves the fuel or charge consumption and downforce but does not improve vehicle handling. The front position provides the highest economy, safety, and ride comfort. This information, when provided to a driverless car, can help that car make decisions about where it should position itself.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<br>\r\n\t\t\t\t\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;The concept is to teach these vehicles to position themselves on the road in areas with less drag for optimal fuel efficiency, travel time, stability and ultimately for maximum safety,&rdquo; says Khalid Khalil<sup><a href=\"#ref2\" class=\"page-scroll\">2</a></sup>. Khalil recently completed the automotive industry’s first numerical study of aerodynamic conditions that surround a vehicle on the road. The study formed the basis of Khalil’s MSc thesis in Computational Fluid Dynamics (CFD) at Cranfield University in the United Kingdom (UK) and established a baseline for future numerical studies.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig2-Volume-Metric-1000x467.png\"\r\n\t\t\t\talt=\"Volumetric grid generated for intermediate location.\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\t\tVolumetric grid generated for intermediate location. It has two refinement regions: one immediately around the subject vehicle, and a larger region covering the section of the M1 motorway used for the numerical study. Viscous layers around the sedan and rear end of the trailer can also be seen.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;The idea is to inject real-life conditions into the CFD simulation software in order to simulate the conditions on an actual motorway,&rdquo; says Khalil. &ldquo;Which makes it a complex simulation with many moving parts.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig3-Close-Up-1000x334.png\"\r\n\t\t\t\talt=\"Close up visualization of front position.\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tClose up visualization of front position.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tWorking with his professors and advisors, Khalil began by gathering data about road conditions on the UK’s M1 roadway such as traffic patterns, accidents, winds, and speed. He then used Pointwise to create individual high-fidelity meshes for the subject car and a variety of vehicles. After inputting the road conditions and running simulations on the individual aerodynamics of the main vehicle, he joined all the meshes together using Pointwise’s multiple block feature for the final study of how the moving parts interacted together. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;We knew it would require a great deal of time and there was no room for error, so we ran an initial study using a coarse grid level,&rdquo; says Khalil. &ldquo;The test took about 19 hours to run on 64 high-performance cores, and everything worked quite well. The final study was run on a medium grid, took about 48 hours, and yielded some very accurate results. I don’t think we would have been able to do it that quickly without Pointwise.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Multiple Block Approach</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise uses a multiple block approach simplifying complex CFD studies into modular grids that can easily be linked together. This approach gives users full control of the process, from the smallest element to the largest, and enables them to troubleshoot and improve grid quality early in the process. It also saves time and increases accuracy by allowing the reuse of grids in different configurations for additional CFD studies. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig4-Top-View-1000x333.png\"\r\n\t\t\t\talt=\"Overhead view of front position.\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tOverhead view of front position.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;For the motorway study, I did not have to re-mesh the car. I did not have to re-extrude viscous layers or re-mesh the volume,&ldquo; says Khalil. &ldquo;It saves a remarkable amount of time and ensures that the results are exactly the same because we’re using the exact same data and mesh. Pointwise’s T-Rex feature was also critical to accurately capturing the boundary layer flow, which is especially important for turbulence studies.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThis is just the beginning for researchers. The data and results from Khalil’s numerical study will be used by future researchers to refine the automotive industry’s understanding of how changing aerodynamic conditions affect vehicles on the road. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<img data-src=\"images/Fig5-Surface-Mesh-1000x450.png\"\r\n\t\t\t\talt=\"Fine surface mesh of subject vehicle.\" class=\"img-fluid center-block\" />\r\n\t\t\t\t<figcaption>\r\n\t\t\t\t\tFine surface mesh of subject vehicle.\r\n\t\t\t\t</figcaption>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t&ldquo;I am really excited about a safer future with driverless cars,&rdquo; says Khalil. &ldquo;There is still so much to do, but it is important that we have taken the first step.&rdquo;\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor more information about how engineers and designers in the automotive industry use Pointwise to make faster, more efficient vehicles, visit <a href=\"https://info.pointwise.com/pointwise-delivers-fast-accurate-results-garry-rogers-motorsport\">Pointwise Delivers Fast, Accurate Results for Garry Rogers Motorsport</a>. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p class=\"text-center cta-space\">\r\n\t\t\t\t\t<!--HubSpot Call-to-Action Code --><span class=\"hs-cta-wrapper\" id=\"hs-cta-wrapper-1c6b33ca-b693-476c-8bd1-b593cc78473b\"><span class=\"hs-cta-node hs-cta-1c6b33ca-b693-476c-8bd1-b593cc78473b\" id=\"hs-cta-1c6b33ca-b693-476c-8bd1-b593cc78473b\"><!--[if lte IE 8]><div id=\"hs-cta-ie-element\"></div><![endif]--><a href=\"https://cta-redirect.hubspot.com/cta/redirect/3788790/1c6b33ca-b693-476c-8bd1-b593cc78473b\" ><img class=\"hs-cta-img\" id=\"hs-cta-img-1c6b33ca-b693-476c-8bd1-b593cc78473b\" style=\"border-width:0px;\" src=\"https://no-cache.hubspot.com/cta/default/3788790/1c6b33ca-b693-476c-8bd1-b593cc78473b.png\"  alt=\"Read More\"/></a></span><script charset=\"utf-8\" src=\"https://js.hscta.net/cta/current.js\"></script><script type=\"text/javascript\"> hbspt.cta.load(3788790, '1c6b33ca-b693-476c-8bd1-b593cc78473b', {}); </script></span><!-- end HubSpot Call-to-Action Code -->\r\n\t\t\t\t</p> \r\n\t<h3>References</h3>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\t<a id=\"ref1\">[1]</a> <a href=\"https://www.nhtsa.gov/technology-innovation/automated-vehicles-safety#issue-road-self-driving\">Automated Vehicles for Safety</a>, NHTSA web site.\r\n\t\t\t\t</p>\r\n\t\t\t\t<p>\r\n\t\t\t\t\t<a id=\"ref2\">[2]</a> <a href=\"https://www.linkedin.com/in/k-khalil/\">www.linkedin.com/in/k-khalil/</a>\r\n\t\t\t\t</p>","__v":0}
{"_id":{"$oid":"5fab024d04d997423c0ac57e"},"title":"Reducing Discretization Error with Mesh Adaptation","abstract":"Learn how mesh adaptation can improve CFD solution accuracy. Mesh adaptation can automatically add finer mesh resolution in areas where it is needed by examining an error metric or flow gradients to determine where the existing mesh is not adequately resolving the flow.","postDate":{"$date":"2018-11-09T00:00:00Z"},"imgUrl":"main-background-3840x1200.png","imgAltText":"Reducing Discretization Error with Mesh Adaptation","author":"","clientName":"4th AIAA Propulsion Aerodynamics Workshop","clientLogo":"4th AIAA Propulsion Aerodynamics Workshop","clientSinceHead":"Participating Since","clientSince":"2016","clientAboutHead":"About the Workshop","clientAbout":"The focus of the workshop will be on assessing the accuracy of CFD in obtaining air breathing system performance and flow structure to include nozzle forces, plume surveys, subsonic inlet recovery and distortion, and high-speed inlet performance.","challenge":"It is difficult, if not impossible, to know what grid resolution is needed in all parts of a flowfield until you know what the flowfield is, which of course you do not know until you have a flow solution.","solution":"Mesh adaptation can automatically add finer mesh resolution in areas where it is needed by examining an error metric or flow gradients to determine where the existing mesh is not adequately resolving the flow.","benefit":"Solution accuracy for an inlet was improved by an order of magnitude.","ymal1Title":"Introduction to Scripting in Pointwise","ymal1Img":"discretization-ymal1.png","ymal1Alt":"Intro to Scipting in Pointwise","ymal1Abstract":"In this webinar, we present a basic introduction to scripting in Pointwise and lay the framework for customization of the meshing process through scripts. Scripting in Pointwise is accomplished with Glyph, an extension of Tcl.","ymal1Url":"../../webcasts/2015-02/Introduction-Scripting-in-Pointwise.html","ymal2Title":"Revisiting Output-Based Mesh Adaptation","ymal2Img":"discretization-ymal2.png","ymal2Alt":"Revisiting Output-Based Mesh Adaptation","ymal2Abstract":"In this article, some background on why you should be using mesh adaptation to make sure important flow features are resolved without an inordinately large overall cell count is presented along with an example using Pointwise and NASA's FUN3D solver.","ymal2Url":"../../theconnector/2016-Q1/Revisiting-Output-Based-Mesh-Adaptation.html","ymal3Title":"Meshing Overview from the 3rd Propulsion Aerodynamics Workshop","ymal3Img":"discretization-ymal3.png","ymal3Alt":"Meshing Overview & S-Duct Results from the 3rd Propulsion Aerodynamics Workshop","ymal3Abstract":"Pointwise provided a set of standard grids for workshop participants to use at this year's 3rd Propulsion Aerodynamics Workshop in Salt Lake City, Utah. An overview of some of these features and the workshop grids is provided. Some initial steady-state results for the S-Duct using these grids and NASA's FUN3D solver are presented. ","ymal3Url":"../../theconnector/2016-Q3/Meshing-Overview-and-S-Duct-Results-from-Propulsion-Aerodynamics-Workshop.html","gated":true,"caseStudy":"        <h2>Mesh Adaptation: A Brief Overview</h2>\r\n\r\n        <p>\r\n          Despite the evolution of computer processing capability, reducing the complexity of numerical simulations remains an essential issue. Mesh adaptation is a common technique employed, among many of the methods available, to help reduce simulation complexity. In the field of computational fluid dynamics (CFD), unstructured mesh adaptation has been used to substantially reduce the mesh size, or the number of degrees of freedom of a simulation at hand to reach a given solution accuracy. Thus, this technique enables significant improvements in processing time, memory requirements, and storage needed. Furthermore, error estimates have the capability to detect physical phenomena and capture their behavior. Meshes are then automatically adapted in critical regions without any a priori knowledge of the problem.\r\n        </p>\r\n\r\n        <p>\r\n          The concept of mesh adaptation is not new, and a survey of the literature shows a rather large number of publications dealing with the subject. In most of these works, the adaptation is isotropic and accomplished by splitting elements in predefined patterns. The idea of anisotropic mesh adaption emerged in the late 1980s as a result of concerns surrounding error estimation and mesh generation.\r\n        </p>\r\n\r\n        <p>\r\n          In 1987, Peraire et al. proposed a first attempt in 2-D by providing error estimates involving directions<sup><a href=\"#1\">1</a></sup>. They highlighted the directional property of interpolation error and presented the idea of generating elements with higher aspect ratios. They coupled this with an advancing front technique to generate slightly anisotropic meshes with an aspect ratio of five.\r\n        </p>\r\n\r\n        <p>\r\n          Similar approaches have been considered by Löhner<sup>2</sup> as well as Selmin and Formaggia<sup>3</sup>. The first attempts in 3-D were proposed in the early 1990s by Löhner<sup>4</sup> and Peraire et al.<sup>5</sup>, but numerical results were primarily isotropic and mesh anisotropy was not visible.\r\n        </p>\r\n\r\n        <p>\r\n          In 1994, Zienkiewicz and Wu<sup>6</sup> provided a qualified status on the topic but noted the challenges in creating suitable anisotropic meshes for practical use. Meanwhile, Mavriplis proposed generating stretched elements with a Delaunay approach in 2-D in order to obtain high-aspect ratio triangles in boundary layers and wake regions typically found in aerospace applications<sup>7</sup>. A year later George, Hecht, and Vallet<sup>8</sup> introduced the use of metrics in a Delaunay mesh generator. They demonstrated that the absolute value of the Hessian matrix is a metric, and they proposed a Delaunay-based mesh generator where edge lengths are computed in a Riemannian metric space. This generalized all of the work preceding it, and it was widely exploited for 2-D anisotropic mesh adaptation in the 1990s and for 3-D at the beginning of the 2000s.\r\n        </p>\r\n\r\n        <p>\r\n          A couple of examples demonstrating recent results generated using mesh adaptation and error estimates to capture relevant physical phenomena and provide additional grid resolution in those defined regions are provided next. These use cases help show how mesh adaptation can be used to automatically add grid resolution in areas of the flow field where it is needed and remove the requirement for often time-consuming, human-driven mesh generation while economizing computational resources.\r\n        </p>\r\n\r\n        <h2>Output-based Mesh Adaptation of an S-Duct</h2>\r\n\r\n        <p>\r\n          The <a href=\"https://paw.larc.nasa.gov/\" target=\"_blank\" rel=\"noreferrer noopener\">3rd Propulsion Aerodynamics Workshop</a> (PAW03) preceded the 52nd AIAA/SAE/ASEE Joint Propulsion Conference hosted in Salt Lake City in July 2016. In the workshop, flow through a diffusing serpentine inlet, or S-Duct, was analyzed. Participants submitted datasets comprising three separate inlet configurations and a set of four flow conditions. Results from participants include 77 baseline S-Duct, 29 S-Duct with Aerodynamic Interface Plane (AIP) instrumentation hardware, and 43 S-Duct with flow control devices modeled.\r\n        </p>\r\n\r\n        <p>\r\n          Results were quantified in terms of total pressure recovery, <em>PT2/PT0</em>, as well as steady-state and dynamic distortion<sup>9</sup>. A summary of participants’ results given by Winkler and Davis<sup>10</sup> shows a non-trivial amount of scatter in reported values when compared to experimental data despite most participants using a common set of workshop-supplied grids. In other words, accurate numerical prediction of the flow field for these types of diffusing S-Duct applications continues to be a challenge for CFD. Many factors are necessary for a CFD calculation to reliably predict these types of flows including accurate geometry representation (i.e., including all influential geometry components), adequate grid resolution, and proper turbulence modeling.\r\n        </p>\r\n\r\n        <p>\r\n          Off-body, output-based mesh adaptation was performed on a set of <a href=\"../../index.html\" target=\"_blank\" rel=\"noreferrer noopener\">Pointwise</a> grids using NASA’s <a href=\"https://fun3d.larc.nasa.gov/\" target=\"_blank\" rel=\"noreferrer noopener\">FUN3D</a> software<sup>11</sup> in order to demonstrate improved prediction of the flow field using this technique.\r\n        </p>\r\n\r\n        <p>\r\n          Figure 1 shows the diffusing serpentine inlet modeled by workshop participants. Air is induced from ambient room conditions through a diffuser by creating low pressure downstream with a vacuum pump. Flow rate is controlled by running the pump at selected revolutions per minute (RPM) while measurements are calibrated with a Mass Flow Plug (MFP). The test case models the bellmouth contraction, upstream adapter section, Inlet Flow Control and Prediction Technologies for Embedded Propulsion Systems (IFCPT) S-Duct, AIP housing, and 5-diameter extension.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig1-800x611.png\"\r\n        alt=\"Components of the IFCPT S-Duct\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 1: Components of the IFCPT S-Duct.\r\n        </figcaption>\r\n\r\n        <p>\r\n          The AIP diameter <em>(D)</em> measures 5 inches, is offset 1.09<em>(D)</em> in the vertical direction, and has a length-to-diameter ratio <em>(L/D)</em> of 3.106. The model has a 5<em>D</em> extension added in order to impose a downstream constant pressure or massflow out boundary condition. Figure 2 illustrates additional geometry components modeled in two separate configurations. The 40-probe AIP instrumentation hardware was modeled in one case to measure its influence on the flow field while a set of flow control devices was added to a third configuration to induce flow separation in the offset diffuser’s adverse pressure gradient turn.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig2-800x326.png\"\r\n        alt=\"inlet performance metrics\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 2: AIP instrumentation and flow control vanes were modeled in separate configurations to determine their influence on inlet performance metrics.\r\n        </figcaption>\r\n\r\n        <p>\r\n          The set of flow conditions given to participants is shown in Table 1. The first two in the list correspond to conditions intended to be run for the baseline S-Duct and S-Duct with AIP cases. The remaining two were to be used for the case with flow control vanes. Flow Conditions 1 and 3 were used with their respective configurations in this output-based mesh adaptation study.\r\n        </p>\r\n\r\n        <figcaption class=\"case-table\">\r\n          Table 1: Flow conditions for S-Duct test cases provided to PAW participants.\r\n        </figcaption>\r\n        <img data-src=\"images/Table1-800x226.png\"\r\n        alt=\"Table 1\" class=\"img-fluid center-block\" />\r\n\r\n        <p>\r\n          Starting from coarse initial grids created in Pointwise for each of the three S-Duct cases, ten adaptation cycles were run on each separately using FUN3D. Both steady-state flow and adjoint solutions were computed, and an error estimate of total pressure surveyed at a constant <em>x</em>-plane corresponding to the AIP was evaluated.\r\n        </p>\r\n\r\n        <p>\r\n          The grid is then adapted in response to this error estimate by inserting and moving nodes, collapsing and swapping cells, and anisotropically stretching cell edges to iteratively improve the calculation of total pressure at the AIP. The initial grids created were between 600,000 and 1.5x10<sup>6</sup> nodes depending on the inlet configuration.  For each case, a constant-complexity-scaling factor was applied and linearly varied over the course of 10 adaptation cycles to drive adaptation on coarser grids initially and limit the optimal grid size to something that would fit within available computing resources (i.e., 20x10<sup>6</sup> nodes). A constant y-plane cut of the initial and final adapted grids for each case is shown in Figure 3.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig3-800x830.png\"\r\n        alt=\"Initial and final adapted meshes computed by using the integrated value for total pressure at the AIP\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 3: Initial and final adapted meshes computed by using the integrated value for total pressure at the AIP. Flow condition 1 was used for (a) – (d) while Flow condition 3 was used for (e) – (f).\r\n        </figcaption>\r\n\r\n        <p>\r\n          The experimental total pressure recovery value reported<sup>12</sup> for Flow Condition 1 was <em>PT2/PT0</em> = 0.9784. Computed results for the baseline S-Duct were found to over-predict this value by 0.65% primarily due to the absence of the AIP instrumentation hardware in the simulation model. Similarly, a 1.57% difference was found between the reported test value and output-based mesh adapted result for the S-Duct with vanes case. These results emphasize the importance of including all influential geometry components in an analysis model when drawing comparisons with experimental data.\r\n        </p>\r\n\r\n        <p>\r\n          It was shown for these two cases that if one assumes second-order accuracy and extrapolates the output-based mesh adaptation results from the 10 adaptation cycles that were run to <em>N<sup>-2/3</sup></em> = 0 where <em>N</em> is the number of nodes in the mesh and <em>N<sup>-2/3</sup></em> represents a substitute for the characteristic grid spacing for a 3-D, second-order accurate problem (i.e., total pressure recovery computed on an infinite mesh), an order of magnitude improvement in solution accuracy was achieved over solutions computed on workshop-supplied grids using the same flow solver.\r\n        </p>\r\n\r\n        <p>\r\n          The S-Duct with AIP case allows for the most direct comparison between the reported test value and computed results in total pressure recovery given it models the AIP instrumentation hardware. The output-based mesh adaptation result was computed to be <em>PT2/PT0</em> = 0.9781, and under-predicts the experimental value by only 0.03% which is substantially better than the 7.5% difference between the experimental value and results computed on workshop-supplied grids. The <a href=\"https://paw.larc.nasa.gov/\" target=\"_blank\" rel=\"noreferrer noopener\">Propulsion Aerodynamics Workshop website</a> includes additional resources from previous workshops.\r\n        </p>\r\n\r\n        <h2>Surface and Volume Grid Adaptation in Pointwise</h2>\r\n\r\n        <p>\r\n          In the S-duct cases, mesh adaptation was limited to modifying only the grid elements located an equivalent y<sup>+</sup> = 300 distance away from wall boundaries. This is due to some issues of robustness when modifying high aspect ratio cells near highly curved wall boundaries, which are typically used to resolve the viscous boundary layer. Additionally, most flow solvers do not couple the underlying CAD data to allow modification and re-projection of the surface grid elements, which is somewhat limiting.\r\n        </p>\r\n\r\n        <p>\r\n          Some work is ongoing which allows Pointwise to perform mesh adaptation on both surface and volume grids by importing a target grid spacing size field computed from both flow and adjoint solutions, which in turn are used to determine an error estimate for a specific engineering cost function. The updated target grid spacing size field is read-in as a point-source object in which the target grid spacing values are specified at unique <em>x-</em>, <em>y-</em>, and <em>z-</em>coordinates. Pointwise is then able to adapt the mesh, which includes modifying grid elements constrained to surfaces and their boundaries, due to the analytical geometry definition being available.\r\n        </p>\r\n\r\n        <p>\r\n          One recent study examined whether there was any computational savings or improvement in solution accuracy to be found by adopting this approach. The work looked at first running a computationally inexpensive, inviscid output-based mesh adaptation simulation, importing the resulting target size field into Pointwise, and then using this size field to create a more suitable mesh for further viscous output-based mesh adaptation simulations. An <a href=\"https://www.grc.nasa.gov/WWW/wind/valid/m6wing/m6wing.html\" target=\"_blank\" rel=\"noreferrer noopener\">ONERA M6 wing geometry</a> was used for this pedagogic example with flow conditions shown in Table 2.\r\n        </p>\r\n\r\n        <figcaption class=\"case-table\">\r\n          Table 2: Flow conditions from Test 2308 of Ref. 13.\r\n        </figcaption>\r\n        <img data-src=\"images/Table2-800x146.png\"\r\n        alt=\"Table 2\" class=\"img-fluid center-block\" />\r\n\r\n        <p>\r\n          An initial coarse grid was created in Pointwise and viscous output-based mesh adaptation was performed using NASA’s FUN3D software in order to gather a set of baseline metrics. The initial grid consisted of about 600,000 nodes and used anisotropic triangles to resolve leading and trailing edge curvature. The grid was adapted in order to reduce the error in the wing’s lift-to-drag ratio (<em>L/D</em>). Similar to the previous S-duct case, a constant-complexity-scaling factor strategy was employed to linearly increase the grid complexity over 10 adaptation cycles to drive mesh adaptation on coarse grids initially and limit the size of the optimal grid to something that would fit within available computing resources. The final adapted grid consisted of about 6.1x10<sup>6</sup> nodes.\r\n        </p>\r\n\r\n        <p>\r\n          The same manifold surface mesh used in creating the initial coarse grid was used as input for running inviscid output-based mesh adaptation with <a href=\"\" target=\"_blank\">Aerion Technologies’ Cart3D software</a>. Cart3D uses a Cartesian octree-based meshing strategy along with an iterative refinement strategy to perform computationally inexpensive inviscid adaptive mesh refinement. Fifteen adaptation cycles were run in approximately an hour of wall clock time using a conventional multi-processor desktop workstation. Results from Cart3D are shown in Figure 4.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig4-800x379.png\"\r\n        alt=\"Evolution of the Cart3D adaptive mesh refinement process on the ONERA M6 wing\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 4: Evolution of the Cart3D adaptive mesh refinement process on the ONERA M6 wing.\r\n        </figcaption>\r\n\r\n        <p>\r\n          Target length scales of the mesh are output as the AMR process iterates from coarser to finer meshes. Each cell’s length scale is defined as the minimum of the cell’s edge lengths over the three coordinate directions. The length scales are then filtered using an octree-based decimation algorithm that reduces the number of source points in the network and has a nominal impact on the overall Cart3D AMR process.  More details about how the size field is computed can be found in Davis, et al<sup>13</sup>. The size field was then imported into Pointwise and used to update the surface and volume grids for additional viscous output-based mesh adaptation in FUN3D. One drawback to this approach was that the octree meshing technique used by Cart3D has isotropic cells everywhere. As a result, the target size field inherits this property and excessive refinement appears along the leading and trailing edges; whereas, anisotropic triangles could more efficiently resolve this curvature in the baseline grid case. This leads to an initial volume grid that consists of five times as many nodes as were in the initial grid for the baseline case.\r\n        </p>\r\n\r\n        <p>\r\n          This ultimately took longer to run due to the increased complexity of initial grids, but we were able to obtain a more accurate solution after running only one adaptation cycle starting with this updated grid, than was achieved after ten adaptation cycles with the baseline case.  More details about this study can be found in the accompanying paper.\r\n        </p>\r\n\r\n        <p>\r\n          Recently we tried importing the target size field directly from FUN3D itself in order to perform mesh adaptation directly in Pointwise at each adaptation step. An example of the size field computed by FUN3D after one adaptation cycle and corresponding point source object in Pointwise are shown in Figure 5.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig5-800x350.png\"\r\n        alt=\"Isotropic size field computed in FUN3D for an ONERA M6 wing and corresponding point source object in Pointwise\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 5: Isotropic size field computed in FUN3D for an ONERA M6 wing and corresponding point source object in Pointwise.\r\n        </figcaption>\r\n\r\n        <p>\r\n          A comparison of the initial isotropic surface grid and surface grid after adaptation is shown in Figure 6.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig6-800x377.png\"\r\n        alt=\"A comparison of initial and adapted surface grids on an ONERA M6 wing\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 6: A comparison of initial and adapted surface grids on an ONERA M6 wing.\r\n        </figcaption>\r\n\r\n        <p>\r\n          However, the isotropic surface grid refinement as shown in Figure 6 can lead to very large volume grids. To resolve this, ongoing research is focused on computing an anisotropic metric as shown in Figure 7, which would provide both target edge lengths and principal directions which are uniquely defined by eigenvalue decomposition of the 3 x 3 symmetric, positive matrix.\r\n        </p>\r\n\r\n        <img data-src=\"images/Fig7-800x340.png\"\r\n        alt=\"Anisotropic metric rendered as the equators of ellipsoids\" class=\"img-fluid center-block\" />\r\n        <figcaption>\r\n          Figure 7: Anisotropic metric rendered as the equators of ellipsoids. (Images courtesy of M. Park of NASA Langley).\r\n        </figcaption>\r\n\r\n        <h2>Additional Resources</h2>\r\n\r\n        <p>\r\n          For more in-depth details about the case study, &ldquo;Reducing Discretization Error with Mesh Adaptation&rdquo; complete the below form to download the following papers and presentation.\r\n        </p>\r\n\r\n        <p>\r\n          Davis, Z. S., Carrigan, T. J., Wyman, N., and McMullen, M., &ldquo;Reducing the Cost of Viscous Mesh Adaptation,&rdquo; 23rd AIAA Computational Fluid Dynamics Conference, AIAA-Paper 2017–3109, Denver, CO, June, 2017. (Paper and presentation.)\r\n        </p>\r\n\r\n        <p>\r\n          Davis, Z. S. and Park, M. A., &ldquo;IFCPT S-Duct Grid-Adapted FUN3D Computations for the Third Propulsion Aerodynamics Workshop,&rdquo; 53rd AIAA/SAE/ASEE Joint Propulsion Conference, AIAA-Paper 2017–4835, Atlanta, GA, July 2017. (Paper only.)\r\n        </p>\r\n\r\n        <div>\r\n          <!--[if lte IE 8]>\r\n          <script charset=\"utf-8\" type=\"text/javascript\" src=\"//js.hsforms.net/forms/v2-legacy.js\"></script>\r\n          <![endif]-->\r\n          <script charset=\"utf-8\" type=\"text/javascript\" src=\"//js.hsforms.net/forms/v2.js\"></script>\r\n          <script>\r\n            hbspt.forms.create({\r\n          \tportalId: \"3788790\",\r\n          \tformId: \"1e4b72f8-81f2-4129-9519-7de01cd19cc5\",\r\n          \tcss: \"\"\r\n          });\r\n          </script>\r\n        </div> \r\n       <h3>References</h3>\r\n\r\n        <ol>\r\n          <li>Peraire, J., Vahdati, M., Morgan, K., and Zienkiewicz, O. C., &ldquo;Adaptive Remeshing for Compressible flow computations,&rdquo; <em>Journal of Computational Physics</em>, 72:449—466, 1987.</li>\r\n\r\n          <li>L&ouml;hner, R., &ldquo;Adaptive Remeshing for Transient Problems,&rdquo; <em>Computational Methods in Applied Mechanical Engineering</em>, 75:195—214, 1989.</li>\r\n\r\n          <li>Selmin, V. and Formaggia, L., &ldquo;Simulation of Hypersonic Flows on Unstructured Grids,&rdquo; <em>International Journal of Numerical Methods in Engineering</em>, 34:569—606, 1992.</li>\r\n\r\n          <li>L&ouml;hner, R., &ldquo;Three-Dimensional Fluid-Structure Interaction Using a Finite Element Solver and Adaptive Remeshing,&rdquo; <em>Computing Systems in Engineering</em>, 1(2-4):257—272, 1990.</li>\r\n\r\n          <li>Peraire, J., Peiro, J., and Morgan, K., &ldquo;Adaptive Remeshing for Three-Dimensional Compressible Flow Computations,&rdquo; <em>Journal of Computational Physics</em>, 103:269—285, 1982.</li>\r\n\r\n          <li>Zienkiewicz, O. C., and Wu, J., &ldquo;Automatic Directional Refinement in Adaptive Analysis of Compressible Flows.&rdquo; <em>International Journal of Numerical Methods in Engineering</em>, 37:2189—2210, 1994.</li>\r\n\r\n          <li>Mavriplis, D. J., &ldquo;Adaptive Mesh Generation for Viscous Flows Using Delaunay Triangulation,&rdquo; <em>Journal of Computational Physics</em>, 90:271—291, 1990.</li>\r\n\r\n          <li>George, P. L., Hecht, F., and Vallet, M. G., &ldquo;Creation of Internal Points in Voronoi’s Type Method: Control and Adaptation,&rdquo; <em>Advanced Engineering Software</em>, 13(5-6): 303—312, 1991.</li>\r\n\r\n          <li>&ldquo;Gas Turbine Engine Inlet Flow Distortion Guidelines,&rdquo; SAE ARP 1420 Rev. C, Society of Automotive Engineers International, Warrendale, PA, April 2017.</li>\r\n\r\n          <li>Winkler, C. M. and Davis, Z. S., &ldquo;Summary of the 3rd Propulsion Aerodynamics Workshop: S-duct Results,&rdquo; <em>53rd AIAA/SAE/ASEE Joint Propulsion Conference</em>, AIAA Paper 2017—4912, Atlanta, GA, July 2017.</li>\r\n\r\n          <li>Anderson, W. K. and Bonhaus, D. L., &ldquo;An Implicit Upwind Algorithm for Computing Turbulent Flow on Unstructured Grids,&rdquo; <em>Comp. & Fluids</em>, 23(1):1—21, Jan. 1994.</li>\r\n\r\n          <li>McMillan, M. L., Mackie, S. A., Gissen, A., Vukasinovic, B., Lakebrink, M. T., Glezer, A., Mani, M., and Mace, J. L., &ldquo;Inlet Flow Control and Prediction Technologies for Embedded Propulsion Systems,&rdquo; NASA/CR—2011-217237, NASA, Dec. 2011.</li>\r\n\r\n          <li>Schmitt, V. and Charpin, F., &ldquo;Pressure Distributions on the ONERA-M6-Wing at Transonic Mach Numbers,&rdquo; <em>Experimental Database for Computer Program Assessment</em>. Report of the Fluid Dynamics Panel Working Group 04, AGARD AR 138, May 1979.</li>\r\n\r\n          <li>Davis, Z. D., Carrigan, T. J., Wyman, N. and McMullen, M., &ldquo;Reducing the Computational Cost of Viscous Mesh Adaptation,&rdquo; <em>23rd AIAA Computational Fluid Dynamics Conference</em>, AIAA Paper 2017—3109, Denver, CO, June 2017.</li>\r\n        </ol>","__v":0}
{"_id":{"$oid":"5fcab2221a4d2224b896a273"},"title":"Mesh Adaptation that Works!","abstract":"Read how Pointwise and ISimQ have developed a new mesh adaption process that achieves the hopes and promises of adaption from long ago by removing mesh generator skill from the CFD analysis process to produce consistent, high-quality simulation results.","postDate":{"$date":"2020-12-07T00:00:00Z"},"imgUrl":"Mesh-Adaptation-Works-Main-3840x1200.png","imgAltText":"Solution adapted mesh on the hub surface of the Aachen turbine","author":"by Paul Galpin<br/>\r\nDirector<br/>\r\nISimQ Ltd","clientName":"ISimQ","clientLogo":"ISimQ-logo-200x200.png","clientSinceHead":"Partner Since","clientSince":"2016","clientAboutHead":"About the Partner","clientAbout":"ISimQ is an innovative Computational Fluid Dynamics service provider with offices in Canada and Germany. ISimQ’s extensive CFD expertise is a guarantee for providing innovative simulation solutions that directly impact the profitability of product development processes. Our services cover the whole simulation software life-cycle from deploying software to developing best practice procedures and ultimately driving innovation with simulation projects that include custom model and simulation workflow development, multi-physics, and robust design. We work diligently and in close partnership with our customers. ISimQ stands for &ldquo;Innovative Simulations with Quality.&rdquo; <a href=\"https://www.isimq.com/\">www.isimq.com</a>","challenge":"CFD simulation results are often used to guide product design decision making, but the quality of a given simulation, which influences how accurate decisions will be, remains squarely on the shoulders of the CFD analyst.","solution":"Pointwise and ISimQ have developed a new mesh adaption process that achieves the hopes and promises of adaption from long ago by removing mesh generator skill from the CFD analysis process to produce consistent high-quality simulation results.","benefit":"Pointwise and ISimQ developed an efficient adaptation procedure for effective control of discretization error on real-world cases that adapts to underlying geometry while still efficiently resolving the mesh with high aspect ratios in boundary layers.","gated":false,"caseStudy":"<h2>CFD Simulation Quality</h2>\r\n<p>You may already be using CFD in your product design process, or you may be interested in enhancing your product or process by CFD simulation technology. Either way, you require high-quality CFD simulations to make reliable decisions that benefit your product. While it is easy to obtain a CFD simulation result these days using commercial CFD software, the quality of a given CFD simulation remains squarely on the shoulders of the CFD analyst.</p>\r\n<p>ISimQ measures CFD simulation quality in terms of numerical error, model error and systematic error. Model errors originate from physical models such as turbulence, heat transfer, phase change, and chemical reactions. Systematic errors relate to differences between the true and the computer representation of a device, such as the level of geometric detail and boundary conditions. Numerical errors refer to the discrete CFD solution of the governing conservation equations. They consist of discretisation errors, iteration errors and precision errors. In contrast to model and systematic errors, CFD analysts are in direct control of numerical errors.</p>\r\n<p>Discretisation errors are mesh-related. In real estate sales, they say that there are three essential considerations: location, location and location. Likewise, in CFD simulations, the three most important factors impacting solution quality are meshing, meshing and meshing. A mesh spacing that does not adequately resolve local variations in the flow variables introduces discretisation error, i.e. the flow equations are not accurately solved. On the other hand, if the mesh is overly refined, the computational time and effort is needlessly increased, as calculation times are proportional to 𝑁<sup>&alpha;</sup>, where 𝑁 is the number of grid nodes, and the exponent &alpha; is usually larger than unity. Mesh element types and data structures also impact the person-effort required to generate a mesh, and the cost per unit of accuracy. Mesh types range from structured hexahedra to unstructured polyhedra and from manual to fully automated meshing procedures. A well-made hexahedral mesh is generally more accurate per unit of computational effort compared to an automatically generated unstructured mesh but requires more human time and meshing skills to attain. If that is not enough, the mesh quality also has a massive impact on the robustness of CFD simulations. In a perfect world, a CFD mesh has elements with 90 degree between adjacent edges, a volume expansion ratio approaching unity, and a low mesh aspect ratio. In practice, all meshes fall short of \"perfection\". Therefore, all you who generate CFD meshes, the responsibility for computational robustness, accuracy and efficiency depends on you. Or does it not?</p>\r\n<h2>Mesh Adaptation Goals and Challenges</h2>\r\n<p>For the last three decades, mesh adaptation procedures have been available. With mesh adaptation, a CFD simulation begins on an initial mesh, and the CFD simulation procedure itself improves the mesh to reduce the discretisation error for the flow at hand. In a first step, the adaptation algorithms estimate truncation errors, for example, by examining local gradients of the flow variables. Then, they enrich the mesh in the areas of the highest gradients, hoping to reduce discretisation errors and to determine the \"ideal\" mesh for the simulation problem. Adaptation sounds impressive. It is available in most commercial CFD packages. So why are we not all using adaptation in our CFD simulations?</p>\r\n<p>As usual, the devil is in the details. The problem is that, strangely, most mesh adaptation procedures negate the key benefits that they are trying to address:</p>\r\n<ul>\r\n<li>Adaptation does not resolve the correct geometry. Most adaptation procedures are integral to the CFD solver. Hence, they adapt only to a faceted approximation of the actual geometry. Commonly, the geometry for adaptation is the mesh face representation in the original (initial) mesh. After adaptation, one has the ideal mesh for precisely the wrong geometry.</li>\r\n<li>\tAdaptation decreases the mesh quality when locally refining the mesh. Many adaptation\r\nprocedures use a divide-and-conquer approach to enrich the mesh, whereby an existing mesh element is locally divided into additional elements. While convenient to program, this approach can lead to a steady decrease in mesh quality with refinement, causing a de­crease in robustness, longer run times and perhaps even <em>increased</em> discretisation error.</li>\r\n<li>Adaptation in near-wall shear layers where the gradients of the flow variables are extensive has many challenges. Brute force approaches typically use isotropic refinement near walls, causing an explosion in the mesh size. A common strategy to avoid the mesh size explosion employs stretched tetrahedra to resolve the large gradients normal to walls without over­-refining parallel to the wall. However, this approach leads to a massive decrease in mesh quality. Researchers are working towards intelligent anisotropic adaptation, but solver robustness on an anisotropic adapted mesh remains a formidable challenge. Frustratingly, do we need a CFD simulation plus an automatic mesh adaptation procedure to tell us what we already know, that the gradients of flow variables are large in boundary layer regions?</li>\r\n<li>Adaptation procedures often lead to excessive run-times, either because the mesh was over-refined in some direction or location, or the mesh quality decreased during adaptation causing the CFD solver to struggle, or even the simple issue of when to stop the refinement procedure. If the computational effort grows far beyond a \"standard\" CFD simulation, analysts give up on adaptation and make the best mesh possible given the expected flow field and the human time, computing time and resource constraints.</li>\r\n</ul>\r\n<h2>A New Mesh Adaptation Procedure</h2>\r\n<p>In a joint effort, Pointwise and ISimQ have developed a new mesh adaptation procedure that addresses the above challenges.</p>\r\n<p>The adaptation procedure separates the meshing and solving steps in a coordinated and automated way managed by an overall adaptation program. It accomplishes several benefits. In the first step, the analyst creates an initial mesh to start the adaptation procedure. This initial mesh should resolve the near-wall boundary layer regions adequately. For example, Pointwise's T-Rex (anisotropic tetrahedral extrusion) approach automatically creates regions of hexahedral mesh layers with high aspect ratio for computational efficiency, accuracy and robustness reasons in this area. The initial mesh generation step controls the target near-wall distance, 𝑦+, thereby removing this task from the mesh adaptation procedure.</p>\r\n<p>Discretisation errors, 𝑒<sub>ℎ</sub>, are the difference between the solution on an infinitely fine grid and a finite-width grid:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq1-120x40.png\" alt=\"error equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>They originate from truncation errors, 𝜏<sub>ℎ</sub>, defined as:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq2-198x40.png\" alt=\"truncation error equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>𝑎<sub>𝑚</sub> are entries in the finite-volume coefficient matrix. The index 𝑚 runs over all the connections of a grid point. For linear problems, discretisation and truncation errors are related by:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq3-144x40.png\" alt=\"error equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>The equation shows that truncation errors act as source terms for discretisation errors. Hence, to address the problem at its source, truncation errors form the basis for the local mesh adaptation.</p>\r\n<p>The present adaptation algorithm estimates truncation errors along each edge of the mesh as the difference of a linear and cubic interpolation of relevant flow variables. Figure 1 shows a hexahedral mesh element with vertex-based variable storage.</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig1-Element-Edges-800x484.png\" alt=\"Mesh element & mesh edges\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 1: Mesh element & mesh edges</figcaption>\r\n<p>Linear and cubic interpolations to the integration point, &ldquo;<em>ip</em>&rdquo;, located at the middle of the edge between pointwise &ldquo;1&rdquo; and &ldquo;2&rdquo; yield:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq4-300x80.png\" alt=\"interpolation equation\" class=\"img-fluid mx-auto d-block\" />  \r\n<p>The truncation error estimate for the edge is, therefore:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq5-300x60.png\" alt=\"truncation error estimate for edge equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>In three dimensions, the truncation error estimate is an anisotropic tensor. In the current work, we use a scalar adaptation sensor, <em>S</em>, which is proportional to the tensor truncation error estimate:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq6-300x60.png\" alt=\"scalar adaptation sensor equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>Here:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq7-300x60.png\" alt=\"tensor truncation error estimate\" class=\"img-fluid mx-auto d-block\" />\r\n<p>It is desirable to avoid overly refining already short mesh edges, e.g. those in the near-wall region or at other discontinuities, during the adaptation procedure. Raising the edge length in the adaptation sensor to an exponent, <em>p</em>, decreases the sensor quickly with a reduction in edge length. The final form of the sensor becomes:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq8-300x60.png\" alt=\"sensor equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>Practical values of the exponent <em>p</em> range between 2.5 and 3.0 for three-dimensional meshes. The smaller the value for <em>p</em> the more uniform and rapid is the refinement procedure, with a trade-off between the quality of the resultant adaptation relative to the rate of adaptation.</p>\r\n<p>After a first CFD simulation on the initial mesh, the adaptation algorithm extracts gradients of critical flow variables such as velocities, Mach numbers or temperatures, and calculates the sensor field. Each vertex of the mesh records the maximum sensor value for all edges common to the vertex. The resulting <em>S</em>-field values are then compared to pre-determined thresholds:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq9-300x60.png\" alt=\"S field equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>The goal is to define a target adapted edge scale length, <em>h<sub>T</sub></em>, such that all edges are at or below the threshold value of the adaptation sensor, <em>S<sub>T</sub></em>. The resulting target edge length becomes:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq10-200x40.png\" alt=\"target edge length equation\" class=\"img-fluid mx-auto d-block\" /> \r\n<p>An iterative algorithm computes <em>S<sub>T</sub></em> such that for the given adaptation cycle <em>n</em> the ratio of new mesh complexity, <img data-src=\"images/Mesh-automation-works-inline-eq-1.PNG\" class=\"img-fluid\"/> to old (previous) mesh complexity, <img data-src=\"images/Mesh-automation-works-inline-eq-2.PNG\" class=\"img-fluid\" />, is fixed, typically around a value of 1.3. The most straightforward mesh complexity measure is the sum over all mesh nodes <em>N</em> of the ratio of the local mesh volume to the cube of the local edge length <em>h<sub>n</sub></em> identified as having the maximum sensor value <em>S</em> within the volume <em>n</em>:</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Eq11-280x80.png\" alt=\"mesh node equation\" class=\"img-fluid mx-auto d-block\" />\r\n<p>For a uniform hexahedral mesh and constant 𝜙, the local complexity is unity hence the mesh complexity 𝐶𝑚 equals the total number of nodes, 𝑁. As the mesh becomes more &ldquo;complex&rdquo; in terms of the range of incident edge lengths per node, 𝐶𝑚 grows for a given mesh size 𝑁.</p>\r\n<p>The adaptation software calculates and forwards a point cloud of ℎ<sub>𝑇</sub> target edge lengths to the Pointwise meshing software, augmenting the user-defined initial mesh generation state. The meshing software then generates an improved mesh to achieve the desired distribution of local target edge length, ℎ<sub>𝑇</sub>. The adapted mesh preserves the initial user-defined mesh settings, and most importantly, the boundary layer meshing strategy. The adapted mesh inherently conforms to the underlying geometry known by the mesh generator. The mesh quality consistently improves with each mesh adaptation cycle, as the point cloud data consistently refine the mesh and no a priori choice of a &ldquo;local subdivision&rdquo; is necessary. As a bonus, the adaptation process naturally identifies and corrects areas of large mesh expansion ratio.</p>\r\n<p>A controlling program manages the adaptation cycle, consisting of the following steps:</p>\r\n<ol>\r\n<li>Generate the initial mesh</li>\r\n<li>Compute the CFD simulation on the current mesh</li>\r\n<li>Compute 𝜙 and the gradients of 𝜙 at the mesh vertices</li>\r\n<li>Compute <em>S<sub>T</sub></em> to achieve a specified ratio of <img data-src=\"images/Mesh-automation-works-inline-eq-1.PNG\" class=\"img-fluid\" />/<img data-src=\"images/Mesh-automation-works-inline-eq-2.PNG\" class=\"img-fluid\" /></li>\r\n<li>Compute the point cloud for the target mesh length <em>h<sub>T</sub></em> subject to a threshold <em>S<sub>T</sub></em></li>\r\n<li>Automatically generate a new mesh augmented with the point cloud data</li>\r\n<li>Repeat steps 2) to 6) until convergence</li>\r\n</ol>\r\n<p>The percentage of edges marked for adaptation controls convergence. Initially, the process identifies a small percentage of nodes for adaptation, as the truncation errors are most prominent at a few locations. As the adaptation proceeds, the truncation errors become more and more uniform, and the percentage of edges marked for adaptation increases. Typically, the adaptation is &ldquo;converged&rdquo; when the adaptation algorithm has marked most edges for adaptation, e.g. more than 90 percent. Such percentages indicate that the truncation error is essentially uniform everywhere. It is possible to use more than one point cloud. For example, the current and prior point clouds can combine to smooth out any cycle-to-cycle edge length chatter within the adaptation process.</p>\r\n<p>The entire process is remarkably computationally efficient. Because the mesh is refined only in local areas, the updated CFD simulation on the freshly adapted mesh does not require many iterations to resolve the local mesh changes. The restart process, however, does rely on a high-quality and automated interpolation procedure to map the previous solution onto the adapted mesh. This functionality is built-in to many CFD solvers. For example, ANSYS CFX requires no user input when the &ldquo;initial conditions&rdquo; are on a different mesh than the current CFD simulation mesh. The CPU time during the adaptation steps can be managed by converging sufficiently but not overly tightly during each step and saving tight convergence for the final adapted mesh. In a three-dimensional simulation of the &ldquo;Aachen turbine&rdquo;[<a href=\"#ref1\" class=\"page-scroll\">1</a>], the total simulation was close to the simulation time required to run from an initial guess starting on the final adapted mesh. There is a &ldquo;multigrid-like&rdquo; effect whereby the main flow features and the &ldquo;hard work&rdquo; to adjust the flow from the start occur with little computational effort with the coarser meshes. The adapted finer meshes require fewer CFD simulation iterations as the mesh changes are small at that the end of the adaptation cycle.</p>\r\n<h2>Results</h2>\r\n<p>A flow simulation of the Aachen turbine, consisting of 41 rotor blades rotating at 35,000 rpm at a nominal design point, illustrates the procedure. Adaptation rates 𝑝 of 2.5 and 3.0 were evaluated, with a complexity ratio 𝐶𝑚 of 1.3 during each adaptation step. The initial mesh, generated with the Pointwise T-Rex meshing software, consisted of 400,000 nodes. The non­dimensional distance of the first node away from the wall, 𝑦+, was chosen to be approximately 4. Figure 2 shows the initial mesh with hexahedral elements in the boundary layer region.</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig2-Aachen-Turbine-800x500.png\" alt=\"Aachen turbine - Initial mesh\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 2: Aachen turbine - Initial mesh</figcaption>\r\n<p>Figure 3 illustrates the iterative convergence of the adaptation process. It consists of nine adaptation steps with the rate controlled by 𝑝 = 3. The adaptation cycle terminated when more than 90 percent of the edges were marked for adaptation.</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig3-Rates-800x343.png\" alt=\"convergence rates of the r.m.s.-residual norms\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 3: Aachen turbine - convergence rates of the r.m.s.-residual norms</figcaption>\r\n<p>Figure 4 shows the adapted mesh at mid-span between hub and shroud. The mesh has adapted in the wake flow and at the leading edge while preserving the hexahedral boundary layer mesh region.</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig4-Mid-Spa800x371.png\" alt=\"adapted mesh at mid-span\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 4: Aachen turbine - adapted mesh at mid-span</figcaption>\r\n<p>The hub-side horseshoe vortex around the leading edge, shown in Figure 5, impacts the end­ wall shear stress in Figure 6. The adapted mesh in Figure 7 resolves these subtle flow features.</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig5-Vortex-800x468.png\" alt=\"horseshoe vortex at the leading edge\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 5: Aachen turbine - horseshoe vortex at the leading edge</figcaption>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig6-Stress-Contours-800x477.png\" alt=\"wall shear stress contours on the hub surface\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 6: Aachen turbine - wall shear stress contours on the hub surface</figcaption>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig7-Hub-Surface-800x470.png\" alt=\"adapted mesh on the hub surface\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 7: Aachen turbine - adapted mesh on the hub surface</figcaption>\r\n<p>Figure 8 shows the <em>p = 2.5</em> simulation times per adaptation cycle for the cumulative simulation times up to the end of each cycle, and the time to compute on a given adapted mesh from initial conditions. At the end of the adaptation cycles, the cumulative time for all adaptation cycles is less than or equal to the computational time to perform one simulation from start to finish on each adapted mesh. The curves show that there is little to no computational penalty by employing mesh adaptation relative to a single solution on any given mesh. Adaptation can be efficiently performed across a speedline, ensuring an optimal mesh for each operating point, for example, by resolving the specific secondary flows and wake departure angles with adapted meshes unique to each operating point.</p>\r\n<img data-src=\"images/Mesh-Adaptation-Works-Fig8-Simulation-Times-800x446.png\" alt=\"simulation times\" class=\"img-fluid mx-auto d-block\" /><figcaption>Figure 8: Aachen turbine - simulation times</figcaption>\r\n<h2>Summary & Outlook</h2>\r\n<p>A new adaptation process exists that achieves the hopes and promises of adaptation from long ago. Pointwise and ISimQ have developed an efficient adaptation procedure that:</p>\r\n<ul>\r\n<li>adapts to the underlying geometry,</li>\r\n<li>efficiently resolves the mesh with high aspect ratios within boundary layer regions,</li>\r\n<li>provides effective control over the rate of adaptation, focusing on regions where the mesh is coarse, thereby</li>\r\n<li>successively improving the mesh quality, leading to a</li>\r\n<li>highly robust and efficient automated mesh adaptation procedure for the effective control of discretisation error on real-world cases.</li>\r\n</ul>\r\n<h3>References</h3>\r\n<ol>\r\n<li><a id=\"ref1\" class=\"anchor\"></a>Walraevens, R. E., Gallus, H. E., 1995, &ldquo;Stator-Rotor-Stator Interaction in an Axial Flow Turbine and its Influence on Loss Mech­anisms&rdquo;, AGARD CP 571</li>\r\n</ol>\r\n\r\n                 ","__v":0,"ctaBarTitleA":"If you want to watch how to develop a solution-based mesh adaptation schema, Watch “Improve CFD Efficiency with Solution-Based Mesh Adaptation.” ","ctaBarTitleB":"If you want to take the case study, “Mesh Adaptation That Works,” offline, click the button to download your copy.","ctaButtonA":"e0886519-097d-4bc4-acbc-64bb7cf3c628","ctaButtonB":"b1956735-a097-44f2-84d5-e698a13f24a0","ctaAltA":"Watch Now","ctaAltB":"Download","ymal1Abstract":"","ymal1Alt":"","ymal1Img":"","ymal1Title":"","ymal1Url":"","ymal2Abstract":"","ymal2Alt":"","ymal2Img":"","ymal2Title":"","ymal2Url":"","ymal3Abstract":"         ","ymal3Alt":"","ymal3Img":"","ymal3Title":"","ymal3Url":""}
{"_id":{"$oid":"601d992cddd82d4f3c746a49"},"references":[],"title":"28X Increase in Simulation Speed by Using Pointwise Meshes","abstract":"In collaboration with NASA GRC, ADSCFD applied the ADSCFD GPU accelerated flow solver to the challenge. With typical speedups of nearly 30X, effective casing treatment analysis now takes a few hours rather than weeks on traditional compute infrastructure.","postDate":{"$date":"2021-02-08T00:00:00Z"},"imgUrl":"ADSCFD-3840x1200.png","imgAltText":"Pointwise is able to efficiently produce high quality mesh for both bladed passages and casing treatment flows.","author":"","clientName":"ADSCFD","clientLogo":"ADSCFD-Logo-400x71.png","clientSinceHead":"Software Partner Since","clientSince":"2013","clientAboutHead":"About the Partner","clientAbout":"ADSCFD delivers aerospace-class CFD for the global turbomachinery industry. Built on the innovations of Ron-Ho Ni and rooted in decades of cutting edge aerospace application, the ADSCFD solution suite enables turbomachinery designers to tackle a wide range of compressor and turbine flow problems with confidence. The company is privately-held and headquartered in Danville, California. For more information, visit <a href=\"https://new.aerodynamic-solutions.com/\" target=\"_blank\" rel=\"noreferrer noopener\">www.adscfd.com</a>.","challenge":"A challenge for compressor designers is management of tip clearance flow and its effect on stall margin. Novel casing treatments can increase operating range, however, cost and complexity of these methods prohibit their inclusion into the design cycle. ","solution":"In collaboration with NASA GRC, ADSCFD applied the ADSCFD GPU accelerated flow solver to the challenge. With typical speedups of nearly 30X, effective casing treatment analysis now takes a few hours rather than weeks on traditional compute infrastructure.","benefit":"With Pointwise meshes and ADSCFD GPU accelerated CFD, simulation times are reduced by nearly 30X; reducing the turnaround time for a simulation that would take a month with traditional CPU technology down to a single day.  ","ctaBarTitleA":"Download AeroDynamic Solutions’ case study, “GPU Accelerated Simulation of Compressor Casing Treatments.” ","ctaButtonA":"59c9528d-618e-42be-9fd7-814868cffb22","ctaBarTitleB":"","ctaButtonB":"","gated":false,"caseStudy":"<p>For turbomachinery compressor designers, a delicate balance exists between system performance and system stability. It can be the deciding factor on whether an engine program is successful or not, which affects billions of dollars in revenue for large OEMs. As a designer moves towards higher compression ratio systems, managing stall margin becomes a critical factor. Optimizing airfoil design to maximize both performance and stall margin is a mature area, so designers need to look outside of traditional airfoil design to make further gains. One very promising area that is a current area of interest is non-axisymmetric endwall contouring. By contouring the endwalls, with a specific focus on the outer casing, the designer has additional tools at their disposal to manipulate the unsteady loading seen by the airfoils which allow for improvement to performance and stall margin at various points within the compressor map.</p>\r\n<p>Novel casing treatment geometries have been shown experimentally to improve stall margin. However, they have not been widely adopted by industry due to the analysis complexity and the requirement of large scale unsteady simulations to attain meaningful results. Using current technologies, this analysis often requires hundreds of CPUs and weeks to complete just one analysis, precluding its use during the design cycle. The problem is also complicated by requiring extremely high-quality transfer of data along the sliding mesh interface. Traditional multi-block structured grids facilitate accurate and computationally inexpensive interpolation methods but are extremely difficult to generate for complicated endwall treatment designs. Unstructured grids are much easier to generate but require more complex and computationally expensive interpolation approaches to achieve similar levels of accuracy. </p>\r\n<img data-src=\"images/ADSCFD-Fig2-Flow-Path-800x480.png\" alt=\"Meridional flow path\" class=\"img-fluid center-block\" />\r\n<figcaption>Meridional flow path</figcaption>\r\n<p>With Pointwise meshes and ADSCFD GPU accelerated CFD, simulation times are reduced by nearly 30X; reducing the turnaround time for a simulation that would take a month with traditional CPU technology down to a single day. This reduction in turnaround time enables such an analysis to be moved from something exotic and reserved for research to something useable for a designer within a typical commercial design cycle. The Pointwise capability to create hybrid unstructured grids, where surface boundaries can be meshed with a fully structured surface mesh but then combined with a fully unstructured volume mesh, gives the best of both worlds for these simulations: the speed and accuracy available to structured grid sliding mesh methods and the ease of mesh generation typically only available with fully unstructured grids.</p>\r\n<p>AeroDynamice Solutions created a more detailed case study about the process. To download the PDF, click the download button below.</p>\r\n    ","__v":0,"ymal1Abstract":"","ymal1Alt":"","ymal1Img":"","ymal1Title":"","ymal1Url":"","ymal2Abstract":"","ymal2Alt":"","ymal2Img":"","ymal2Title":"","ymal2Url":"","ymal3Abstract":"    ","ymal3Alt":"","ymal3Img":"","ymal3Title":"","ymal3Url":""}
