{"_id":{"$oid":"603949136ea94a42c04a7557"},"title":"Project Geode: Geometry for Simulation","slug":"index.html","description":"Project Geode is Pointwise's response to the NASA CFD Vision 2030 Study's identification of the lack of CFD software access to geometry.","copy":"\t<section id=\"introduction\">\r\n\t<div class=\"geode-intro img-fluid\" data-src=\"images/geode-background.png\" >\r\n\t\t<div class=\"container\">\r\n\t\t\t<div class=\"row\">\r\n\t\t\t\t<div class=\"col-lg-12\">\r\n\t\t\t\t\t<div class=\"intro-message-pw\">\r\n\t\t\t\t\t\t<h1>Project Geode: Geometry for Simulation</h1>\r\n\t\t\t\t\t\t<hr class=\"intro-divider\">\r\n\t\t\t\t\t\t<p>\r\n\t\t\t\t\t\t\tProject Geode is Pointwise's response to the NASA CFD Vision 2030 Study's identification of the lack of CFD software access to geometry. We are making available to a select group of customers and partners the core components of the geometry kernel inside the Pointwise meshing software during a no-cost beta testing program.\r\n\t\t\t\t\t\t</p>\r\n\t\t\t\t\t</div>\r\n\t\t\t\t</div>\r\n\t\t\t</div>\r\n\t\t</div>\r\n\t</div>\r\n</section>\r\n\r\n<section id=\"article\">\r\n\t<div class=\"container\">\r\n\t\t<div class=\"row\">\r\n\r\n\t\t\t<div class=\"col-lg-12\">\r\n\t\t\t\t<br>\r\n\t\t\t\t<h2>The Geometry Kernel</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe Project Geode kernel is a fourth generation, solid modeling and geometry kernel written in C++. It is available on Windows, Linux, and Mac in both 32-bit and 64-bit builds.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe kernel's core math, geometry, and topology libraries have been packaged and are now being made available to select users. It is not intended to compete with or replace the many fine geometry kernels &ndash; both proprietary and open-source &ndash; currently available in the market today. The Project Geode kernel is tuned to the needs of engineering simulation. Its heritage is the full geometry modeling kernel which forms the basis of Pointwise's geometry-related capabilities.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Beta Testing</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tIn order to validate the usefulness of the kernel to the CFD community, we have launched a beta testing program. There is no cost to participate in the beta testing program but we do require execution of an MOU or Beta Agreement and ask that you share feedback and success stories.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tIn addition to the kernel's libraries, you will have access to a full suite of documentation including sample code.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tTo participate in the beta testing of the Project Geode kernel, send an email to <a href=\"mailto:geode@pointwise.com?subject=Project%20Geode\">geode@pointwise.com</a> and describe your intended use. Please note that our resources to adminster the beta program are limited and therefore priority will be given to current Pointwise customers and partners.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t</div>\r\n\r\n\t\t</div>\r\n\t</div>\r\n</section>","__v":0}
