{"_id":{"$oid":"60395b0891384653142d3f87"},"title":"Legal Notices","slug":"index.html","description":"Pointwise is a registered trademark of Pointwise, Inc. in the USA and the EU.","copy":"<h1>Legal Notices</h1>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tCopyright &copy; 1996 - <script type=\"text/javascript\">\r\n\t\t\t\t\tlet currentTime = new Date()\r\n\t\t\t\t\tlet year = currentTime.getFullYear()\r\n\t\t\t\t\tdocument.write(year)\r\n\t\t\t\t\t</script>\r\n\t\t\t\t\tPointwise, Inc.<br />\r\n\t\t\t\t\tAll rights reserved.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tALTHOUGH DUE CARE HAS BEEN TAKEN TO PRESENT ACCURATE INFORMATION, POINTWISE, INC. DISCLAIMS ALL WARRANTIES, EITHER EXPRESSED OR IMPLIED, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, AND THIS EXPRESS WARRANTY IS IN LIEU OF ALL WARRANTIES, LIABILITIES, OR OBLIGATIONS OF POINTWISE, INC. FOR DAMAGES, INCLUDING, BUT NOT LIMITED TO, CONSEQUENTIAL DAMAGES, INCLUDING LOST PROFITS, INCURRING OUT OF OR IN CONNECTION WITH THE DELIVERY, USE, OR PERFORMANCE OF THIS DOCUMENT.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tSpecifications are subject to change without notice.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise is a registered trademark of Pointwise, Inc. in the USA and the EU. Gridgen is a registered trademark and Pointwise Glyph, Gridgen Glyph, T-Rex, Loom, Flashpoint, and Let's Talk Meshing are trademarks of Pointwise, Inc. All other trademarks are property of their respective owner.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor your convenience, we provide a number of links to related web resources. Those sites are operated completely independent of Pointwise, Inc. and we are not responsible for their content.\r\n\t\t\t\t</p>","__v":0}
{"_id":{"$oid":"60395c8a91384653142d3f88"},"title":"Your Privacy at Pointwise","slug":"privacy","description":"We do not collect personal information about you unless you voluntarily provide it to us and we collect, process and use personal information only for performing the relevant service selected by you.","copy":" <p>\r\n                We do not collect personal information about you unless you voluntarily provide it to us and we collect,\r\n                process and use personal information only for performing the relevant service selected by you. That\r\n                information may be gathered when you come onto our website, speak with us on the telephone, send us a\r\n                fax, contact us by email, or communicate with us orally.\r\n            </p>\r\n\r\n            <p>\r\n                The personal information that may be gathered includes your name, fax, telephone number, street address\r\n                and e-mail address. You may also be asked for further information about yourself such as your job\r\n                category and your industry type, your company name and job title, and the number of people in your\r\n                company.\r\n            </p>\r\n\r\n            <p>\r\n                When you purchase products we may collect your credit card number, its expiration date and similar\r\n                payment information. For your protection, we hold your information on our specialized systems for use by\r\n                our personnel who assist you in your purchase. We provide your credit card information to the credit\r\n                card processing company to charge you for your purchases. Order fulfillment is performed by us, not an\r\n                external organization.\r\n            </p>\r\n\r\n            <p>\r\n                We will use best efforts to not transfer information that personally identifies you to anyone else\r\n                without your knowledge and approval at the time it is collected from you. If you are located in a\r\n                territory served by one of our distributors, we will share your information with them so they may\r\n                follow-up with you directly. You will also have the opportunity then to indicate whether you wish to\r\n                decline to receive promotional or marketing material about other products and services of our company or\r\n                others. Please note, however, that we do intend to contact you about matters that affect your on-going\r\n                use of our products and relationship with our company.\r\n            </p>\r\n\r\n            <p>\r\n                Upon your request, we will assist you to review, to delete or to correct or update your personal\r\n                information that you have previously provided. If at any time you believe that we have not adhered to\r\n                our policy with respect to protecting your privacy, or if you have questions regarding the collecting\r\n                and/or use of your personal information or regarding our privacy policy, please contact us. We will use\r\n                all commercially reasonable efforts to promptly address your concern.\r\n            </p>\r\n\r\n            <p>\r\n                To unsubscribe from our mailing list, send an email to <a href=\"mailto:unsubscribe@pointwise.com\">unsubscribe@pointwise.com</a>\r\n                with Unsubscribe in the subject line.\r\n            </p>\r\n\r\n            <p>\r\n                For all other inquiries and requests regarding your privacy, send an email to <a\r\n                        href=\"mailto:privacy@pointwise.com?subject=Privacy\">privacy@pointwise.com</a>.\r\n            </p>","__v":0}
