{"_id":{"$oid":"603d132490bc4c5080c4c1d7"},"title":"MeshLink: Simplified Computational Geometry Access","slug":"index.html","description":"The MeshLink library provides mesh-geometry associativity in an open framework that is neutral with respect to meshing software and geometry kernel.","copy":"<div class=\"meshlink-intro\">\r\n\t\t<div class=\"container\">\r\n\t\t\t<div class=\"row\">\r\n\t\t\t\t<div class=\"col-lg-12\">\r\n\t\t\t\t\t<div class=\"intro-message-pw\">\r\n\t\t\t\t\t\t<h1>MeshLink: Simplified Computational Geometry Access</h1>\r\n\t\t\t\t\t\t<hr class=\"intro-divider\">\r\n\t\t\t\t\t\t<p>\r\n\t\t\t\t\t\t\tThe NASA CFD 2030 Study cited an &ldquo;inadequate linkage with CAD&rdquo; as an impediment to the advancement of CFD. An adequate linkage with CAD requires more than just geometry model interoperability. Such linkage requires knowing how the mesh is associated with the components of the geometry model. That's MeshLink.\r\n\t\t\t\t\t\t</p>\r\n\t\t\t\t\t</div>\r\n\t\t\t\t</div>\r\n\t\t\t</div>\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div class=\"container\">\r\n\t\t<div class=\"row\">\r\n\r\n\t\t\t<div class=\"col-lg-12\">\r\n<br>\r\n\t\t\t\t<h2>MeshLink for Adaptation</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAdaptation offers the potential to remove human interaction from the meshing experience. Instead of relying on a CFD analyst's experience and manual intervention to craft up-front a static mesh, an adaptive mesh will evolve with the CFD solution to resolve all of the relevant flow physics. \r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tAs the mesh adapts to the flow physics it will necessarily need to move,insert, remove or otherwise modify mesh points that adhere to the geometry model. In order to do so, the CFD solver requires access to the geometry model. In this context, access consists of two components.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<ol>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t\t\tA geometry kernel for performing the required computations such as projecting a mesh point onto the model or evaluating the model (for example, curvature, tangency).\r\n\t\t\t\t\t</li>\r\n\t\t\t\t\t<li>\r\n\t\t\t\t \t\tA description of how the mesh is associated with or mapped to the geometry model such as the list of geometry model components with which each mesh component is associated. \r\n\t\t\t\t\t</li>\r\n\t\t\t\t</ol>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tPointwise provides its <a href=\"../geode/\">Project Geode</a> kernel to address the first component. The second component is the subject of MeshLink.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>The MeshLink Library and Schema</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe MeshLink library provides mesh-geometry associativity in an open framework that is neutral with respect to meshing software and geometry kernel. The library is written using the C++ object-oriented programming model and bindings for C, FORTRAN, and Python 3 languages are available. The MeshLink library's API was designed with a mesh-centric focus as it provides a common, natural language for use by third-party CFD solvers. The API provides an interface for creating, modifying, and querying mesh-geometry associativity using mesh nomenclature.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tMeshLink also includes a schema that defines the language used to describe the mesh-geometry associativity. The schema is the basis for implementation of the MeshLink XML file that is used to transfer associativity information between software systems (i.e. from the mesh generator to the flow solver). The MeshLink XML file can be considered the geometry equivalent of a flow solver's boundary condition data.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Download MeshLink</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tYou can download the MeshLink library from GitHub: <a\r\n\t\t\t\t\thref=\"https://github.com/pointwise/MeshLink\">https://github.com/pointwise/MeshLink</a>.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tYou can read the MeshLink documentation on pointwise.com: <a href=\"doc/\">https://www.pointwise.com/meshlink/doc</a>.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tYou should email your MeshLink questions and comments to <a href=\"mailto:meshlink@pointwise.com\">meshlink@pointwise.com</a>.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Acknowlegements</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tThe MeshLink Schema was developed as part of NASA Contract 80NSSC18C0109.\r\n\t\t\t\t\t<br />\r\n\t\t\t\t\tThe MeshLink Library was developed as part of U.S. Air Force Contract FA9101-18-P-0042.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t</div>\r\n\r\n\t\t</div>\r\n\t</div>","__v":0}
