{"_id":{"$oid":"603d46d7a1c30646647fa079"},"title":"The Pointwise Teaching Partnership","subHeading":"The Pointwise Teaching Partnership allows you to use 30 free Pointwise licenses as learning tools for undergraduate and graduate students as long as you maintain your existing Pointwise license.","imgBack":"badge-teaching.png","slug":"index.html","description":"Learn more about how you and your students will benefit from joining us in a Pointwise Teaching Partnership.","copy":"<blockquote class=\"blockquote\">\r\n\t\t\t\t\t<p class=\"mb-0\">&ldquo;The undergraduate students picked up the Pointwise code very quickly and easily. The user interface is so intuitive and &ldquo;familiar&rdquo; that neophyte CFDers were quickly building high quality grids.&rdquo;</p>\r\n\t\t\t\t\t<footer class=\"blockquote-footer\"> Dr. Jed Marquart, Ohio Northern University</footer>\r\n\t\t\t\t</blockquote>\r\n\r\n\t\t\t\t<h2>\r\n\t\t\t\t\tThe Pointwise Teaching Partnership offers\r\n\t\t\t\t</h2>\r\n\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>30 free teaching licenses for the same period of performance as your maintained Pointwise license</li>\r\n\t\t\t\t</ul>\r\n\r\n\t\t\t\t<h2>Qualifications</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tTeaching licenses are available to recognized degree-granting academic institutions that\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Have a minimum of\r\n\r\n\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t<li>one current paid annual Pointwise academic license and/or</li>\r\n\t\t\t\t\t\t<li>one Pointwise perpetual license with current maintenance</li>\r\n\t\t\t\t\t</ul>\r\n\t\t\t\t\t</li>\r\n\r\n\t\t\t\t\t<li>Will be using the free licenses exclusively for a class. These free teaching processes cannot be used for commercially funded research.</li>\r\n\r\n\t\t\t\t</ul>\r\n\r\n\t\t\t\t<h2>Licensing</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tTeaching partnership licenses do not have to be on the same license server as your academic license, but all free licenses must be on a single server. Additionally, teaching processes will have the same period of performance as the maintained Pointwise process.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Consider Training</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tConsider attending a three-day class that covers all aspects Pointwise use, from geometry modeling through volume grid generation. The training schedule is available at <a href=\"../training/\">pointwise.com/training</a>.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<h2>Learn More</h2>\r\n\r\n\t\t\t\t<p>\r\n\t\t\t\t\tFor more information on the Pointwise Teaching Partnership send an email to <a href=\"mailto:teaching@pointwise.com\">teaching@pointwise.com</a>.\r\n\t\t\t\t</p>\r\n\r\n\t\t\t\t<br />","__v":0}
